---------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Documents\disk D\insurance exp\do-files_round2_data\analysis.log
  log type:  text
 opened on:   2 May 2014, 00:11:00

. cd "C:\Documents\disk D\insurance exp\data_round2\final\"
C:\Documents\disk D\insurance exp\data_round2\final

. 
. clear

. 
. use 0422analysis, replace

. egen vilid = group(village)

. sum vilid, d

                       group(village)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            2              1
 5%            6              1
10%            8              1       Obs                4902
25%           12              1       Sum of Wgt.        4902

50%           21                      Mean           24.26377
                        Largest       Std. Dev.      13.49663
75%           37             47
90%           45             47       Variance       182.1591
95%           46             47       Skewness       .2309132
99%           47             47       Kurtosis       1.748195

. xi i.vilid
i.vilid           _Ivilid_1-47        (naturally coded; _Ivilid_1 omitted)

. 
. 
. **********************************************************1. Summary statistics************************
> ************************************
. *1. Table 1, Mean and std 
. tabstat male age agpop educ ricearea_2010 rice_inc disaster_yes disaster_loss risk_averse disaster_prob
>  understanding, stats (count mean sd)

   stats |      male       age     agpop      educ  ric~2010  rice_inc  disas~es  disas~ss  risk_a~e
---------+------------------------------------------------------------------------------------------
       N |      4894      4893      4893      4841      4883      4789      4453      2518      4902
    mean |  .9139763  51.49438  4.915185  1.191902  13.62975  74.11861  .6328318  27.50675  .1888209
      sd |  .2804277  12.03191  2.133418  .8533748  19.50735  27.67502   .482087  18.19906  .3133002
----------------------------------------------------------------------------------------------------

   stats |  disast~b  unders~g
---------+--------------------
       N |      4902      4723
    mean |  33.63282  .4572518
      sd |  16.61935  .3030129
------------------------------

. tabstat network_obs network_rate_preintensive network_twoside network_second, stats (count mean sd)

   stats |  netwo~bs  netwo~ve  netwo~de  networ~d
---------+----------------------------------------
       N |      4588      4588      4588      4521
    mean |  4.918265  .1649738  .0416921  .1677398
      sd |   .433588  .1896223   .098993  .1172219
--------------------------------------------------

. tabstat indegree path_out_ind eigenvector, stats (count mean sd)

   stats |  indegree  path_o~d  eigenv~r
---------+------------------------------
       N |      4588      4588      4588
    mean |  3.244182  2.672834  .1437882
      sd |  1.912167  .8662739  .0831853
----------------------------------------

. tabstat takeup_survey, stats (count mean sd)

    variable |         N      mean        sd
-------------+------------------------------
takeup_sur~y |      4902  .4455324  .4970751
--------------------------------------------

. gen session = 0

. replace session = 11 if delay == 0 & intensive == 0
(1079 real changes made)

. replace session = 12 if delay == 0 & intensive == 1
(1096 real changes made)

. replace session = 21 if delay == 1 & intensive == 0
(1374 real changes made)

. replace session = 22 if delay == 1 & intensive == 1
(1353 real changes made)

. tab session

    session |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |      1,079       22.01       22.01
         12 |      1,096       22.36       44.37
         21 |      1,374       28.03       72.40
         22 |      1,353       27.60      100.00
------------+-----------------------------------
      Total |      4,902      100.00

. tabstat takeup_survey if info_none == 1, stats (count mean sd) by(session) 

Summary for variables: takeup_survey
     by categories of: session 

 session |         N      mean        sd
---------+------------------------------
      11 |      1079  .3521779  .4778706
      12 |      1096  .5036496  .5002149
      21 |       657  .4429224  .4971099
      22 |       660  .4651515  .4991624
---------+------------------------------
   Total |      3492  .4381443  .4962302
----------------------------------------

. 
. *2. Table A1, Check randomization by sessions
. foreach x in male age agpop educ ricearea_2010 rice_inc disaster_yes disaster_loss{
  2.         oneway `x' session, b t
  3. } 

            |        Summary of Household
            |     Characteristics: Gender of
            |  Household Head, 1=male, 0=female
    session |        Mean   Std. Dev.       Freq.
------------+------------------------------------
         11 |   .90824838   .28880887        1079
         12 |   .92321755   .26636772        1094
         21 |   .91034985   .28578405        1372
         22 |   .91475167   .27935444        1349
------------+------------------------------------
      Total |    .9139763    .2804277        4894

                        Analysis of Variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups      .147683714      3   .049227905      0.63     0.5982
 Within groups      384.636338   4890   .078657738
------------------------------------------------------------------------
    Total           384.784021   4893   .078639694

Bartlett's test for equal variances:  chi2(3) =   8.5282  Prob>chi2 = 0.036

                                Comparison of
    Household Characteristics: Gender of Household Head, 1=male, 0=female
                                  by session
                                (Bonferroni)
Row Mean-|
Col Mean |         11         12         21
---------+---------------------------------
      12 |    .014969
         |      1.000
         |
      21 |    .002101   -.012868
         |      1.000      1.000
         |
      22 |    .006503   -.008466    .004402
         |      1.000      1.000      1.000

            |        Summary of Household
            |        Characteristics - Age
    session |        Mean   Std. Dev.       Freq.
------------+------------------------------------
         11 |   51.489322   11.879081        1077
         12 |   51.091408   12.173301        1094
         21 |   51.723962    12.22709        1373
         22 |   51.591549   11.841308        1349
------------+------------------------------------
      Total |    51.49438   12.031907        4893

                        Analysis of Variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups      262.783697      3   87.5945657      0.60     0.6118
 Within groups      707936.312   4889   144.801864
------------------------------------------------------------------------
    Total           708199.095   4892   144.766782

Bartlett's test for equal variances:  chi2(3) =   2.0469  Prob>chi2 = 0.563

           Comparison of Household Characteristics - Age by session
                                (Bonferroni)
Row Mean-|
Col Mean |         11         12         21
---------+---------------------------------
      12 |   -.397915
         |      1.000
         |
      21 |     .23464    .632554
         |      1.000      1.000
         |
      22 |    .102227    .500142   -.132413
         |      1.000      1.000      1.000

            |        Summary of Household
            |  Characteristics - Household Size
    session |        Mean   Std. Dev.       Freq.
------------+------------------------------------
         11 |   4.9024164    2.122472        1076
         12 |   4.8558394   2.0935261        1096
         21 |   4.9431901    2.202829        1373
         22 |   4.9451039   2.1034736        1348
------------+------------------------------------
      Total |    4.915185    2.133418        4893

                        Analysis of Variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups      6.31889956      3   2.10629985      0.46     0.7084
 Within groups      22259.4829   4889   4.55297256
------------------------------------------------------------------------
    Total           22265.8018   4892   4.55147215

Bartlett's test for equal variances:  chi2(3) =   4.2326  Prob>chi2 = 0.237

     Comparison of Household Characteristics - Household Size by session
                                (Bonferroni)
Row Mean-|
Col Mean |         11         12         21
---------+---------------------------------
      12 |   -.046577
         |      1.000
         |
      21 |    .040774    .087351
         |      1.000      1.000
         |
      22 |    .042688    .089264    .001914
         |      1.000      1.000      1.000

            |        Summary of Household
            |     Characteristics - Level of
            | Education, 0=illiteracy, 1=primary,
            |               2=secon
    session |        Mean   Std. Dev.       Freq.
------------+------------------------------------
         11 |   1.1926692   .85852639        1064
         12 |   1.2149446    .8502446        1084
         21 |   1.1941176   .86581421        1360
         22 |   1.1702926   .83932244        1333
------------+------------------------------------
      Total |   1.1919025   .85337475        4841

                        Analysis of Variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups      1.20533468      3   .401778226      0.55     0.6471
 Within groups      3523.51724   4837    .72845095
------------------------------------------------------------------------
    Total           3524.72258   4840   .728248467

Bartlett's test for equal variances:  chi2(3) =   1.4069  Prob>chi2 = 0.704

                                Comparison of
Household Characteristics - Level of Education, 0=illiteracy, 1=primary, 2=secon
                                  by session
                                (Bonferroni)
Row Mean-|
Col Mean |         11         12         21
---------+---------------------------------
      12 |    .022275
         |      1.000
         |
      21 |    .001448   -.020827
         |      1.000      1.000
         |
      22 |   -.022377   -.044652   -.023825
         |      1.000      1.000      1.000

            | Summary of Area of Rice Production
    session |        Mean   Std. Dev.       Freq.
------------+------------------------------------
         11 |   13.667786   14.850037        1075
         12 |    14.81074   25.653105        1094
         21 |   13.041243   13.982457        1368
         22 |   13.237623   21.680085        1346
------------+------------------------------------
      Total |   13.629752   19.507349        4883

                        Analysis of Variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups      2208.15948      3   736.053161      1.94     0.1216
 Within groups      1855571.81   4879    380.31806
------------------------------------------------------------------------
    Total           1857779.97   4882    380.53666

Bartlett's test for equal variances:  chi2(3) = 610.5654  Prob>chi2 = 0.000

               Comparison of Area of Rice Production by session
                                (Bonferroni)
Row Mean-|
Col Mean |         11         12         21
---------+---------------------------------
      12 |    1.14295
         |      1.000
         |
      21 |   -.626543    -1.7695
         |      1.000      0.152
         |
      22 |   -.430163   -1.57312     .19638
         |      1.000      0.285      1.000

            |  Summary of % of Household Income
            |        from Rice Production
    session |        Mean   Std. Dev.       Freq.
------------+------------------------------------
         11 |   75.476865   26.745602        1059
         12 |   74.766945   26.740674        1077
         21 |   73.051128   28.465238        1330
         22 |    73.57672   28.313366        1323
------------+------------------------------------
      Total |   74.118605   27.675017        4789

                        Analysis of Variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups      4310.45957      3   1436.81986      1.88     0.1312
 Within groups      3662850.17   4785    765.48593
------------------------------------------------------------------------
    Total           3667160.63   4788   765.906565

Bartlett's test for equal variances:  chi2(3) =   8.4344  Prob>chi2 = 0.038

     Comparison of % of Household Income from Rice Production by session
                                (Bonferroni)
Row Mean-|
Col Mean |         11         12         21
---------+---------------------------------
      12 |    -.70992
         |      1.000
         |
      21 |   -2.42574   -1.71582
         |      0.200      0.782
         |
      22 |   -1.90015   -1.19023    .525592
         |      0.575      1.000      1.000

            |  Summary of Any Disaster Happened
            |       Last Year, 1=yes, 0=no
    session |        Mean   Std. Dev.       Freq.
------------+------------------------------------
         11 |   .62613982   .48407247         987
         12 |   .63509472   .48164375        1003
         21 |   .63754045   .48090512        1236
         22 |   .63162184   .48256137        1227
------------+------------------------------------
      Total |    .6328318   .48208703        4453

                        Analysis of Variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups      .078536798      3   .026178933      0.11     0.9528
 Within groups      1034.60145   4449   .232546967
------------------------------------------------------------------------
    Total           1034.67999   4452   .232407905

Bartlett's test for equal variances:  chi2(3) =   0.0515  Prob>chi2 = 0.997

    Comparison of Any Disaster Happened Last Year, 1=yes, 0=no by session
                                (Bonferroni)
Row Mean-|
Col Mean |         11         12         21
---------+---------------------------------
      12 |    .008955
         |      1.000
         |
      21 |    .011401    .002446
         |      1.000      1.000
         |
      22 |    .005482   -.003473   -.005919
         |      1.000      1.000      1.000

            |   Summary of Loss in Yield Due to
            |         Disaster Last Year
    session |        Mean   Std. Dev.       Freq.
------------+------------------------------------
         11 |   27.041812    18.49829         574
         12 |   27.682692   18.116316         624
         21 |    27.60119   18.374037         672
         22 |   27.651235   17.861185         648
------------+------------------------------------
      Total |   27.506751   18.199065        2518

                        Analysis of Variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups      162.917574      3   54.3058579      0.16     0.9208
 Within groups      833482.468   2514   331.536383
------------------------------------------------------------------------
    Total           833645.385   2517   331.205954

Bartlett's test for equal variances:  chi2(3) =   0.9046  Prob>chi2 = 0.824

       Comparison of Loss in Yield Due to Disaster Last Year by session
                                (Bonferroni)
Row Mean-|
Col Mean |         11         12         21
---------+---------------------------------
      12 |     .64088
         |      1.000
         |
      21 |    .559379   -.081502
         |      1.000      1.000
         |
      22 |    .609423   -.031458    .050044
         |      1.000      1.000      1.000

. 
. **********************************************************2.Intensive session effect*******************
> *****************************************
. gen inter_intensive_educ = intensive*educ_good

. gen inter_intensive_age = intensive*age
(9 missing values generated)

. gen inter_intensive_exp = intensive*insurance_repay

. gen inter_intensive_risk = intensive*risk_averse

. gen inter_intensive_day = intensive*day 

. 
. local outputfile0 Table2.xls

. *intensive session effect: table2, col 1
. reg takeup_survey intensive male age agpop ricearea_2010 literacy _Ivilid* if delay == 0, cluster(addre
> ss)

Linear regression                                      Number of obs =    2137
                                                       F( 48,   172) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1251
                                                       Root MSE      =  .46905

                               (Std. Err. adjusted for 173 clusters in address)
-------------------------------------------------------------------------------
              |               Robust
takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
    intensive |   .1408242   .0260309     5.41   0.000     .0894431    .1922054
         male |   .0407053   .0474814     0.86   0.392    -.0530159    .1344265
          age |   .0017669   .0010681     1.65   0.100    -.0003415    .0038752
        agpop |  -.0029449   .0051839    -0.57   0.571    -.0131771    .0072873
ricearea_2010 |   .0007886   .0007542     1.05   0.297       -.0007    .0022772
     literacy |    .083205   .0269222     3.09   0.002     .0300646    .1363454
    _Ivilid_2 |  -.4123784    .105623    -3.90   0.000    -.6208625   -.2038943
    _Ivilid_3 |  -.1940895   .0321591    -6.04   0.000    -.2575668   -.1306122
    _Ivilid_4 |  -.2424232   .0365943    -6.62   0.000     -.314655   -.1701914
    _Ivilid_5 |  -.1673066   .1532014    -1.09   0.276    -.4697034    .1350903
    _Ivilid_6 |    .233148    .027189     8.58   0.000     .1794809    .2868151
    _Ivilid_7 |  -.2599335   .0585243    -4.44   0.000    -.3754518   -.1444152
    _Ivilid_8 |  -.2345645    .095587    -2.45   0.015    -.4232391     -.04589
    _Ivilid_9 |  -.2557939   .0970368    -2.64   0.009    -.4473302   -.0642576
   _Ivilid_10 |  -.2849145   .1163177    -2.45   0.015    -.5145083   -.0553206
   _Ivilid_11 |  -.1285052   .0833695    -1.54   0.125    -.2930644    .0360539
   _Ivilid_12 |   .0229908   .1127212     0.20   0.839    -.1995041    .2454857
   _Ivilid_13 |   .0009335   .0830125     0.01   0.991    -.1629208    .1647878
   _Ivilid_14 |  -.1539832   .1051269    -1.46   0.145    -.3614882    .0535219
   _Ivilid_15 |   .1156739   .0673712     1.72   0.088    -.0173068    .2486546
   _Ivilid_16 |  -.5002053   .0111914   -44.70   0.000    -.5222955    -.478115
   _Ivilid_17 |  -.4074481   .0673014    -6.05   0.000    -.5402911   -.2746051
   _Ivilid_18 |  -.0584232   .1461399    -0.40   0.690    -.3468818    .2300355
   _Ivilid_19 |  -.2921655   .0701459    -4.17   0.000    -.4306232   -.1537078
   _Ivilid_20 |  -.1324631   .1225829    -1.08   0.281    -.3744236    .1094973
   _Ivilid_21 |  -.2456389   .0579806    -4.24   0.000    -.3600841   -.1311937
   _Ivilid_22 |  -.2850252   .1693864    -1.68   0.094     -.619369    .0493186
   _Ivilid_23 |  -.2555737   .1073237    -2.38   0.018    -.4674148   -.0437327
   _Ivilid_24 |  -.1181014   .0655432    -1.80   0.073     -.247474    .0112711
   _Ivilid_25 |   .0228554   .0748461     0.31   0.760    -.1248798    .1705905
   _Ivilid_26 |     .09435   .1124886     0.84   0.403    -.1276859    .3163858
   _Ivilid_27 |  -.1907178   .0958798    -1.99   0.048    -.3799704   -.0014651
   _Ivilid_28 |   .0683045   .0835142     0.82   0.415    -.0965402    .2331492
   _Ivilid_29 |   -.381898   .0797254    -4.79   0.000    -.5392642   -.2245319
   _Ivilid_30 |  -.2715477   .0871399    -3.12   0.002     -.443549   -.0995464
   _Ivilid_31 |   .0914096   .0185407     4.93   0.000      .054813    .1280062
   _Ivilid_32 |   .2450654   .1094809     2.24   0.026     .0289662    .4611645
   _Ivilid_33 |   .0920943   .1357091     0.68   0.498    -.1757754    .3599641
   _Ivilid_34 |  -.2613101   .2199718    -1.19   0.237     -.695502    .1728818
   _Ivilid_35 |  -.1738035   .0143662   -12.10   0.000    -.2021604   -.1454467
   _Ivilid_36 |  -.1826537   .0427178    -4.28   0.000    -.2669723   -.0983351
   _Ivilid_37 |  -.2841952   .0867025    -3.28   0.001    -.4553332   -.1130573
   _Ivilid_38 |   .0587897   .0270967     2.17   0.031     .0053048    .1122745
   _Ivilid_39 |  -.4263741   .0295278   -14.44   0.000    -.4846575   -.3680907
   _Ivilid_40 |  -.1489744   .1066803    -1.40   0.164    -.3595456    .0615967
   _Ivilid_41 |  -.0932542    .024823    -3.76   0.000    -.1422511   -.0442574
   _Ivilid_42 |  -.3919875   .0352782   -11.11   0.000    -.4616214   -.3223535
   _Ivilid_43 |  -.1611961   .0503166    -3.20   0.002    -.2605136   -.0618786
   _Ivilid_44 |  -.4803191   .0483564    -9.93   0.000    -.5757674   -.3848708
   _Ivilid_45 |  -.0252228   .0967524    -0.26   0.795    -.2161977    .1657521
   _Ivilid_46 |  -.3062709   .0642418    -4.77   0.000    -.4330747    -.179467
   _Ivilid_47 |  -.2889457   .1000622    -2.89   0.004    -.4864536   -.0914378
        _cons |   .3634212   .0863035     4.21   0.000     .1930709    .5337714
-------------------------------------------------------------------------------

. outreg2 using `outputfile0'
Table2.xls
dir : seeout

. local outputfile1 TableA3.xls

. *heterogeneity: table A3
. reg takeup_survey intensive inter_intensive_age male age agpop ricearea_2010 literacy _Ivilid* if delay
>  == 0, cluster(address)

Linear regression                                      Number of obs =    2137
                                                       F( 49,   172) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1251
                                                       Root MSE      =  .46916

                                     (Std. Err. adjusted for 173 clusters in address)
-------------------------------------------------------------------------------------
                    |               Robust
      takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          intensive |    .135688   .0965379     1.41   0.162    -.0548635    .3262395
inter_intensive_age |   .0001001   .0018819     0.05   0.958    -.0036145    .0038147
               male |   .0407791   .0475616     0.86   0.392    -.0531004    .1346587
                age |   .0017156   .0014195     1.21   0.228    -.0010864    .0045175
              agpop |   -.002945   .0051857    -0.57   0.571    -.0131808    .0072909
      ricearea_2010 |   .0007894   .0007554     1.05   0.297    -.0007016    .0022803
           literacy |   .0831936    .026953     3.09   0.002     .0299924    .1363947
          _Ivilid_2 |   -.412183   .1054812    -3.91   0.000    -.6203872   -.2039788
          _Ivilid_3 |   -.194016    .032196    -6.03   0.000    -.2575661   -.1304658
          _Ivilid_4 |  -.2422795   .0368003    -6.58   0.000    -.3149178   -.1696411
          _Ivilid_5 |  -.1673056   .1532209    -1.09   0.276    -.4697409    .1351297
          _Ivilid_6 |   .2330991   .0272657     8.55   0.000     .1792807    .2869175
          _Ivilid_7 |  -.2598394   .0583748    -4.45   0.000    -.3750627   -.1446162
          _Ivilid_8 |  -.2344689   .0956022    -2.45   0.015    -.4231735   -.0457643
          _Ivilid_9 |  -.2558067   .0971018    -2.63   0.009    -.4474713   -.0641421
         _Ivilid_10 |  -.2849409   .1162989    -2.45   0.015    -.5144976   -.0553841
         _Ivilid_11 |  -.1285413   .0834029    -1.54   0.125    -.2931663    .0360837
         _Ivilid_12 |   .0229836   .1127764     0.20   0.839    -.1996204    .2455875
         _Ivilid_13 |   .0009829   .0829497     0.01   0.991    -.1627475    .1647133
         _Ivilid_14 |  -.1538872   .1051765    -1.46   0.145    -.3614902    .0537157
         _Ivilid_15 |   .1154904   .0672117     1.72   0.088    -.0171756    .2481564
         _Ivilid_16 |  -.5002982   .0112172   -44.60   0.000    -.5224393   -.4781572
         _Ivilid_17 |  -.4074899    .067471    -6.04   0.000    -.5406676   -.2743122
         _Ivilid_18 |  -.0584891   .1461442    -0.40   0.689    -.3469561    .2299779
         _Ivilid_19 |  -.2922491   .0703526    -4.15   0.000    -.4311146   -.1533835
         _Ivilid_20 |  -.1323332   .1227509    -1.08   0.283    -.3746253     .109959
         _Ivilid_21 |  -.2457448   .0580445    -4.23   0.000     -.360316   -.1311737
         _Ivilid_22 |  -.2852809   .1692708    -1.69   0.094    -.6193964    .0488347
         _Ivilid_23 |  -.2557373   .1070938    -2.39   0.018    -.4671246   -.0443501
         _Ivilid_24 |  -.1180182   .0658386    -1.79   0.075    -.2479739    .0119375
         _Ivilid_25 |   .0227171   .0748459     0.30   0.762    -.1250176    .1704519
         _Ivilid_26 |   .0942708   .1124979     0.84   0.403    -.1277835     .316325
         _Ivilid_27 |  -.1904067   .0953666    -2.00   0.047    -.3786463   -.0021672
         _Ivilid_28 |   .0682927   .0835144     0.82   0.415    -.0965524    .2331378
         _Ivilid_29 |  -.3820367   .0798811    -4.78   0.000    -.5397102   -.2243632
         _Ivilid_30 |  -.2714478   .0872485    -3.11   0.002    -.4436634   -.0992322
         _Ivilid_31 |   .0915044   .0186823     4.90   0.000     .0546283    .1283805
         _Ivilid_32 |   .2451799   .1095363     2.24   0.026     .0289714    .4613883
         _Ivilid_33 |    .092161   .1357802     0.68   0.498     -.175849     .360171
         _Ivilid_34 |  -.2613916   .2201255    -1.19   0.237    -.6958868    .1731035
         _Ivilid_35 |  -.1734935   .0152506   -11.38   0.000     -.203596    -.143391
         _Ivilid_36 |  -.1826065   .0428126    -4.27   0.000    -.2671123   -.0981007
         _Ivilid_37 |  -.2842094   .0866775    -3.28   0.001     -.455298   -.1131208
         _Ivilid_38 |   .0586903   .0271162     2.16   0.032     .0051669    .1122136
         _Ivilid_39 |  -.4264652   .0294898   -14.46   0.000    -.4846736   -.3682567
         _Ivilid_40 |  -.1489666   .1066756    -1.40   0.164    -.3595285    .0615952
         _Ivilid_41 |  -.0932067   .0247556    -3.77   0.000    -.1420706   -.0443429
         _Ivilid_42 |  -.3919683   .0353037   -11.10   0.000    -.4616525   -.3222841
         _Ivilid_43 |  -.1611158   .0502621    -3.21   0.002    -.2603257   -.0619058
         _Ivilid_44 |  -.4803038   .0483521    -9.93   0.000    -.5757436   -.3848639
         _Ivilid_45 |  -.0251455   .0967891    -0.26   0.795    -.2161929     .165902
         _Ivilid_46 |  -.3061741   .0644698    -4.75   0.000     -.433428   -.1789203
         _Ivilid_47 |  -.2890293   .1000066    -2.89   0.004    -.4864275   -.0916311
              _cons |   .3659834   .0965421     3.79   0.000     .1754236    .5565431
-------------------------------------------------------------------------------------

. test intensive inter_intensive_age

 ( 1)  intensive = 0
 ( 2)  inter_intensive_age = 0

       F(  2,   172) =   14.86
            Prob > F =    0.0000

. outreg2 using `outputfile1'
TableA3.xls
dir : seeout

. reg takeup_survey intensive inter_intensive_educ male age agpop ricearea_2010 educ_good _Ivilid* if del
> ay == 0, cluster(address)

Linear regression                                      Number of obs =    2161
                                                       F( 49,   172) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1279
                                                       Root MSE      =   .4682

                                      (Std. Err. adjusted for 173 clusters in address)
--------------------------------------------------------------------------------------
                     |               Robust
       takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
           intensive |   .1510852   .0346826     4.36   0.000     .0826269    .2195435
inter_intensive_educ |  -.0210208   .0480495    -0.44   0.662    -.1158635    .0738218
                male |   .0439415   .0469062     0.94   0.350    -.0486444    .1365274
                 age |   .0018527   .0010408     1.78   0.077    -.0002016     .003907
               agpop |   -.002155   .0053718    -0.40   0.689    -.0127582    .0084482
       ricearea_2010 |   .0007734   .0007665     1.01   0.314    -.0007396    .0022864
           educ_good |   .0938914   .0342651     2.74   0.007     .0262573    .1615256
           _Ivilid_2 |  -.3924125   .1010118    -3.88   0.000    -.5917949     -.19303
           _Ivilid_3 |  -.1828188   .0328747    -5.56   0.000    -.2477087    -.117929
           _Ivilid_4 |  -.2470334   .0457009    -5.41   0.000    -.3372401   -.1568266
           _Ivilid_5 |  -.1664581   .1473993    -1.13   0.260    -.4574025    .1244864
           _Ivilid_6 |   .2263846   .0213732    10.59   0.000      .184197    .2685721
           _Ivilid_7 |  -.2635023    .058089    -4.54   0.000    -.3781614   -.1488432
           _Ivilid_8 |  -.2400628   .0962245    -2.49   0.014    -.4299958   -.0501299
           _Ivilid_9 |   -.264666   .0934788    -2.83   0.005    -.4491793   -.0801528
          _Ivilid_10 |  -.2782901   .1129773    -2.46   0.015    -.5012906   -.0552896
          _Ivilid_11 |  -.1278523   .0823421    -1.55   0.122    -.2903835    .0346789
          _Ivilid_12 |   .0299951   .1152061     0.26   0.795    -.1974047    .2573949
          _Ivilid_13 |   .0005866   .0854602     0.01   0.995    -.1680991    .1692723
          _Ivilid_14 |  -.1493379   .1045371    -1.43   0.155    -.3556787     .057003
          _Ivilid_15 |    .109511   .0705583     1.55   0.122    -.0297606    .2487826
          _Ivilid_16 |  -.5003261   .0117232   -42.68   0.000     -.523466   -.4771861
          _Ivilid_17 |  -.3987804   .0689677    -5.78   0.000    -.5349124   -.2626484
          _Ivilid_18 |    -.05636   .1396582    -0.40   0.687    -.3320246    .2193047
          _Ivilid_19 |   -.291899   .0672791    -4.34   0.000    -.4246981      -.1591
          _Ivilid_20 |   -.120443   .1205155    -1.00   0.319    -.3583227    .1174367
          _Ivilid_21 |  -.2370603   .0584211    -4.06   0.000    -.3523749   -.1217456
          _Ivilid_22 |  -.2773728   .1708986    -1.62   0.106    -.6147014    .0599558
          _Ivilid_23 |  -.2283365   .1226803    -1.86   0.064    -.4704894    .0138163
          _Ivilid_24 |  -.1246784   .0631782    -1.97   0.050    -.2493828    .0000261
          _Ivilid_25 |   .0202698   .0774014     0.26   0.794     -.132509    .1730487
          _Ivilid_26 |   .0900335   .1100005     0.82   0.414    -.1270912    .3071583
          _Ivilid_27 |  -.1937836   .0935729    -2.07   0.040    -.3784828   -.0090844
          _Ivilid_28 |   .0676231   .0748222     0.90   0.367    -.0800649    .2153111
          _Ivilid_29 |  -.3610157    .088833    -4.06   0.000     -.536359   -.1856725
          _Ivilid_30 |  -.2768951   .0880994    -3.14   0.002    -.4507903   -.1029999
          _Ivilid_31 |   .1158721   .0205359     5.64   0.000     .0753373     .156407
          _Ivilid_32 |   .2410382   .1062964     2.27   0.025     .0312249    .4508515
          _Ivilid_33 |   .0672735   .1323426     0.51   0.612    -.1939513    .3284983
          _Ivilid_34 |  -.2633949   .2278987    -1.16   0.249    -.7132333    .1864434
          _Ivilid_35 |  -.1762989   .0142781   -12.35   0.000    -.2044817    -.148116
          _Ivilid_36 |  -.1748299   .0352656    -4.96   0.000     -.244439   -.1052207
          _Ivilid_37 |  -.2791964   .0863922    -3.23   0.001    -.4497218    -.108671
          _Ivilid_38 |   .0577737    .027181     2.13   0.035     .0041224    .1114251
          _Ivilid_39 |  -.4030645   .0646689    -6.23   0.000    -.5307113   -.2754177
          _Ivilid_40 |  -.1403773   .1056811    -1.33   0.186    -.3489761    .0682216
          _Ivilid_41 |  -.0939161   .0228419    -4.11   0.000    -.1390026   -.0488297
          _Ivilid_42 |  -.3804682   .0377401   -10.08   0.000    -.4549617   -.3059747
          _Ivilid_43 |    -.16672   .0477162    -3.49   0.001    -.2609048   -.0725352
          _Ivilid_44 |  -.4787976   .0476459   -10.05   0.000    -.5728435   -.3847517
          _Ivilid_45 |  -.0199414   .1002981    -0.20   0.843     -.217915    .1780323
          _Ivilid_46 |  -.3025909   .0645808    -4.69   0.000    -.4300639    -.175118
          _Ivilid_47 |  -.2712112   .0957402    -2.83   0.005    -.4601882   -.0822343
               _cons |   .3790967   .0840263     4.51   0.000     .2132413    .5449521
--------------------------------------------------------------------------------------

. test intensive inter_intensive_educ

 ( 1)  intensive = 0
 ( 2)  inter_intensive_educ = 0

       F(  2,   172) =   15.39
            Prob > F =    0.0000

. outreg2 using `outputfile1'
TableA3.xls
dir : seeout

. reg takeup_survey intensive inter_intensive_exp insurance_repay male age agpop ricearea_2010 literacy _
> Ivilid* if delay == 0, cluster(address)

Linear regression                                      Number of obs =    2137
                                                       F( 50,   172) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1269
                                                       Root MSE      =  .46879

                                     (Std. Err. adjusted for 173 clusters in address)
-------------------------------------------------------------------------------------
                    |               Robust
      takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          intensive |    .127858   .0327611     3.90   0.000     .0631925    .1925235
inter_intensive_exp |    .033493   .0455258     0.74   0.463    -.0563682    .1233542
    insurance_repay |   .0237274    .032684     0.73   0.469    -.0407861    .0882408
               male |   .0400201   .0471824     0.85   0.398     -.053111    .1331511
                age |   .0017503    .001075     1.63   0.105    -.0003715    .0038721
              agpop |  -.0031501   .0051945    -0.61   0.545    -.0134033     .007103
      ricearea_2010 |   .0007556   .0007297     1.04   0.302    -.0006847    .0021959
           literacy |   .0829524   .0268016     3.10   0.002     .0300499    .1358548
          _Ivilid_2 |  -.4107583   .1090766    -3.77   0.000    -.6260592   -.1954573
          _Ivilid_3 |  -.1914784   .0343574    -5.57   0.000    -.2592948    -.123662
          _Ivilid_4 |  -.2465776   .0360918    -6.83   0.000    -.3178174   -.1753377
          _Ivilid_5 |  -.1667951   .1589223    -1.05   0.295    -.4804842    .1468941
          _Ivilid_6 |   .2298177   .0326422     7.04   0.000     .1653868    .2942486
          _Ivilid_7 |  -.2664594   .0594588    -4.48   0.000    -.3838222   -.1490965
          _Ivilid_8 |  -.2404683   .0962192    -2.50   0.013    -.4303907   -.0505459
          _Ivilid_9 |  -.2604943   .0934967    -2.79   0.006     -.445043   -.0759455
         _Ivilid_10 |  -.2895084   .1160684    -2.49   0.014    -.5186102   -.0604066
         _Ivilid_11 |  -.1302685   .0833145    -1.56   0.120     -.294719    .0341821
         _Ivilid_12 |   .0171495   .1132497     0.15   0.880    -.2063888    .2406877
         _Ivilid_13 |  -.0016364   .0822256    -0.02   0.984    -.1639376    .1606647
         _Ivilid_14 |  -.1534508   .1060719    -1.45   0.150     -.362821    .0559194
         _Ivilid_15 |   .1013376   .0690912     1.47   0.144    -.0350382    .2377134
         _Ivilid_16 |  -.5141202   .0158828   -32.37   0.000    -.5454704     -.48277
         _Ivilid_17 |  -.4052326   .0693938    -5.84   0.000    -.5422057   -.2682594
         _Ivilid_18 |  -.0632822   .1436794    -0.44   0.660    -.3468841    .2203198
         _Ivilid_19 |  -.2894079   .0726712    -3.98   0.000      -.43285   -.1459657
         _Ivilid_20 |  -.1235664   .1222996    -1.01   0.314    -.3649678     .117835
         _Ivilid_21 |  -.2362791   .0596984    -3.96   0.000     -.354115   -.1184432
         _Ivilid_22 |  -.2838984    .167139    -1.70   0.091    -.6138061    .0460093
         _Ivilid_23 |  -.2629378   .1106788    -2.38   0.019    -.4814014   -.0444743
         _Ivilid_24 |  -.1200624   .0675166    -1.78   0.077    -.2533301    .0132053
         _Ivilid_25 |   .0124229   .0753865     0.16   0.869    -.1363789    .1612247
         _Ivilid_26 |   .0873795    .114238     0.76   0.445    -.1381094    .3128684
         _Ivilid_27 |  -.1986934   .1000027    -1.99   0.049     -.396084   -.0013028
         _Ivilid_28 |   .0704438   .0824269     0.85   0.394    -.0922547    .2331424
         _Ivilid_29 |  -.3768161    .079414    -4.74   0.000    -.5335676   -.2200646
         _Ivilid_30 |  -.2713781   .0877751    -3.09   0.002    -.4446332    -.098123
         _Ivilid_31 |    .079448   .0216503     3.67   0.000     .0367134    .1221826
         _Ivilid_32 |   .2304637   .1126863     2.05   0.042     .0080376    .4528899
         _Ivilid_33 |   .0845458   .1326105     0.64   0.525    -.1772077    .3462993
         _Ivilid_34 |   -.264365   .2183171    -1.21   0.228    -.6952906    .1665607
         _Ivilid_35 |  -.1784256   .0148203   -12.04   0.000    -.2076788   -.1491725
         _Ivilid_36 |   -.185717   .0434438    -4.27   0.000    -.2714686   -.0999655
         _Ivilid_37 |  -.2812058   .0876131    -3.21   0.002    -.4541412   -.1082705
         _Ivilid_38 |   .0542065   .0277862     1.95   0.053    -.0006394    .1090524
         _Ivilid_39 |  -.4257215   .0306013   -13.91   0.000     -.486124    -.365319
         _Ivilid_40 |  -.1438472   .1082382    -1.33   0.186    -.3574934     .069799
         _Ivilid_41 |  -.0831759   .0231377    -3.59   0.000    -.1288463   -.0375054
         _Ivilid_42 |  -.3855601   .0369485   -10.44   0.000    -.4584909   -.3126294
         _Ivilid_43 |   -.166166   .0546469    -3.04   0.003     -.274031    -.058301
         _Ivilid_44 |  -.4836683   .0472747   -10.23   0.000    -.5769815    -.390355
         _Ivilid_45 |  -.0243233    .098387    -0.25   0.805    -.2185247    .1698782
         _Ivilid_46 |  -.3051374    .064385    -4.74   0.000    -.4322238   -.1780509
         _Ivilid_47 |  -.2843394   .1016203    -2.80   0.006    -.4849228    -.083756
              _cons |   .3570586   .0871084     4.10   0.000     .1851195    .5289977
-------------------------------------------------------------------------------------

. test intensive inter_intensive_exp

 ( 1)  intensive = 0
 ( 2)  inter_intensive_exp = 0

       F(  2,   172) =   15.32
            Prob > F =    0.0000

. outreg2 using `outputfile1'
TableA3.xls
dir : seeout

. reg takeup_survey intensive inter_intensive_risk risk_averse male age agpop ricearea_2010 literacy _Ivi
> lid* if delay == 0, cluster(address)

Linear regression                                      Number of obs =    2137
                                                       F( 50,   172) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1254
                                                       Root MSE      =  .46921

                                      (Std. Err. adjusted for 173 clusters in address)
--------------------------------------------------------------------------------------
                     |               Robust
       takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
           intensive |   .1308669   .0303061     4.32   0.000     .0710471    .1906868
inter_intensive_risk |    .048197    .070155     0.69   0.493    -.0902786    .1866726
         risk_averse |   -.021768   .0483363    -0.45   0.653    -.1171767    .0736407
                male |    .040878   .0474395     0.86   0.390    -.0527606    .1345166
                 age |    .001785    .001058     1.69   0.093    -.0003033    .0038732
               agpop |   -.003089   .0052036    -0.59   0.554    -.0133602    .0071821
       ricearea_2010 |   .0007857    .000754     1.04   0.299    -.0007026     .002274
            literacy |   .0836422   .0269633     3.10   0.002     .0304207    .1368637
           _Ivilid_2 |  -.4145949    .106718    -3.88   0.000    -.6252406   -.2039493
           _Ivilid_3 |  -.1933038   .0321582    -6.01   0.000    -.2567793   -.1298284
           _Ivilid_4 |  -.2452053   .0370455    -6.62   0.000    -.3183276   -.1720829
           _Ivilid_5 |  -.1668373   .1530659    -1.09   0.277    -.4689668    .1352921
           _Ivilid_6 |   .2342821   .0300929     7.79   0.000     .1748832    .2936809
           _Ivilid_7 |   -.260182   .0596918    -4.36   0.000    -.3780047   -.1423592
           _Ivilid_8 |  -.2334797   .0963776    -2.42   0.016    -.4237148   -.0432446
           _Ivilid_9 |   -.255177   .0957876    -2.66   0.008    -.4442476   -.0661064
          _Ivilid_10 |  -.2837514   .1173568    -2.42   0.017    -.5153964   -.0521064
          _Ivilid_11 |  -.1284165   .0821566    -1.56   0.120    -.2905814    .0337484
          _Ivilid_12 |    .022195   .1136482     0.20   0.845    -.2021298    .2465198
          _Ivilid_13 |   .0012985   .0832527     0.02   0.988      -.16303     .165627
          _Ivilid_14 |  -.1526796   .1064636    -1.43   0.153    -.3628229    .0574637
          _Ivilid_15 |   .1177303   .0691396     1.70   0.090     -.018741    .2542016
          _Ivilid_16 |  -.5006428    .014323   -34.95   0.000    -.5289142   -.4723713
          _Ivilid_17 |  -.4069829   .0676874    -6.01   0.000    -.5405879   -.2733779
          _Ivilid_18 |  -.0565111   .1464135    -0.39   0.700    -.3455098    .2324875
          _Ivilid_19 |  -.2926953   .0707314    -4.14   0.000    -.4323087    -.153082
          _Ivilid_20 |  -.1320283   .1223206    -1.08   0.282    -.3734711    .1094144
          _Ivilid_21 |  -.2451061   .0588311    -4.17   0.000    -.3612301   -.1289822
          _Ivilid_22 |  -.2848646   .1699676    -1.68   0.096    -.6203555    .0506263
          _Ivilid_23 |  -.2520551   .1062719    -2.37   0.019    -.4618201   -.0422901
          _Ivilid_24 |  -.1183698    .065652    -1.80   0.073    -.2479571    .0112176
          _Ivilid_25 |   .0251852   .0742234     0.34   0.735    -.1213208    .1716912
          _Ivilid_26 |   .0959508   .1132528     0.85   0.398    -.1275934     .319495
          _Ivilid_27 |  -.1903185   .0957209    -1.99   0.048    -.3792574   -.0013797
          _Ivilid_28 |   .0697788   .0839153     0.83   0.407    -.0958577    .2354152
          _Ivilid_29 |  -.3819315   .0821159    -4.65   0.000     -.544016   -.2198469
          _Ivilid_30 |  -.2724462   .0878759    -3.10   0.002    -.4459002   -.0989923
          _Ivilid_31 |   .0916489   .0204571     4.48   0.000     .0512697    .1320281
          _Ivilid_32 |   .2417287   .1113355     2.17   0.031     .0219688    .4614885
          _Ivilid_33 |    .093216   .1355574     0.69   0.493    -.1743542    .3607862
          _Ivilid_34 |  -.2625838   .2203914    -1.19   0.235    -.6976037    .1724362
          _Ivilid_35 |  -.1706294   .0158532   -10.76   0.000    -.2019212   -.1393375
          _Ivilid_36 |  -.1822766   .0440481    -4.14   0.000     -.269221   -.0953322
          _Ivilid_37 |  -.2834976   .0872374    -3.25   0.001    -.4556914   -.1113038
          _Ivilid_38 |    .061783   .0287699     2.15   0.033     .0049955    .1185706
          _Ivilid_39 |  -.4253013    .029585   -14.38   0.000    -.4836978   -.3669049
          _Ivilid_40 |  -.1489616   .1075296    -1.39   0.168    -.3612091    .0632859
          _Ivilid_41 |  -.0908835   .0251546    -3.61   0.000    -.1405351   -.0412319
          _Ivilid_42 |  -.3916204   .0375276   -10.44   0.000    -.4656944   -.3175465
          _Ivilid_43 |  -.1593396   .0520894    -3.06   0.003    -.2621564   -.0565227
          _Ivilid_44 |  -.4820108   .0495546    -9.73   0.000    -.5798243   -.3841973
          _Ivilid_45 |  -.0245082   .0971386    -0.25   0.801    -.2162454    .1672291
          _Ivilid_46 |  -.3069724   .0651136    -4.71   0.000    -.4354969   -.1784479
          _Ivilid_47 |  -.2873025    .101752    -2.82   0.005    -.4881459   -.0864592
               _cons |   .3667824   .0870733     4.21   0.000     .1949125    .5386522
--------------------------------------------------------------------------------------

. test intensive inter_intensive_risk

 ( 1)  intensive = 0
 ( 2)  inter_intensive_risk = 0

       F(  2,   172) =   15.01
            Prob > F =    0.0000

. outreg2 using `outputfile1'
TableA3.xls
dir : seeout

. reg takeup_survey intensive inter_intensive_day day male age agpop ricearea_2010 literacy _Ivilid* if d
> elay == 0, cluster(address)

Linear regression                                      Number of obs =    2137
                                                       F( 50,   172) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1274
                                                       Root MSE      =  .46867

                                     (Std. Err. adjusted for 173 clusters in address)
-------------------------------------------------------------------------------------
                    |               Robust
      takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          intensive |   .1960568    .057646     3.40   0.001     .0822721    .3098416
inter_intensive_day |  -.0027918   .0023436    -1.19   0.235    -.0074177    .0018341
                day |  -.0139064   .0111612    -1.25   0.214     -.035937    .0081242
               male |   .0355823   .0475437     0.75   0.455    -.0582619    .1294266
                age |   .0018364    .001061     1.73   0.085    -.0002578    .0039305
              agpop |    -.00329   .0051889    -0.63   0.527    -.0135321    .0069521
      ricearea_2010 |   .0008123   .0007739     1.05   0.295    -.0007152    .0023399
           literacy |   .0842239   .0267662     3.15   0.002     .0313913    .1370565
          _Ivilid_2 |  -.6675013   .2147038    -3.11   0.002    -1.091295   -.2437077
          _Ivilid_3 |  -.3609265   .1263957    -2.86   0.005    -.6104131     -.11144
          _Ivilid_4 |  -.5926824   .2567715    -2.31   0.022    -1.099511   -.0858534
          _Ivilid_5 |  -.1518918   .1522394    -1.00   0.320    -.4523899    .1486062
          _Ivilid_6 |    .295198   .0520723     5.67   0.000     .1924149    .3979811
          _Ivilid_7 |  -.1438379   .0980409    -1.47   0.144    -.3373562    .0496804
          _Ivilid_8 |  -.2812499   .0979928    -2.87   0.005    -.4746733   -.0878266
          _Ivilid_9 |  -.3287199   .1114428    -2.95   0.004    -.5486914   -.1087483
         _Ivilid_10 |    .006914   .2369532     0.03   0.977    -.4607966    .4746245
         _Ivilid_11 |  -.5091777   .2900389    -1.76   0.081    -1.081672    .0633163
         _Ivilid_12 |  -.4046711   .3339328    -1.21   0.227    -1.063805    .2544629
         _Ivilid_13 |  -.0811732   .1033786    -0.79   0.433    -.2852273     .122881
         _Ivilid_14 |  -.4096972   .2186097    -1.87   0.063    -.8412005     .021806
         _Ivilid_15 |  -.0355061   .1289692    -0.28   0.783    -.2900723    .2190601
         _Ivilid_16 |    -.51549   .0157237   -32.78   0.000    -.5465264   -.4844537
         _Ivilid_17 |  -.5902983   .1523977    -3.87   0.000    -.8911088   -.2894878
         _Ivilid_18 |   -.006259   .1320735    -0.05   0.962    -.2669526    .2544347
         _Ivilid_19 |  -.4140871   .1055201    -3.92   0.000    -.6223682   -.2058061
         _Ivilid_20 |  -.4520337   .2626803    -1.72   0.087    -.9705257    .0664583
         _Ivilid_21 |  -.4467304   .1537418    -2.91   0.004     -.750194   -.1432668
         _Ivilid_22 |  -.2203788   .1809736    -1.22   0.225    -.5775939    .1368362
         _Ivilid_23 |  -.6353559   .2970019    -2.14   0.034    -1.221594   -.0491181
         _Ivilid_24 |  -.2338178   .1044211    -2.24   0.026    -.4399296    -.027706
         _Ivilid_25 |  -.1136664   .1237002    -0.92   0.359    -.3578322    .1304995
         _Ivilid_26 |    .198758   .1317788     1.51   0.133    -.0613538    .4588699
         _Ivilid_27 |   -.297662   .1261444    -2.36   0.019    -.5466523   -.0486716
         _Ivilid_28 |  -.0510531   .1196616    -0.43   0.670    -.2872474    .1851413
         _Ivilid_29 |  -.6095527   .1839694    -3.31   0.001    -.9726811   -.2464243
         _Ivilid_30 |  -.6799939   .3107645    -2.19   0.030    -1.293397   -.0665907
         _Ivilid_31 |    .007281   .0662187     0.11   0.913     -.123425    .1379869
         _Ivilid_32 |   .5315253   .2256122     2.36   0.020     .0862002    .9768505
         _Ivilid_33 |  -.0785624   .1789212    -0.44   0.661    -.4317263    .2746016
         _Ivilid_34 |   -.237098   .2257644    -1.05   0.295    -.6827235    .2085276
         _Ivilid_35 |   .1127069   .1998872     0.56   0.574     -.281841    .5072547
         _Ivilid_36 |  -.5810176   .2908487    -2.00   0.047     -1.15511   -.0069253
         _Ivilid_37 |  -.5718707   .2274989    -2.51   0.013     -1.02092   -.1228216
         _Ivilid_38 |   .0908056   .0360795     2.52   0.013     .0195901    .1620211
         _Ivilid_39 |  -.7744335   .2568377    -3.02   0.003    -1.281393   -.2674739
         _Ivilid_40 |  -.2521779   .1272456    -1.98   0.049     -.503342   -.0010138
         _Ivilid_41 |  -.0921565   .0241005    -3.82   0.000    -.1397272   -.0445857
         _Ivilid_42 |  -.4964573   .0855612    -5.80   0.000    -.6653425   -.3275722
         _Ivilid_43 |  -.1892049   .0557122    -3.40   0.001    -.2991725   -.0792373
         _Ivilid_44 |  -.4370667   .0493147    -8.86   0.000    -.5344066   -.3397268
         _Ivilid_45 |   .0762798   .1288051     0.59   0.554    -.1779625     .330522
         _Ivilid_46 |  -.6627834   .2589636    -2.56   0.011    -1.173939   -.1516277
         _Ivilid_47 |  -.5284339   .2001188    -2.64   0.009    -.9234388    -.133429
              _cons |   .7946497   .3499352     2.27   0.024     .1039294     1.48537
-------------------------------------------------------------------------------------

. test intensive inter_intensive_day

 ( 1)  intensive = 0
 ( 2)  inter_intensive_day = 0

       F(  2,   172) =   15.02
            Prob > F =    0.0000

. outreg2 using `outputfile1'
TableA3.xls
dir : seeout

. 
. **********************************************************3. Social Network effect*********************
> ***************************************
. gen inter_network_educ = network_rate_preintensive*intensive
(314 missing values generated)

. gen inter_network_educ1 = network_onlyone*intensive
(314 missing values generated)

. gen inter_network_educ2 = network_onlytwo*intensive
(314 missing values generated)

. gen inter_network_educ3 = network_twomore*intensive
(314 missing values generated)

. gen inter_inten_delay = intensive*delay

. 
. *2.1. Network rate - all sample
. *table 2, columns 2-5
. **check robustness by adding spillover effect from simple session**
. reg takeup_survey network_rate_preintensive male age agpop ricearea_2010 literacy intensive risk_averse
>  disaster_prob friend* _Ivilid* if delay == 1 & info_none == 1, cluster(address)
note: friend1 omitted because of collinearity
note: friend2 omitted because of collinearity
note: _Ivilid_5 omitted because of collinearity
note: _Ivilid_23 omitted because of collinearity
note: _Ivilid_27 omitted because of collinearity

Linear regression                                      Number of obs =    1255
                                                       F( 51,   165) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1193
                                                       Root MSE      =   .4759

                                           (Std. Err. adjusted for 166 clusters in address)
-------------------------------------------------------------------------------------------
                          |               Robust
            takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
network_rate_preintensive |   .2911852   .0820022     3.55   0.001     .1292763    .4530942
                     male |   .0156732   .0737808     0.21   0.832    -.1300031    .1613494
                      age |   .0045023   .0012086     3.73   0.000     .0021161    .0068886
                    agpop |  -.0101567   .0068682    -1.48   0.141    -.0237175    .0034041
            ricearea_2010 |   .0043143    .001025     4.21   0.000     .0022904    .0063382
                 literacy |   .0874332    .032683     2.68   0.008     .0229025    .1519639
                intensive |   .0298357   .0332218     0.90   0.370     -.035759    .0954303
              risk_averse |   .1091701   .0489645     2.23   0.027     .0124924    .2058478
            disaster_prob |   .0019402   .0008009     2.42   0.017     .0003588    .0035216
                  friend1 |          0  (omitted)
                  friend2 |          0  (omitted)
                  friend3 |   .1210273   .2237249     0.54   0.589    -.3207053    .5627599
                  friend4 |   .1813803   .1294373     1.40   0.163    -.0741867    .4369473
                  friend5 |   .3201854   .0648817     4.93   0.000     .1920799    .4482908
                _Ivilid_2 |  -.4624467    .143032    -3.23   0.001    -.7448556   -.1800378
                _Ivilid_3 |  -.2993164   .0652264    -4.59   0.000    -.4281023   -.1705306
                _Ivilid_4 |  -.1577358   .0550264    -2.87   0.005    -.2663826   -.0490891
                _Ivilid_5 |          0  (omitted)
                _Ivilid_6 |   .0563637   .1465408     0.38   0.701    -.2329731    .3457006
                _Ivilid_7 |  -.1299139   .0731729    -1.78   0.078    -.2743899     .014562
                _Ivilid_8 |  -.0961288   .0790676    -1.22   0.226    -.2522435    .0599859
                _Ivilid_9 |  -.2133536   .1395284    -1.53   0.128    -.4888448    .0621376
               _Ivilid_10 |  -.1302201   .0835006    -1.56   0.121    -.2950876    .0346473
               _Ivilid_11 |  -.2074857   .0647209    -3.21   0.002    -.3352736   -.0796978
               _Ivilid_12 |  -.0153145   .1037764    -0.15   0.883    -.2202153    .1895864
               _Ivilid_13 |  -.0521824   .0644859    -0.81   0.420    -.1795062    .0751414
               _Ivilid_14 |  -.2995046   .0844105    -3.55   0.001    -.4661686   -.1328406
               _Ivilid_15 |   .1254477   .1080595     1.16   0.247    -.0879098    .3388053
               _Ivilid_16 |  -.0233146   .0225019    -1.04   0.302    -.0677433    .0211142
               _Ivilid_17 |  -.3063526   .0638903    -4.79   0.000    -.4325005   -.1802046
               _Ivilid_18 |  -.0602414   .1693432    -0.36   0.722    -.3946003    .2741175
               _Ivilid_19 |  -.3395754   .0796093    -4.27   0.000    -.4967596   -.1823912
               _Ivilid_20 |  -.0363957   .0904436    -0.40   0.688    -.2149717    .1421802
               _Ivilid_21 |   -.255359   .0780348    -3.27   0.001    -.4094345   -.1012835
               _Ivilid_22 |  -.1906716   .1137607    -1.68   0.096     -.415286    .0339427
               _Ivilid_23 |          0  (omitted)
               _Ivilid_24 |  -.1013682   .1376443    -0.74   0.463    -.3731394     .170403
               _Ivilid_25 |   .1128429   .1552555     0.73   0.468    -.1937006    .4193865
               _Ivilid_26 |  -.1311839   .0352068    -3.73   0.000    -.2006978     -.06167
               _Ivilid_27 |          0  (omitted)
               _Ivilid_28 |   -.040171   .0812866    -0.49   0.622    -.2006671     .120325
               _Ivilid_29 |  -.3268255   .0838619    -3.90   0.000    -.4924064   -.1612447
               _Ivilid_30 |  -.2284594   .1422666    -1.61   0.110    -.5093571    .0524383
               _Ivilid_31 |  -.1994708    .015103   -13.21   0.000    -.2292908   -.1696508
               _Ivilid_32 |    .069771   .0871249     0.80   0.424    -.1022523    .2417944
               _Ivilid_33 |  -.0325351    .042622    -0.76   0.446    -.1166899    .0516197
               _Ivilid_34 |  -.0451392   .2087275    -0.22   0.829    -.4572602    .3669818
               _Ivilid_35 |  -.3740458   .0186026   -20.11   0.000    -.4107756   -.3373159
               _Ivilid_36 |  -.3602062    .097654    -3.69   0.000    -.5530188   -.1673937
               _Ivilid_37 |  -.1770161   .0221741    -7.98   0.000    -.2207976   -.1332346
               _Ivilid_38 |  -.1280958   .1956103    -0.65   0.513    -.5143176     .258126
               _Ivilid_39 |  -.1381876   .1328476    -1.04   0.300    -.4004879    .1241127
               _Ivilid_40 |  -.2851302   .1514275    -1.88   0.061    -.5841155    .0138551
               _Ivilid_41 |  -.1748761   .0961413    -1.82   0.071     -.364702    .0149497
               _Ivilid_42 |  -.2852972   .0442582    -6.45   0.000    -.3726826   -.1979117
               _Ivilid_43 |    .422464    .028734    14.70   0.000     .3657303    .4791977
               _Ivilid_44 |  -.1111072   .1141388    -0.97   0.332     -.336468    .1142537
               _Ivilid_45 |   .0768297   .0891676     0.86   0.390     -.099227    .2528863
               _Ivilid_46 |  -.2941174   .0341094    -8.62   0.000    -.3614646   -.2267703
               _Ivilid_47 |  -.2635088   .0685471    -3.84   0.000    -.3988513   -.1281663
                    _cons |  -.1674247   .1031443    -1.62   0.106    -.3710774    .0362281
-------------------------------------------------------------------------------------------

. outreg2 using `outputfile0'
Table2.xls
dir : seeout

. reg takeup_survey network_rate_preintensive network_rate_presimple intensive friend* _Ivilid* if delay 
> == 1 & info_none == 1, cluster(address)
note: friend1 omitted because of collinearity
note: friend2 omitted because of collinearity
note: _Ivilid_5 omitted because of collinearity
note: _Ivilid_23 omitted because of collinearity
note: _Ivilid_32 omitted because of collinearity

Linear regression                                      Number of obs =    1274
                                                       F( 45,   165) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0913
                                                       Root MSE      =  .48223

                                           (Std. Err. adjusted for 166 clusters in address)
-------------------------------------------------------------------------------------------
                          |               Robust
            takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
network_rate_preintensive |   .2780891   .0844643     3.29   0.001      .111319    .4448592
   network_rate_presimple |  -.1079451     .09329    -1.16   0.249    -.2921412     .076251
                intensive |   .0256236   .0330547     0.78   0.439    -.0396411    .0908882
                  friend1 |          0  (omitted)
                  friend2 |          0  (omitted)
                  friend3 |    .265184   .2325179     1.14   0.256    -.1939099    .7242779
                  friend4 |   .3323756   .1182045     2.81   0.006     .0989872     .565764
                  friend5 |   .4575957   .0453227    10.10   0.000     .3681084    .5470829
                _Ivilid_2 |  -.5170619   .1452846    -3.56   0.000    -.8039184   -.2302054
                _Ivilid_3 |  -.3347716   .0928574    -3.61   0.000    -.5181134   -.1514298
                _Ivilid_4 |  -.2915162   .0883575    -3.30   0.001    -.4659732   -.1170592
                _Ivilid_5 |          0  (omitted)
                _Ivilid_6 |  -.0697833   .1989348    -0.35   0.726    -.4625692    .3230026
                _Ivilid_7 |  -.2379635   .0898406    -2.65   0.009    -.4153489    -.060578
                _Ivilid_8 |  -.1417428   .0995431    -1.42   0.156    -.3382854    .0547997
                _Ivilid_9 |  -.3354236   .1477278    -2.27   0.024    -.6271041   -.0437432
               _Ivilid_10 |  -.0788618   .0689277    -1.14   0.254    -.2149557    .0572322
               _Ivilid_11 |  -.3090739   .0842816    -3.67   0.000    -.4754832   -.1426645
               _Ivilid_12 |  -.1166139   .1208105    -0.97   0.336    -.3551477    .1219198
               _Ivilid_13 |  -.1217668   .1071588    -1.14   0.257     -.333346    .0898124
               _Ivilid_14 |  -.3541568   .1054506    -3.36   0.001    -.5623632   -.1459504
               _Ivilid_15 |   .0422508    .123248     0.34   0.732    -.2010956    .2855972
               _Ivilid_16 |  -.0596282   .0601764    -0.99   0.323    -.1784432    .0591869
               _Ivilid_17 |  -.3722175   .0891721    -4.17   0.000    -.5482829   -.1961521
               _Ivilid_18 |   -.109569   .1714964    -0.64   0.524    -.4481794    .2290413
               _Ivilid_19 |  -.3717859   .0944744    -3.94   0.000    -.5583204   -.1852513
               _Ivilid_20 |  -.1243429   .1065748    -1.17   0.245     -.334769    .0860832
               _Ivilid_21 |  -.3202348   .0933012    -3.43   0.001     -.504453   -.1360165
               _Ivilid_22 |  -.2714403   .1374244    -1.98   0.050    -.5427773   -.0001032
               _Ivilid_23 |          0  (omitted)
               _Ivilid_24 |  -.1778438   .1517523    -1.17   0.243    -.4774703    .1217828
               _Ivilid_25 |   .0628728   .1646032     0.38   0.703    -.2621273    .3878729
               _Ivilid_26 |  -.2454443   .0735551    -3.34   0.001    -.3906749   -.1002136
               _Ivilid_27 |  -.0442324   .0590468    -0.75   0.455    -.1608172    .0723524
               _Ivilid_28 |  -.1500101   .1067349    -1.41   0.162    -.3607523    .0607322
               _Ivilid_29 |  -.3718116   .1108892    -3.35   0.001    -.5907564   -.1528669
               _Ivilid_30 |  -.3566179   .1611685    -2.21   0.028    -.6748363   -.0383995
               _Ivilid_31 |  -.3142907   .0594733    -5.28   0.000    -.4317174    -.196864
               _Ivilid_32 |          0  (omitted)
               _Ivilid_33 |  -.0894852   .0641825    -1.39   0.165    -.2162101    .0372396
               _Ivilid_34 |  -.1502263   .2063923    -0.73   0.468    -.5577366     .257284
               _Ivilid_35 |  -.4050362   .0659627    -6.14   0.000    -.5352761   -.2747964
               _Ivilid_36 |  -.4462711   .1195196    -3.73   0.000    -.6822561   -.2102861
               _Ivilid_37 |  -.2614215   .0632067    -4.14   0.000    -.3862196   -.1366233
               _Ivilid_38 |  -.1747955   .2139511    -0.82   0.415    -.5972303    .2476393
               _Ivilid_39 |  -.2172706   .1838694    -1.18   0.239    -.5803108    .1457695
               _Ivilid_40 |  -.3544703    .167627    -2.11   0.036    -.6854408   -.0234999
               _Ivilid_41 |  -.2346066   .0915869    -2.56   0.011    -.4154399   -.0537733
               _Ivilid_42 |  -.3600809   .0692713    -5.20   0.000    -.4968532   -.2233085
               _Ivilid_43 |   .3449623    .061654     5.60   0.000     .2232298    .4666947
               _Ivilid_44 |  -.2069951    .111044    -1.86   0.064    -.4262455    .0122553
               _Ivilid_45 |   .0021027   .1169405     0.02   0.986    -.2287899    .2329953
               _Ivilid_46 |  -.3703334   .0708309    -5.23   0.000    -.5101851   -.2304816
               _Ivilid_47 |    -.33559   .0922789    -3.64   0.000    -.5177896   -.1533903
                    _cons |   .1913978   .0871349     2.20   0.029     .0193546    .3634409
-------------------------------------------------------------------------------------------

. outreg2 using `outputfile0'
Table2.xls
dir : seeout

. reg takeup_survey network_rate_preintensive intensive inter_network_educ male age agpop ricearea_2010 l
> iteracy risk_averse disaster_prob friend* _Ivilid* if delay == 1 & info_none == 1, cluster(address)
note: friend1 omitted because of collinearity
note: friend2 omitted because of collinearity
note: _Ivilid_5 omitted because of collinearity
note: _Ivilid_23 omitted because of collinearity
note: _Ivilid_27 omitted because of collinearity

Linear regression                                      Number of obs =    1255
                                                       F( 52,   165) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1226
                                                       Root MSE      =   .4752

                                           (Std. Err. adjusted for 166 clusters in address)
-------------------------------------------------------------------------------------------
                          |               Robust
            takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
network_rate_preintensive |   .4444749   .1089443     4.08   0.000     .2293703    .6595796
                intensive |   .0809232   .0397319     2.04   0.043     .0024747    .1593716
       inter_network_educ |   -.328592    .160919    -2.04   0.043    -.6463178   -.0108663
                     male |   .0186269   .0740731     0.25   0.802    -.1276265    .1648802
                      age |   .0045921   .0012054     3.81   0.000     .0022121     .006972
                    agpop |  -.0102751    .006836    -1.50   0.135    -.0237724    .0032222
            ricearea_2010 |   .0043351   .0010269     4.22   0.000     .0023074    .0063627
                 literacy |   .0871877   .0326466     2.67   0.008     .0227287    .1516467
              risk_averse |   .1047806   .0488233     2.15   0.033     .0083818    .2011795
            disaster_prob |   .0019153   .0008007     2.39   0.018     .0003343    .0034963
                  friend1 |          0  (omitted)
                  friend2 |          0  (omitted)
                  friend3 |   .1221102   .2394622     0.51   0.611    -.3506948    .5949153
                  friend4 |   .1775006   .1472125     1.21   0.230    -.1131626    .4681637
                  friend5 |   .3147423   .0937711     3.36   0.001     .1295964    .4998883
                _Ivilid_2 |  -.4475949   .1448785    -3.09   0.002    -.7336496   -.1615401
                _Ivilid_3 |  -.2845492   .0647171    -4.40   0.000    -.4123297   -.1567687
                _Ivilid_4 |  -.1345709   .0560517    -2.40   0.017    -.2452419   -.0238998
                _Ivilid_5 |          0  (omitted)
                _Ivilid_6 |   .0817074   .1546839     0.53   0.598    -.2237075    .3871224
                _Ivilid_7 |   -.109223   .0729305    -1.50   0.136    -.2532203    .0347744
                _Ivilid_8 |  -.0828196   .0813464    -1.02   0.310    -.2434336    .0777944
                _Ivilid_9 |  -.2064473   .1359317    -1.52   0.131    -.4748371    .0619426
               _Ivilid_10 |  -.1079498   .0845951    -1.28   0.204    -.2749783    .0590787
               _Ivilid_11 |  -.1910258   .0654892    -2.92   0.004    -.3203307   -.0617209
               _Ivilid_12 |   .0007518    .103284     0.01   0.994    -.2031768    .2046804
               _Ivilid_13 |  -.0390839   .0651383    -0.60   0.549    -.1676959    .0895281
               _Ivilid_14 |   -.280998   .0862847    -3.26   0.001    -.4513624   -.1106336
               _Ivilid_15 |   .1448569   .0989728     1.46   0.145    -.0505595    .3402733
               _Ivilid_16 |   -.005519   .0237874    -0.23   0.817     -.052486     .041448
               _Ivilid_17 |  -.2846395   .0637101    -4.47   0.000    -.4104317   -.1588473
               _Ivilid_18 |  -.0299112   .1767254    -0.17   0.866    -.3788459    .3190235
               _Ivilid_19 |  -.3189339   .0773467    -4.12   0.000    -.4716508    -.166217
               _Ivilid_20 |  -.0210646   .0908662    -0.23   0.817     -.200475    .1583457
               _Ivilid_21 |  -.2404617   .0762463    -3.15   0.002    -.3910059   -.0899176
               _Ivilid_22 |  -.1672806   .1105887    -1.51   0.132    -.3856319    .0510708
               _Ivilid_23 |          0  (omitted)
               _Ivilid_24 |  -.0810271    .134225    -0.60   0.547     -.346047    .1839928
               _Ivilid_25 |   .1302694   .1539617     0.85   0.399    -.1737197    .4342585
               _Ivilid_26 |  -.1137612   .0380654    -2.99   0.003    -.1889193   -.0386031
               _Ivilid_27 |          0  (omitted)
               _Ivilid_28 |  -.0184491   .0777992    -0.24   0.813    -.1720594    .1351613
               _Ivilid_29 |  -.3079594   .0858579    -3.59   0.000    -.4774813   -.1384376
               _Ivilid_30 |  -.2117678   .1411173    -1.50   0.135    -.4903962    .0668606
               _Ivilid_31 |  -.1856843   .0159698   -11.63   0.000    -.2172158   -.1541528
               _Ivilid_32 |   .0842695   .0909274     0.93   0.355    -.0952617    .2638008
               _Ivilid_33 |  -.0039789   .0366365    -0.11   0.914    -.0763157    .0683578
               _Ivilid_34 |  -.0392469   .2148119    -0.18   0.855    -.4633812    .3848874
               _Ivilid_35 |  -.3540522   .0208347   -16.99   0.000    -.3951892   -.3129153
               _Ivilid_36 |   -.334712   .0974004    -3.44   0.001    -.5270239   -.1424001
               _Ivilid_37 |  -.1569619   .0238918    -6.57   0.000    -.2041349   -.1097889
               _Ivilid_38 |  -.1004503    .195002    -0.52   0.607    -.4854711    .2845704
               _Ivilid_39 |  -.1165906   .1236872    -0.94   0.347    -.3608043    .1276232
               _Ivilid_40 |  -.2701749   .1470304    -1.84   0.068    -.5604785    .0201286
               _Ivilid_41 |  -.1468868   .0942757    -1.56   0.121     -.333029    .0392555
               _Ivilid_42 |  -.2737173   .0424413    -6.45   0.000    -.3575153   -.1899193
               _Ivilid_43 |   .4307949   .0324247    13.29   0.000     .3667742    .4948156
               _Ivilid_44 |  -.0967959   .1151307    -0.84   0.402    -.3241152    .1305234
               _Ivilid_45 |   .0952797   .0915862     1.04   0.300    -.0855522    .2761116
               _Ivilid_46 |  -.2776361   .0364792    -7.61   0.000    -.3496622   -.2056099
               _Ivilid_47 |  -.2499718   .0650632    -3.84   0.000    -.3784357    -.121508
                    _cons |  -.2093469   .1181326    -1.77   0.078    -.4425934    .0238996
-------------------------------------------------------------------------------------------

. outreg2 using `outputfile0'
Table2.xls
dir : seeout

. test network_rate_preintensive inter_network_educ

 ( 1)  network_rate_preintensive = 0
 ( 2)  inter_network_educ = 0

       F(  2,   165) =    8.68
            Prob > F =    0.0003

. test intensive inter_network_educ

 ( 1)  intensive = 0
 ( 2)  inter_network_educ = 0

       F(  2,   165) =    2.68
            Prob > F =    0.0718

. reg takeup_survey network_onlyone network_onlytwo network_twomore intensive inter_network_educ1 inter_n
> etwork_educ2 inter_network_educ3 male age agpop ricearea_2010 literacy risk_averse disaster_prob friend
> * _Ivilid* if delay == 1 & info_none == 1, cluster(address)
note: friend1 omitted because of collinearity
note: friend2 omitted because of collinearity
note: _Ivilid_5 omitted because of collinearity
note: _Ivilid_23 omitted because of collinearity
note: _Ivilid_27 omitted because of collinearity

Linear regression                                      Number of obs =    1255
                                                       F( 56,   165) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1287
                                                       Root MSE      =  .47433

                                     (Std. Err. adjusted for 166 clusters in address)
-------------------------------------------------------------------------------------
                    |               Robust
      takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
    network_onlyone |   .0969821   .0424851     2.28   0.024     .0130976    .1808666
    network_onlytwo |    .177096   .1114581     1.59   0.114    -.0429719    .3971638
    network_twomore |   .1369322   .0916141     1.49   0.137     -.043955    .3178193
          intensive |   .0935944   .0419079     2.23   0.027     .0108495    .1763394
inter_network_educ1 |  -.0869055   .0551442    -1.58   0.117    -.1957847    .0219737
inter_network_educ2 |  -.0907766    .192624    -0.47   0.638    -.4711022    .2895489
inter_network_educ3 |  -.1405079   .1738363    -0.81   0.420    -.4837383    .2027225
               male |   .0292083   .0729577     0.40   0.689    -.1148428    .1732594
                age |   .0046181   .0012251     3.77   0.000     .0021992     .007037
              agpop |  -.0083813   .0068516    -1.22   0.223    -.0219094    .0051468
      ricearea_2010 |   .0044333   .0010307     4.30   0.000     .0023982    .0064684
           literacy |   .0901466   .0327411     2.75   0.007     .0255011    .1547921
        risk_averse |   .1037422   .0493319     2.10   0.037     .0063391    .2011453
      disaster_prob |   .0016982    .000812     2.09   0.038     .0000951    .0033014
            friend1 |          0  (omitted)
            friend2 |          0  (omitted)
            friend3 |   .0639547   .2357249     0.27   0.786    -.4014713    .5293807
            friend4 |   .0958195   .1307932     0.73   0.465    -.1624247    .3540636
            friend5 |   .2193946   .0711592     3.08   0.002     .0788946    .3598946
          _Ivilid_2 |  -.4108686   .1346199    -3.05   0.003    -.6766682    -.145069
          _Ivilid_3 |   -.249323   .0651857    -3.82   0.000    -.3780287   -.1206174
          _Ivilid_4 |  -.1011312   .0649444    -1.56   0.121    -.2293603    .0270979
          _Ivilid_5 |          0  (omitted)
          _Ivilid_6 |   .1297553   .1533846     0.85   0.399    -.1730943    .4326048
          _Ivilid_7 |  -.0662337   .0716677    -0.92   0.357    -.2077377    .0752703
          _Ivilid_8 |  -.0156161     .08446    -0.18   0.854    -.1823777    .1511456
          _Ivilid_9 |   -.142434   .1395221    -1.02   0.309    -.4179128    .1330447
         _Ivilid_10 |  -.0551596   .1036052    -0.53   0.595    -.2597225    .1494033
         _Ivilid_11 |  -.1314217    .069607    -1.89   0.061    -.2688569    .0060135
         _Ivilid_12 |   .0457866   .1092103     0.42   0.676    -.1698432    .2614165
         _Ivilid_13 |  -.0082238   .0661459    -0.12   0.901    -.1388254    .1223778
         _Ivilid_14 |  -.2363806   .0897347    -2.63   0.009    -.4135569   -.0592042
         _Ivilid_15 |   .2091902   .1147166     1.82   0.070    -.0173115    .4356919
         _Ivilid_16 |   .0398187   .0343252     1.16   0.248    -.0279545    .1075919
         _Ivilid_17 |  -.2410564    .064022    -3.77   0.000    -.3674642   -.1146485
         _Ivilid_18 |    .020932   .1722306     0.12   0.903     -.319128    .3609919
         _Ivilid_19 |  -.2824804   .0794384    -3.56   0.000    -.4393272   -.1256336
         _Ivilid_20 |   .0189951    .092965     0.20   0.838    -.1645592    .2025494
         _Ivilid_21 |  -.2070614   .0691073    -3.00   0.003      -.34351   -.0706129
         _Ivilid_22 |  -.1179937   .1127395    -1.05   0.297    -.3405917    .1046042
         _Ivilid_23 |          0  (omitted)
         _Ivilid_24 |  -.0175169    .140589    -0.12   0.901    -.2951021    .2600683
         _Ivilid_25 |   .1864604   .1541932     1.21   0.228    -.1179857    .4909066
         _Ivilid_26 |  -.0936103   .0415035    -2.26   0.025    -.1755567    -.011664
         _Ivilid_27 |          0  (omitted)
         _Ivilid_28 |   .0321785   .0840412     0.38   0.702    -.1337563    .1981132
         _Ivilid_29 |  -.2705404   .0925504    -2.92   0.004     -.453276   -.0878047
         _Ivilid_30 |  -.1601366   .1426763    -1.12   0.263    -.4418432      .12157
         _Ivilid_31 |  -.1472723   .0227059    -6.49   0.000    -.1921039   -.1024407
         _Ivilid_32 |   .1544013   .0891602     1.73   0.085    -.0216406    .3304432
         _Ivilid_33 |   .0479637   .0417186     1.15   0.252    -.0344073    .1303348
         _Ivilid_34 |  -.0133661   .2248879    -0.06   0.953     -.457395    .4306628
         _Ivilid_35 |  -.3009263   .0338579    -8.89   0.000    -.3677769   -.2340758
         _Ivilid_36 |  -.3023035   .1019418    -2.97   0.003    -.5035821   -.1010249
         _Ivilid_37 |  -.1113482   .0315537    -3.53   0.001    -.1736492   -.0490472
         _Ivilid_38 |  -.0360357   .1839279    -0.20   0.845    -.3991913      .32712
         _Ivilid_39 |  -.0664515   .1243406    -0.53   0.594    -.3119553    .1790523
         _Ivilid_40 |  -.2249663   .1540153    -1.46   0.146    -.5290612    .0791286
         _Ivilid_41 |  -.1045148   .0896633    -1.17   0.245    -.2815501    .0725204
         _Ivilid_42 |  -.2134265   .0510639    -4.18   0.000    -.3142494   -.1126036
         _Ivilid_43 |   .4815171   .0376199    12.80   0.000     .4072388    .5557955
         _Ivilid_44 |  -.0526524   .1112004    -0.47   0.636    -.2722114    .1669067
         _Ivilid_45 |    .143208   .0971813     1.47   0.142    -.0486713    .3350873
         _Ivilid_46 |  -.2356783    .040023    -5.89   0.000    -.3147015    -.156655
         _Ivilid_47 |  -.2101928   .0685947    -3.06   0.003    -.3456293   -.0747563
              _cons |  -.1881967   .1018169    -1.85   0.066    -.3892286    .0128353
-------------------------------------------------------------------------------------

. outreg2 using `outputfile0'
Table2.xls
dir : seeout

. 
. gen nofriend = 1

. replace nofriend = 0 if delay == 1 & info_none == 1 & network_yes == 1
(683 real changes made)

. *2.2. test spillover effect from non-friends
. *table2, column 6
. reg takeup_survey intensive delay inter_inten_delay male age agpop ricearea_2010 literacy risk_averse d
> isaster_prob _Ivilid* if delay == 0 | (delay == 1 & info_none == 1 & nofriend == 1), cluster(address)

Linear regression                                      Number of obs =    2756
                                                       F( 52,   172) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1072
                                                       Root MSE      =  .47299

                                   (Std. Err. adjusted for 173 clusters in address)
-----------------------------------------------------------------------------------
                  |               Robust
    takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
        intensive |   .1403269   .0259038     5.42   0.000     .0891966    .1914572
            delay |   .0317972   .0362454     0.88   0.382    -.0397458    .1033403
inter_inten_delay |  -.0525256   .0467534    -1.12   0.263    -.1448099    .0397587
             male |   .0480664   .0416527     1.15   0.250    -.0341499    .1302828
              age |   .0023435   .0009131     2.57   0.011     .0005411    .0041459
            agpop |  -.0044836   .0048757    -0.92   0.359    -.0141075    .0051403
    ricearea_2010 |   .0011529   .0007719     1.49   0.137    -.0003707    .0026765
         literacy |   .0625757   .0225257     2.78   0.006     .0181132    .1070382
      risk_averse |   .0720106   .0306167     2.35   0.020     .0115777    .1324435
    disaster_prob |   .0001667   .0005875     0.28   0.777    -.0009929    .0013263
        _Ivilid_2 |  -.4191927   .1197146    -3.50   0.001    -.6554917   -.1828937
        _Ivilid_3 |  -.2272989   .0590425    -3.85   0.000    -.3438401   -.1107577
        _Ivilid_4 |  -.2730082   .0596259    -4.58   0.000     -.390701   -.1553155
        _Ivilid_5 |  -.1679513   .1496356    -1.12   0.263    -.4633099    .1274072
        _Ivilid_6 |   .1714305   .0378353     4.53   0.000     .0967491    .2461118
        _Ivilid_7 |  -.2783659   .0425506    -6.54   0.000    -.3623544   -.1943774
        _Ivilid_8 |  -.1923783   .1031435    -1.87   0.064    -.3959684    .0112118
        _Ivilid_9 |  -.2407098   .1055517    -2.28   0.024    -.4490533   -.0323663
       _Ivilid_10 |  -.1514583   .0993653    -1.52   0.129    -.3475908    .0446742
       _Ivilid_11 |  -.1688292   .0512959    -3.29   0.001    -.2700798   -.0675786
       _Ivilid_12 |  -.0011707   .0957109    -0.01   0.990      -.19009    .1877486
       _Ivilid_13 |      -.006   .0791854    -0.08   0.940    -.1623002    .1503002
       _Ivilid_14 |  -.2220805   .0819122    -2.71   0.007    -.3837631   -.0603979
       _Ivilid_15 |   .1058526   .0823051     1.29   0.200    -.0566054    .2683106
       _Ivilid_16 |  -.4257579   .0153719   -27.70   0.000    -.4560998    -.395416
       _Ivilid_17 |  -.3942722   .0640323    -6.16   0.000    -.5206624   -.2678819
       _Ivilid_18 |  -.0939815   .0734668    -1.28   0.203    -.2389941     .051031
       _Ivilid_19 |  -.3046031   .0617228    -4.94   0.000    -.4264347   -.1827714
       _Ivilid_20 |  -.1372601    .104844    -1.31   0.192    -.3442066    .0696865
       _Ivilid_21 |  -.2844593   .0443675    -6.41   0.000    -.3720341   -.1968844
       _Ivilid_22 |  -.2846745    .132013    -2.16   0.032    -.5452487   -.0241003
       _Ivilid_23 |  -.2716647   .1098468    -2.47   0.014    -.4884859   -.0548434
       _Ivilid_24 |  -.1284568   .1031228    -1.25   0.215     -.332006    .0750924
       _Ivilid_25 |   .0360313   .0490816     0.73   0.464    -.0608484     .132911
       _Ivilid_26 |   .0205876   .0997737     0.21   0.837     -.176351    .2175261
       _Ivilid_27 |   -.155377   .0637348    -2.44   0.016    -.2811801    -.029574
       _Ivilid_28 |   .0218129   .0717003     0.30   0.761    -.1197129    .1633387
       _Ivilid_29 |  -.3652692   .0644646    -5.67   0.000    -.4925127   -.2380257
       _Ivilid_30 |  -.2935357   .0738758    -3.97   0.000    -.4393556   -.1477158
       _Ivilid_31 |  -.0002777   .0198891    -0.01   0.989    -.0395358    .0389803
       _Ivilid_32 |   .2026638   .0874193     2.32   0.022      .030111    .3752166
       _Ivilid_33 |   .0849835   .1172704     0.72   0.470    -.1464909     .316458
       _Ivilid_34 |  -.3094035   .1354611    -2.28   0.024    -.5767837   -.0420232
       _Ivilid_35 |  -.2197439   .0127285   -17.26   0.000    -.2448681   -.1946197
       _Ivilid_36 |  -.2082179   .0234607    -8.88   0.000    -.2545259   -.1619099
       _Ivilid_37 |  -.2721439   .0824854    -3.30   0.001    -.4349579   -.1093299
       _Ivilid_38 |   .0132964   .0385656     0.34   0.731    -.0628264    .0894191
       _Ivilid_39 |  -.4139016    .027058   -15.30   0.000      -.46731   -.3604932
       _Ivilid_40 |  -.1610064     .07723    -2.08   0.039    -.3134471   -.0085657
       _Ivilid_41 |   -.096842   .0440867    -2.20   0.029    -.1838626   -.0098214
       _Ivilid_42 |  -.3705229    .047119    -7.86   0.000    -.4635287    -.277517
       _Ivilid_43 |   .0125913   .0595598     0.21   0.833     -.104971    .1301536
       _Ivilid_44 |  -.4004385   .0351585   -11.39   0.000    -.4698362   -.3310408
       _Ivilid_45 |   .0087315   .0844402     0.10   0.918    -.1579409    .1754039
       _Ivilid_46 |  -.3363034   .0581305    -5.79   0.000    -.4510444   -.2215624
       _Ivilid_47 |  -.3108602   .0614448    -5.06   0.000    -.4321431   -.1895773
            _cons |   .3325853    .079483     4.18   0.000     .1756975     .489473
-----------------------------------------------------------------------------------

. outreg2 using `outputfile0'
Table2.xls
dir : seeout

. test intensive inter_inten_delay

 ( 1)  intensive = 0
 ( 2)  inter_inten_delay = 0

       F(  2,   172) =   16.69
            Prob > F =    0.0000

. 
. *2.3. Alternative measures and nonlinear effect
. *table 3
. local outputfile2 Table3.xls

. reg takeup_survey network_twoside male age agpop ricearea_2010 literacy intensive risk_averse disaster_
> prob friend* _Ivilid* if delay == 1 & info_none == 1, cluster(address)
note: friend1 omitted because of collinearity
note: friend2 omitted because of collinearity
note: _Ivilid_5 omitted because of collinearity
note: _Ivilid_23 omitted because of collinearity
note: _Ivilid_27 omitted because of collinearity

Linear regression                                      Number of obs =    1255
                                                       F( 51,   165) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1127
                                                       Root MSE      =  .47766

                                 (Std. Err. adjusted for 166 clusters in address)
---------------------------------------------------------------------------------
                |               Robust
  takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
network_twoside |   .4003157   .1727367     2.32   0.022     .0592565    .7413749
           male |   .0158313   .0729849     0.22   0.829    -.1282735     .159936
            age |   .0045619   .0012537     3.64   0.000     .0020866    .0070372
          agpop |   -.009707   .0070101    -1.38   0.168    -.0235481    .0041341
  ricearea_2010 |   .0041592    .001002     4.15   0.000     .0021808    .0061375
       literacy |   .0803797   .0330053     2.44   0.016     .0152125     .145547
      intensive |   .0245081   .0331752     0.74   0.461    -.0409945    .0900106
    risk_averse |   .1105594   .0486692     2.27   0.024     .0144648     .206654
  disaster_prob |   .0019885   .0008106     2.45   0.015      .000388    .0035891
        friend1 |          0  (omitted)
        friend2 |          0  (omitted)
        friend3 |   .1193774   .2587278     0.46   0.645    -.3914666    .6302213
        friend4 |   .1648759   .1706251     0.97   0.335    -.1720142    .5017659
        friend5 |   .3037102    .126707     2.40   0.018     .0535342    .5538862
      _Ivilid_2 |  -.4976289   .1440066    -3.46   0.001    -.7819621   -.2132958
      _Ivilid_3 |  -.3315304   .0615265    -5.39   0.000     -.453011   -.2100497
      _Ivilid_4 |   -.178892   .0466062    -3.84   0.000    -.2709134   -.0868706
      _Ivilid_5 |          0  (omitted)
      _Ivilid_6 |   .0150661   .1501091     0.10   0.920    -.2813161    .3114483
      _Ivilid_7 |  -.1457189   .0785378    -1.86   0.065    -.3007875    .0093498
      _Ivilid_8 |  -.1082253   .0718947    -1.51   0.134    -.2501774    .0337268
      _Ivilid_9 |  -.2373499   .1392499    -1.70   0.090    -.5122911    .0375914
     _Ivilid_10 |  -.1579952   .0814824    -1.94   0.054    -.3188778    .0028875
     _Ivilid_11 |   -.240614   .0649514    -3.70   0.000     -.368857   -.1123709
     _Ivilid_12 |  -.0314251   .1054307    -0.30   0.766    -.2395922     .176742
     _Ivilid_13 |  -.0720337   .0578581    -1.25   0.215    -.1862713     .042204
     _Ivilid_14 |  -.3348289   .0854975    -3.92   0.000    -.5036391   -.1660188
     _Ivilid_15 |   .0908461   .1000972     0.91   0.365    -.1067904    .2884826
     _Ivilid_16 |  -.0416201   .0232938    -1.79   0.076    -.0876123    .0043722
     _Ivilid_17 |  -.3296272   .0655763    -5.03   0.000     -.459104   -.2001504
     _Ivilid_18 |  -.0810466   .1800461    -0.45   0.653    -.4365378    .2744445
     _Ivilid_19 |  -.3682119   .0808112    -4.56   0.000    -.5277693   -.2086545
     _Ivilid_20 |  -.0640997   .0910647    -0.70   0.482    -.2439019    .1157025
     _Ivilid_21 |  -.2856804   .0845844    -3.38   0.001    -.4526877   -.1186731
     _Ivilid_22 |  -.2265559   .1164826    -1.94   0.053    -.4565445    .0034327
     _Ivilid_23 |          0  (omitted)
     _Ivilid_24 |  -.1280379   .1437748    -0.89   0.374    -.4119133    .1558375
     _Ivilid_25 |   .0650725   .1488589     0.44   0.663    -.2288413    .3589864
     _Ivilid_26 |  -.1627075   .0389302    -4.18   0.000    -.2395731   -.0858419
     _Ivilid_27 |          0  (omitted)
     _Ivilid_28 |  -.0777145    .077314    -1.01   0.316    -.2303668    .0749377
     _Ivilid_29 |  -.3372872   .0821768    -4.10   0.000    -.4995408   -.1750336
     _Ivilid_30 |  -.2747585   .1401985    -1.96   0.052    -.5515728    .0020557
     _Ivilid_31 |  -.2336297   .0171133   -13.65   0.000    -.2674191   -.1998403
     _Ivilid_32 |   .0269182    .082333     0.33   0.744    -.1356438    .1894802
     _Ivilid_33 |   -.043235   .0398549    -1.08   0.280    -.1219263    .0354564
     _Ivilid_34 |  -.0985171   .2227703    -0.44   0.659    -.5383649    .3413307
     _Ivilid_35 |    -.40234   .0163905   -24.55   0.000     -.434702   -.3699779
     _Ivilid_36 |  -.3865928   .0957609    -4.04   0.000    -.5756675    -.197518
     _Ivilid_37 |  -.2292572   .0227109   -10.09   0.000    -.2740986   -.1844159
     _Ivilid_38 |  -.1395057   .1799725    -0.78   0.439    -.4948516    .2158402
     _Ivilid_39 |  -.1869006    .124686    -1.50   0.136    -.4330864    .0592852
     _Ivilid_40 |  -.3106374   .1513631    -2.05   0.042    -.6094956   -.0117791
     _Ivilid_41 |  -.1750046   .0967511    -1.81   0.072    -.3660344    .0160252
     _Ivilid_42 |  -.3172604   .0497409    -6.38   0.000    -.4154712   -.2190497
     _Ivilid_43 |   .3681089   .0278621    13.21   0.000     .3130967    .4231211
     _Ivilid_44 |  -.1407155   .1247103    -1.13   0.261    -.3869493    .1055183
     _Ivilid_45 |   .0503368   .0882251     0.57   0.569    -.1238589    .2245325
     _Ivilid_46 |  -.3292605   .0352275    -9.35   0.000    -.3988153   -.2597056
     _Ivilid_47 |  -.2852555   .0684097    -4.17   0.000    -.4203267   -.1501843
          _cons |   -.087313    .142749    -0.61   0.542    -.3691631    .1945371
---------------------------------------------------------------------------------

. outreg2 using `outputfile2'
Table3.xls
dir : seeout

. reg takeup_survey network_second male age agpop ricearea_2010 literacy intensive risk_averse disaster_p
> rob friend* _Ivilid* if delay == 1 & info_none == 1, cluster(address)
note: friend1 omitted because of collinearity
note: friend2 omitted because of collinearity
note: _Ivilid_5 omitted because of collinearity
note: _Ivilid_23 omitted because of collinearity
note: _Ivilid_32 omitted because of collinearity

Linear regression                                      Number of obs =    1247
                                                       F( 51,   165) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1088
                                                       Root MSE      =  .47884

                                (Std. Err. adjusted for 166 clusters in address)
--------------------------------------------------------------------------------
               |               Robust
 takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
network_second |   .1903409   .1429398     1.33   0.185     -.091886    .4725678
          male |   .0090655   .0767559     0.12   0.906    -.1424849    .1606159
           age |   .0044761   .0012572     3.56   0.000     .0019939    .0069583
         agpop |  -.0094368   .0069773    -1.35   0.178    -.0232131    .0043395
 ricearea_2010 |   .0040685   .0010417     3.91   0.000     .0020117    .0061253
      literacy |   .0849489   .0325524     2.61   0.010     .0206761    .1492218
     intensive |   .0259043   .0339716     0.76   0.447    -.0411708    .0929794
   risk_averse |   .1156898   .0492899     2.35   0.020     .0183695    .2130101
 disaster_prob |   .0019156   .0008151     2.35   0.020     .0003064    .0035249
       friend1 |          0  (omitted)
       friend2 |          0  (omitted)
       friend3 |   .0507162   .2443188     0.21   0.836     -.431678    .5331103
       friend4 |   .0757353   .1245274     0.61   0.544    -.1701372    .3216078
       friend5 |   .2275348   .0578182     3.94   0.000     .1133759    .3416936
     _Ivilid_2 |  -.5336848   .1683588    -3.17   0.002    -.8661002   -.2012695
     _Ivilid_3 |  -.3878885   .0993184    -3.91   0.000    -.5839872   -.1917897
     _Ivilid_4 |  -.2368713   .0932701    -2.54   0.012    -.4210279   -.0527146
     _Ivilid_5 |          0  (omitted)
     _Ivilid_6 |  -.0194716   .1719655    -0.11   0.910    -.3590081    .3200649
     _Ivilid_7 |  -.2143586    .097518    -2.20   0.029    -.4069026   -.0218146
     _Ivilid_8 |   -.168016   .1053345    -1.60   0.113    -.3759932    .0399613
     _Ivilid_9 |   -.303785   .1466342    -2.07   0.040    -.5933063   -.0142637
    _Ivilid_10 |   -.200363   .1069899    -1.87   0.063    -.4116087    .0108827
    _Ivilid_11 |  -.3085632   .1007888    -3.06   0.003    -.5075651   -.1095612
    _Ivilid_12 |   -.095443   .1352113    -0.71   0.481    -.3624105    .1715244
    _Ivilid_13 |  -.1408732   .0842015    -1.67   0.096    -.3071245     .025378
    _Ivilid_14 |  -.3911296   .1153558    -3.39   0.001    -.6188934   -.1633658
    _Ivilid_15 |    .029078   .1329345     0.22   0.827     -.233394    .2915499
    _Ivilid_16 |  -.1164333   .0728366    -1.60   0.112    -.2602452    .0273786
    _Ivilid_17 |  -.3909233   .0997589    -3.92   0.000    -.5878918   -.1939549
    _Ivilid_18 |  -.1419936   .1847941    -0.77   0.443    -.5068595    .2228724
    _Ivilid_19 |  -.4169582    .109913    -3.79   0.000    -.6339755   -.1999408
    _Ivilid_20 |  -.1237092    .117801    -1.05   0.295    -.3563009    .1088824
    _Ivilid_21 |  -.3452667   .1105867    -3.12   0.002    -.5636141   -.1269193
    _Ivilid_22 |  -.2732541   .1400251    -1.95   0.053     -.549726    .0032178
    _Ivilid_23 |          0  (omitted)
    _Ivilid_24 |  -.1382103   .1673635    -0.83   0.410    -.4686605    .1922398
    _Ivilid_25 |   .0201113   .1728212     0.12   0.908    -.3211147    .3613373
    _Ivilid_26 |  -.2120335   .0795388    -2.67   0.008    -.3690785   -.0549884
    _Ivilid_27 |  -.0760166   .0778218    -0.98   0.330    -.2296716    .0776384
    _Ivilid_28 |  -.1368717   .0981216    -1.39   0.165    -.3306075    .0568642
    _Ivilid_29 |  -.3936665   .1141253    -3.45   0.001    -.6190006   -.1683324
    _Ivilid_30 |  -.3066496   .1676443    -1.83   0.069    -.6376541     .024355
    _Ivilid_31 |  -.3143952   .0769633    -4.09   0.000     -.466355   -.1624354
    _Ivilid_32 |          0  (omitted)
    _Ivilid_33 |  -.1035432   .0844402    -1.23   0.222    -.2702659    .0631795
    _Ivilid_34 |  -.1574176   .2274816    -0.69   0.490    -.6065677    .2917325
    _Ivilid_35 |  -.4674515     .07353    -6.36   0.000    -.6126325   -.3222704
    _Ivilid_36 |  -.4439156   .1182092    -3.76   0.000    -.6773132    -.210518
    _Ivilid_37 |  -.2699698   .0790103    -3.42   0.001    -.4259712   -.1139683
    _Ivilid_38 |  -.2046635   .1989601    -1.03   0.305    -.5974994    .1881724
    _Ivilid_39 |  -.2486985   .1555968    -1.60   0.112    -.5559159    .0585189
    _Ivilid_40 |  -.3638617   .1690827    -2.15   0.033    -.6977062   -.0300172
    _Ivilid_41 |  -.2393779   .1143943    -2.09   0.038    -.4652433   -.0135126
    _Ivilid_42 |  -.3632935   .0888681    -4.09   0.000    -.5387587   -.1878283
    _Ivilid_43 |     .32095   .0834472     3.85   0.000     .1561882    .4857119
    _Ivilid_44 |  -.1992312   .1413628    -1.41   0.161    -.4783444     .079882
    _Ivilid_45 |  -.0156642   .1220796    -0.13   0.898    -.2567038    .2253753
    _Ivilid_46 |  -.3881369   .0847681    -4.58   0.000     -.555507   -.2207669
    _Ivilid_47 |  -.3413436   .1048676    -3.25   0.001    -.5483989   -.1342883
         _cons |   .0333829   .1047035     0.32   0.750    -.1733485    .2401143
--------------------------------------------------------------------------------

. outreg2 using `outputfile2'
Table3.xls
dir : seeout

. reg takeup_survey network_onlyone network_onlytwo network_twomore male age agpop ricearea_2010 literacy
>  intensive risk_averse disaster_prob friend* _Ivilid* if delay == 1 & info_none == 1, cluster(address)
note: friend1 omitted because of collinearity
note: friend2 omitted because of collinearity
note: _Ivilid_5 omitted because of collinearity
note: _Ivilid_23 omitted because of collinearity
note: _Ivilid_27 omitted because of collinearity

Linear regression                                      Number of obs =    1255
                                                       F( 53,   165) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1229
                                                       Root MSE      =  .47532

                                 (Std. Err. adjusted for 166 clusters in address)
---------------------------------------------------------------------------------
                |               Robust
  takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
network_onlyone |   .0531452   .0315233     1.69   0.094     -.009096    .1153863
network_onlytwo |   .1105086   .0818464     1.35   0.179    -.0510926    .2721098
network_twomore |   .0750393    .070789     1.06   0.291    -.0647298    .2148083
           male |   .0215778   .0732348     0.29   0.769    -.1230204     .166176
            age |   .0044863   .0012224     3.67   0.000     .0020727    .0068998
          agpop |  -.0089016   .0068582    -1.30   0.196    -.0224427    .0046395
  ricearea_2010 |   .0043561   .0010283     4.24   0.000     .0023259    .0063864
       literacy |   .0890687   .0327671     2.72   0.007      .024372    .1537655
      intensive |   .0251553    .033083     0.76   0.448    -.0401654    .0904759
    risk_averse |   .1091457   .0491475     2.22   0.028     .0121066    .2061847
  disaster_prob |   .0017922   .0008041     2.23   0.027     .0002046    .0033798
        friend1 |          0  (omitted)
        friend2 |          0  (omitted)
        friend3 |   .0518693   .2295619     0.23   0.822    -.4013881    .5051267
        friend4 |    .098232   .1280545     0.77   0.444    -.1546047    .3510687
        friend5 |   .2204511   .0658038     3.35   0.001      .090525    .3503772
      _Ivilid_2 |  -.4396058   .1337116    -3.29   0.001    -.7036121   -.1755994
      _Ivilid_3 |  -.2779983   .0661025    -4.21   0.000    -.4085141   -.1474825
      _Ivilid_4 |  -.1418739    .059547    -2.38   0.018    -.2594462   -.0243015
      _Ivilid_5 |          0  (omitted)
      _Ivilid_6 |   .0833515   .1414929     0.59   0.557    -.1960185    .3627215
      _Ivilid_7 |  -.1070281   .0736403    -1.45   0.148    -.2524268    .0383707
      _Ivilid_8 |  -.0520072   .0815074    -0.64   0.524    -.2129391    .1089246
      _Ivilid_9 |  -.1710392     .14421    -1.19   0.237     -.455774    .1136956
     _Ivilid_10 |  -.0942549   .1003159    -0.94   0.349    -.2923232    .1038134
     _Ivilid_11 |  -.1667545   .0679844    -2.45   0.015     -.300986    -.032523
     _Ivilid_12 |   .0111201   .1078897     0.10   0.918    -.2019022    .2241424
     _Ivilid_13 |  -.0312025   .0670201    -0.47   0.642      -.16353     .101125
     _Ivilid_14 |  -.2720699   .0860987    -3.16   0.002    -.4420671   -.1020726
     _Ivilid_15 |   .1632273   .1199429     1.36   0.175    -.0735935     .400048
     _Ivilid_16 |   .0030257   .0304968     0.10   0.921    -.0571885      .06324
     _Ivilid_17 |  -.2778286   .0629436    -4.41   0.000    -.4021073   -.1535499
     _Ivilid_18 |  -.0313994   .1584509    -0.20   0.843    -.3442521    .2814533
     _Ivilid_19 |  -.3177548   .0843332    -3.77   0.000    -.4842662   -.1512434
     _Ivilid_20 |  -.0087327   .0928551    -0.09   0.925    -.1920701    .1746046
     _Ivilid_21 |  -.2348121   .0734676    -3.20   0.002    -.3798698   -.0897543
     _Ivilid_22 |  -.1605372    .115947    -1.38   0.168    -.3894682    .0683939
     _Ivilid_23 |          0  (omitted)
     _Ivilid_24 |  -.0603569   .1427249    -0.42   0.673    -.3421595    .2214456
     _Ivilid_25 |   .1521801   .1536331     0.99   0.323    -.1511602    .4555204
     _Ivilid_26 |  -.1216798   .0385866    -3.15   0.002     -.197867   -.0454927
     _Ivilid_27 |          0  (omitted)
     _Ivilid_28 |  -.0117229   .0890566    -0.13   0.895    -.1875604    .1641146
     _Ivilid_29 |   -.301379   .0888245    -3.39   0.001    -.4767582   -.1259999
     _Ivilid_30 |   -.191916   .1430929    -1.34   0.182    -.4744451    .0906131
     _Ivilid_31 |  -.1814926   .0185918    -9.76   0.000     -.218201   -.1447842
     _Ivilid_32 |   .1112375   .0889449     1.25   0.213    -.0643794    .2868543
     _Ivilid_33 |   .0155188   .0409356     0.38   0.705    -.0653063    .0963439
     _Ivilid_34 |  -.0283388   .2159259    -0.13   0.896    -.4546727    .3979951
     _Ivilid_35 |  -.3389661   .0302679   -11.20   0.000    -.3987284   -.2792038
     _Ivilid_36 |  -.3435459   .1011667    -3.40   0.001     -.543294   -.1437977
     _Ivilid_37 |   -.150358   .0278946    -5.39   0.000    -.2054344   -.0952816
     _Ivilid_38 |  -.0850956   .1828322    -0.47   0.642    -.4460877    .2758966
     _Ivilid_39 |  -.1062848    .135541    -0.78   0.434    -.3739031    .1613336
     _Ivilid_40 |  -.2568408   .1569836    -1.64   0.104    -.5667964    .0531147
     _Ivilid_41 |  -.1515437   .0883505    -1.72   0.088    -.3259869    .0228995
     _Ivilid_42 |  -.2480331   .0508355    -4.88   0.000     -.348405   -.1476612
     _Ivilid_43 |   .4566513   .0323643    14.11   0.000     .3927497    .5205529
     _Ivilid_44 |  -.0826593   .1115177    -0.74   0.460    -.3028448    .1375263
     _Ivilid_45 |   .1106018   .0937615     1.18   0.240    -.0745251    .2957288
     _Ivilid_46 |  -.2684424    .035862    -7.49   0.000      -.33925   -.1976348
     _Ivilid_47 |  -.2379705   .0723052    -3.29   0.001    -.3807331   -.0952078
          _cons |  -.1052584   .0985511    -1.07   0.287    -.2998422    .0893254
---------------------------------------------------------------------------------

. outreg2 using `outputfile2'
Table3.xls
dir : seeout

. save temp, replace
file temp.dta saved

. 
. **********************************************************4. Price effect******************************
> ******************************
. use 0422price, replace

. *Table A2, check validity of price randomization
. xi i.address
i.address         _Iaddress_1-12      (_Iaddress_1 for addr~s==caijia3 omitted)

. gen pricesquare = price*price

. local outputfile3 TableA2.xls

. foreach x in male age agpop literacy earlyarea{
  2.         reg `x' price _Iaddress*, cluster(address)
  3.         outreg2 using `outputfile3'
  4. }

Linear regression                                      Number of obs =     433
                                                       F(  0,    11) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0881
                                                       Root MSE      =  .41145

                               (Std. Err. adjusted for 12 clusters in address)
------------------------------------------------------------------------------
             |               Robust
        male |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |   .0020615   .0122128     0.17   0.869    -.0248187    .0289416
 _Iaddress_2 |   .0356205   .0018862    18.88   0.000      .031469    .0397721
 _Iaddress_3 |   -.162748   .0016245  -100.18   0.000    -.1663236   -.1591724
 _Iaddress_4 |  -.2881007   .0013628  -211.40   0.000    -.2911002   -.2851011
 _Iaddress_5 |   .1694133   .0008355   202.78   0.000     .1675744    .1712521
 _Iaddress_6 |  -.2235499   .0002074 -1077.93   0.000    -.2240064   -.2230934
 _Iaddress_7 |   .0056297   .0085121     0.66   0.522    -.0131053    .0243646
 _Iaddress_8 |   .0646949   .0063422    10.20   0.000     .0507359    .0786539
 _Iaddress_9 |   .0852495   .0100212     8.51   0.000     .0631929     .107306
_Iaddress_10 |   .1237695   .0047556    26.03   0.000     .1133026    .1342365
_Iaddress_11 |  -.0590654    .001385   -42.65   0.000    -.0621139   -.0560169
_Iaddress_12 |   .0474862   .0033075    14.36   0.000     .0402063    .0547661
       _cons |   .7642733   .0551648    13.85   0.000     .6428564    .8856903
------------------------------------------------------------------------------
TableA2.xls
dir : seeout

Linear regression                                      Number of obs =     433
                                                       F(  0,    11) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0760
                                                       Root MSE      =  11.583

                               (Std. Err. adjusted for 12 clusters in address)
------------------------------------------------------------------------------
             |               Robust
         age |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |   .4039628   .3185521     1.27   0.231    -.2971656    1.105091
 _Iaddress_2 |   3.780376   .0491996    76.84   0.000     3.672089    3.888664
 _Iaddress_3 |   .5112548   .0423734    12.07   0.000     .4179915    .6045181
 _Iaddress_4 |  -3.678502   .0355473  -103.48   0.000    -3.756741   -3.600262
 _Iaddress_5 |  -8.462931   .0217921  -388.35   0.000    -8.510895   -8.414967
 _Iaddress_6 |   1.416294   .0054094   261.82   0.000     1.404388      1.4282
 _Iaddress_7 |    -3.2979   .2220248   -14.85   0.000    -3.786574   -2.809227
 _Iaddress_8 |   2.277354   .1654262    13.77   0.000     1.913253    2.641455
 _Iaddress_9 |  -.9805219   .2613887    -3.75   0.003    -1.555835   -.4052092
_Iaddress_10 |   1.563287   .1240426    12.60   0.000     1.290271    1.836303
_Iaddress_11 |  -1.516181   .0361269   -41.97   0.000    -1.595696   -1.436667
_Iaddress_12 |  -2.714495   .0862726   -31.46   0.000     -2.90438   -2.524611
       _cons |   49.66587   1.438894    34.52   0.000     46.49889    52.83286
------------------------------------------------------------------------------
TableA2.xls
dir : seeout

Linear regression                                      Number of obs =     433
                                                       F(  0,    11) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1263
                                                       Root MSE      =  1.7998

                               (Std. Err. adjusted for 12 clusters in address)
------------------------------------------------------------------------------
             |               Robust
       agpop |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |  -.0134576   .0485413    -0.28   0.787    -.1202962     .093381
 _Iaddress_2 |   -.712926   .0074971   -95.09   0.000     -.729427   -.6964251
 _Iaddress_3 |  -1.561627   .0064569  -241.85   0.000    -1.575839   -1.547416
 _Iaddress_4 |   -.051598   .0054167    -9.53   0.000    -.0635201   -.0396758
 _Iaddress_5 |   .2459796   .0033207    74.07   0.000     .2386708    .2532884
 _Iaddress_6 |   1.725243   .0008243  2093.01   0.000     1.723429    1.727057
 _Iaddress_7 |   .0216475   .0338323     0.64   0.535     -.052817     .096112
 _Iaddress_8 |   .0452272   .0252078     1.79   0.100    -.0102548    .1007093
 _Iaddress_9 |  -.6498567   .0398307   -16.32   0.000    -.7375234     -.56219
_Iaddress_10 |  -.1021824   .0189017    -5.41   0.000    -.1437848     -.06058
_Iaddress_11 |  -.9974831    .005505  -181.19   0.000      -1.0096   -.9853666
_Iaddress_12 |  -.6461217   .0131463   -49.15   0.000    -.6750565   -.6171869
       _cons |   4.985316     .21926    22.74   0.000     4.502728    5.467904
------------------------------------------------------------------------------
TableA2.xls
dir : seeout

Linear regression                                      Number of obs =     433
                                                       F(  0,    11) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0705
                                                       Root MSE      =  .41111

                               (Std. Err. adjusted for 12 clusters in address)
------------------------------------------------------------------------------
             |               Robust
    literacy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |  -.0065609   .0136172    -0.48   0.639    -.0365321    .0234103
 _Iaddress_2 |  -.1207297   .0021031   -57.40   0.000    -.1253587   -.1161008
 _Iaddress_3 |  -.0494417   .0018113   -27.30   0.000    -.0534285    -.045455
 _Iaddress_4 |  -.0591061   .0015195   -38.90   0.000    -.0624506   -.0557616
 _Iaddress_5 |     .28257   .0009315   303.33   0.000     .2805197    .2846204
 _Iaddress_6 |   .0329075   .0002312   142.31   0.000     .0323985    .0334164
 _Iaddress_7 |   .0340016   .0094909     3.58   0.004     .0131123    .0548909
 _Iaddress_8 |   .1400769   .0070715    19.81   0.000     .1245126    .1556411
 _Iaddress_9 |   .1704924   .0111736    15.26   0.000     .1458995    .1950854
_Iaddress_10 |   .0735675   .0053025    13.87   0.000     .0618969    .0852382
_Iaddress_11 |   .0322748   .0015443    20.90   0.000     .0288758    .0356738
_Iaddress_12 |   .1530369   .0036879    41.50   0.000     .1449199    .1611539
       _cons |   .7466166   .0615085    12.14   0.000     .6112374    .8819958
------------------------------------------------------------------------------
TableA2.xls
dir : seeout

Linear regression                                      Number of obs =     433
                                                       F(  0,    11) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1307
                                                       Root MSE      =  9.4911

                               (Std. Err. adjusted for 12 clusters in address)
------------------------------------------------------------------------------
             |               Robust
   earlyarea |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |  -.0005445   .1972771    -0.00   0.998    -.4347485    .4336595
 _Iaddress_2 |  -.1220363   .0304689    -4.01   0.002     -.189098   -.0549746
 _Iaddress_3 |   3.612714   .0262416   137.67   0.000     3.554957    3.670471
 _Iaddress_4 |   3.867845   .0220142   175.70   0.000     3.819392    3.916298
 _Iaddress_5 |   2.385747   .0134957   176.78   0.000     2.356043    2.415451
 _Iaddress_6 |   2.780632     .00335   830.04   0.000     2.773259    2.788006
 _Iaddress_7 |   6.808707   .1374984    49.52   0.000     6.506075    7.111339
 _Iaddress_8 |   6.667242   .1024473    65.08   0.000     6.441757    6.892728
 _Iaddress_9 |   8.733266   .1618762    53.95   0.000     8.376979    9.089553
_Iaddress_10 |   9.072085   .0768187   118.10   0.000     8.903008    9.241162
_Iaddress_11 |   12.08829   .0223731   540.30   0.000     12.03905    12.13754
_Iaddress_12 |   7.624289    .053428   142.70   0.000     7.506695    7.741883
       _cons |   6.129818    .891097     6.88   0.000     4.168527    8.091109
------------------------------------------------------------------------------
TableA2.xls
dir : seeout

. 
. *Figure 2, Plot insurance demand curve, by having above or below median share of friends in first round
>  intensive session
. bysort price: egen takeup_mean1 = mean(takeup) if preintens_high == 0
(183 missing values generated)

. bysort price: egen takeup_mean2 = mean(takeup) if preintens_high == 1
(250 missing values generated)

. bysort price: egen takeup_sd1 = sd(takeup) if preintens_high == 0
(183 missing values generated)

. bysort price: egen takeup_sd2 = sd(takeup) if preintens_high == 1
(250 missing values generated)

. bysort price: gen counttotal = _N

. bysort price: egen count2 = sum(preintens_high) 

. gen count1 = counttotal - count2

. gen ci1 = takeup_mean1 + invttail(count1, 0.025)*takeup_sd1/sqrt(count1) if preintens_high == 0
(183 missing values generated)

. replace ci1 = takeup_mean2 + invttail(count2, 0.025)*takeup_sd2/sqrt(count2) if preintens_high == 1
(183 real changes made)

. gen ci2 = takeup_mean1 - invttail(count1, 0.025)*takeup_sd1/sqrt(count1) if preintens_high == 0
(183 missing values generated)

. replace ci2 = takeup_mean2 - invttail(count2, 0.025)*takeup_sd2/sqrt(count2) if preintens_high == 1
(183 real changes made)

. twoway (line takeup_mean1 takeup_mean2 price, clpattern("dash")) (rcap ci1 ci2 price), xtitle("Price") 
> ytitle("Take-up") legend(order(1 "%Network financially educated = Low" 2 "%Network financially educated
>  = High" 3 "95% CI") colfirst)

. 
. *Define dummies of the number of friends
. xi i.address
i.address         _Iaddress_1-12      (_Iaddress_1 for addr~s==caijia3 omitted)

. forvalues i = 1(1)8{
  2.   gen friend`i'=0 if network_obs ~= .
  3.   replace friend`i' = 1 if network_obs == `i'
  4. }
(1 real change made)
(4 real changes made)
(40 real changes made)
(16 real changes made)
(300 real changes made)
(44 real changes made)
(21 real changes made)
(7 real changes made)

. 
. *Table 4, price effect analysis
. gen inter_price_network = price*network_rate_preintensive

. local outputfile4 Table4.xls

. reg takeup price network_rate_preintensive intensive male age agpop earlyarea literacy friend1 friend2 
> friend3 friend4 friend5 friend6 friend7 friend8 _Iaddress*, cluster(address)
note: friend1 omitted because of collinearity

Linear regression                                      Number of obs =     433
                                                       F( 10,    11) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.2653
                                                       Root MSE      =  .44187

                                            (Std. Err. adjusted for 12 clusters in address)
-------------------------------------------------------------------------------------------
                          |               Robust
                   takeup |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
                    price |  -.1226735   .0160259    -7.65   0.000    -.1579463   -.0874008
network_rate_preintensive |   .3533625   .1118791     3.16   0.009     .1071182    .5996068
                intensive |   .0411764   .0278026     1.48   0.167    -.0200167    .1023694
                     male |   .0031697   .0712071     0.04   0.965    -.1535561    .1598956
                      age |  -.0028503   .0022445    -1.27   0.230    -.0077904    .0020898
                    agpop |   -.010638   .0096319    -1.10   0.293    -.0318377    .0105617
                earlyarea |   .0024483   .0015843     1.55   0.151    -.0010387    .0059353
                 literacy |  -.0272226   .0768467    -0.35   0.730     -.196361    .1419157
                  friend1 |          0  (omitted)
                  friend2 |    .009386   .0702202     0.13   0.896    -.1451676    .1639397
                  friend3 |   .1135317   .0843505     1.35   0.205    -.0721225     .299186
                  friend4 |   .0773985   .1270278     0.61   0.555    -.2021877    .3569847
                  friend5 |   .0758803   .0504988     1.50   0.161    -.0352669    .1870275
                  friend6 |   .0803579   .1029476     0.78   0.452    -.1462282     .306944
                  friend7 |    .257584   .1335997     1.93   0.080     -.036467     .551635
                  friend8 |    .174107   .0962099     1.81   0.098    -.0376495    .3858634
              _Iaddress_2 |   .2909714   .0183439    15.86   0.000     .2505969     .331346
              _Iaddress_3 |   .2919436    .017555    16.63   0.000     .2533055    .3305818
              _Iaddress_4 |    .177878   .0305688     5.82   0.000     .1105965    .2451595
              _Iaddress_5 |   .1201494   .0182428     6.59   0.000     .0799972    .1603016
              _Iaddress_6 |   .3339637   .0482828     6.92   0.000     .2276941    .4402333
              _Iaddress_7 |   .0719075   .0261247     2.75   0.019     .0144074    .1294076
              _Iaddress_8 |   .1958296   .0388115     5.05   0.000     .1104061     .281253
              _Iaddress_9 |   .0042466   .0296955     0.14   0.889    -.0611127    .0696058
             _Iaddress_10 |   .1732987   .0241673     7.17   0.000     .1201069    .2264906
             _Iaddress_11 |   .5180445    .022228    23.31   0.000     .4691209    .5669681
             _Iaddress_12 |   .2114187   .0208525    10.14   0.000     .1655227    .2573146
                    _cons |   .8094282    .170375     4.75   0.001     .4344353    1.184421
-------------------------------------------------------------------------------------------

. outreg2 using `outputfile4'
Table4.xls
dir : seeout

. reg takeup price network_rate_preintensive inter_price_network intensive male age agpop earlyarea liter
> acy friend1 friend2 friend3 friend4 friend5 friend6 friend7 friend8 _Iaddress*, cluster(address)
note: friend1 omitted because of collinearity

Linear regression                                      Number of obs =     433
                                                       F( 10,    11) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.2705
                                                       Root MSE      =  .44084

                                            (Std. Err. adjusted for 12 clusters in address)
-------------------------------------------------------------------------------------------
                          |               Robust
                   takeup |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
                    price |  -.1512087   .0191354    -7.90   0.000    -.1933254    -.109092
network_rate_preintensive |   -.177663   .2367777    -0.75   0.469    -.6988073    .3434813
      inter_price_network |   .1248317   .0488514     2.56   0.027     .0173104     .232353
                intensive |   .0369307   .0284342     1.30   0.221    -.0256525    .0995139
                     male |  -.0023182   .0712969    -0.03   0.975    -.1592417    .1546053
                      age |  -.0026337    .002254    -1.17   0.267    -.0075947    .0023273
                    agpop |  -.0093782   .0095142    -0.99   0.345    -.0303188    .0115625
                earlyarea |   .0024358   .0014927     1.63   0.131    -.0008496    .0057213
                 literacy |  -.0248982   .0776294    -0.32   0.754    -.1957593    .1459629
                  friend1 |          0  (omitted)
                  friend2 |  -.0127084   .0541931    -0.23   0.819    -.1319866    .1065698
                  friend3 |   .0644423   .0881386     0.73   0.480    -.1295495    .2584341
                  friend4 |   .0237466   .1432327     0.17   0.871    -.2915064    .3389996
                  friend5 |   .0294545    .053601     0.55   0.594    -.0885206    .1474295
                  friend6 |   .0405842   .1036547     0.39   0.703    -.1875582    .2687266
                  friend7 |   .2344115   .1328057     1.77   0.105    -.0578919    .5267149
                  friend8 |   .1506539   .0990984     1.52   0.157    -.0674603    .3687681
              _Iaddress_2 |   .3048185   .0211832    14.39   0.000     .2581946    .3514424
              _Iaddress_3 |   .2907479    .016775    17.33   0.000     .2538263    .3276695
              _Iaddress_4 |    .186244    .031275     5.96   0.000     .1174081    .2550798
              _Iaddress_5 |   .1197848   .0179017     6.69   0.000     .0803835    .1591861
              _Iaddress_6 |   .3347803   .0480508     6.97   0.000     .2290213    .4405393
              _Iaddress_7 |   .0674058   .0256033     2.63   0.023     .0110533    .1237583
              _Iaddress_8 |   .1760131    .040183     4.38   0.001     .0875709    .2644553
              _Iaddress_9 |   .0066443   .0294027     0.23   0.825    -.0580706    .0713592
             _Iaddress_10 |   .1756015   .0235128     7.47   0.000     .1238502    .2273529
             _Iaddress_11 |   .5033581   .0209089    24.07   0.000     .4573379    .5493783
             _Iaddress_12 |   .1907334   .0210798     9.05   0.000     .1443372    .2371297
                    _cons |   .9662635   .1876746     5.15   0.000     .5531944    1.379333
-------------------------------------------------------------------------------------------

. outreg2 using `outputfile4'
Table4.xls
dir : seeout

. test price inter_price_network

 ( 1)  price = 0
 ( 2)  inter_price_network = 0

       F(  2,    11) =   33.18
            Prob > F =    0.0000

. test network_rate_preintensive inter_price_network

 ( 1)  network_rate_preintensive = 0
 ( 2)  inter_price_network = 0

       F(  2,    11) =    8.09
            Prob > F =    0.0069

. reg takeup price network_rate_preintensive inter_price_network price_high_ratio price_low_ratio intensi
> ve male age agpop earlyarea literacy friend1 friend2 friend3 friend4 friend5 friend6 friend7 friend8 _I
> address*, cluster(address)
note: friend1 omitted because of collinearity

Linear regression                                      Number of obs =     433
                                                       F( 10,    11) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.2728
                                                       Root MSE      =  .44122

                                            (Std. Err. adjusted for 12 clusters in address)
-------------------------------------------------------------------------------------------
                          |               Robust
                   takeup |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
                    price |  -.1396448   .0159111    -8.78   0.000    -.1746649   -.1046247
network_rate_preintensive |  -.1733185   .2293775    -0.76   0.466    -.6781749     .331538
      inter_price_network |   .1209177   .0500252     2.42   0.034     .0108129    .2310225
         price_high_ratio |   .0915833   .0734831     1.25   0.239     -.070152    .2533186
          price_low_ratio |   .0314357   .0936055     0.34   0.743    -.1745886    .2374601
                intensive |   .0391116   .0282086     1.39   0.193     -.022975    .1011982
                     male |   .0008004   .0701392     0.01   0.991    -.1535749    .1551757
                      age |  -.0026111   .0023076    -1.13   0.282      -.00769    .0024679
                    agpop |  -.0092022   .0086369    -1.07   0.309    -.0282118    .0098075
                earlyarea |   .0025569   .0015175     1.68   0.120    -.0007831     .005897
                 literacy |  -.0266802   .0761492    -0.35   0.733    -.1942835     .140923
                  friend1 |          0  (omitted)
                  friend2 |  -.0681612   .1155211    -0.59   0.567    -.3224213     .186099
                  friend3 |   .0211034   .1006578     0.21   0.838     -.200443    .2426498
                  friend4 |  -.0085039    .119919    -0.07   0.945    -.2724438     .255436
                  friend5 |  -.0034559   .0661669    -0.05   0.959    -.1490882    .1421765
                  friend6 |   .0092703   .1293457     0.07   0.944    -.2754175    .2939582
                  friend7 |   .2034177   .1379929     1.47   0.168    -.1003025     .507138
                  friend8 |   .1223518   .1197344     1.02   0.329    -.1411818    .3858854
              _Iaddress_2 |   .3020862   .0237574    12.72   0.000     .2497965     .354376
              _Iaddress_3 |   .2883203   .0161417    17.86   0.000     .2527927    .3238478
              _Iaddress_4 |   .1824791    .033284     5.48   0.000     .1092216    .2557366
              _Iaddress_5 |   .1154742   .0181328     6.37   0.000     .0755642    .1553842
              _Iaddress_6 |   .3242865   .0488759     6.63   0.000     .2167112    .4318617
              _Iaddress_7 |   .0776301   .0270202     2.87   0.015     .0181589    .1371012
              _Iaddress_8 |    .183493   .0386048     4.75   0.001     .0985244    .2684616
              _Iaddress_9 |   .0156174   .0291845     0.54   0.603    -.0486173     .079852
             _Iaddress_10 |   .1634827   .0247455     6.61   0.000     .1090182    .2179473
             _Iaddress_11 |   .4996315   .0201534    24.79   0.000     .4552743    .5439888
             _Iaddress_12 |   .1957325    .015064    12.99   0.000     .1625769     .228888
                    _cons |   .9017201   .1824533     4.94   0.000     .5001431    1.303297
-------------------------------------------------------------------------------------------

. outreg2 using `outputfile4'
Table4.xls
dir : seeout

. test price inter_price_network

 ( 1)  price = 0
 ( 2)  inter_price_network = 0

       F(  2,    11) =   38.68
            Prob > F =    0.0000

. test network_rate_preintensive inter_price_network

 ( 1)  network_rate_preintensive = 0
 ( 2)  inter_price_network = 0

       F(  2,    11) =    6.59
            Prob > F =    0.0131

. *Table 7, column 9, estimate effect of friends' decisions using the price sample
. local outputfile7 Table7.xls

. ivregress 2sls takeup price (network_rate_pretakeup = network_avgprice) intensive male age agpop earlya
> rea literacy friend1 friend2 friend3 friend4 friend5 friend6 friend7 friend8 _Iaddress*, cluster(addres
> s)
note: friend1 omitted because of collinearity
note: friend8 omitted because of collinearity

Instrumental variables (2SLS) regression               Number of obs =     405
                                                       Wald chi2(25) =  700.11
                                                       Prob > chi2   =  0.0000
                                                       R-squared     =  0.2372
                                                       Root MSE      =  .43639

                                         (Std. Err. adjusted for 12 clusters in address)
----------------------------------------------------------------------------------------
                       |               Robust
                takeup |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
network_rate_pretakeup |   .0989694    .205352     0.48   0.630    -.3035132    .5014519
                 price |  -.1210538   .0127369    -9.50   0.000    -.1460176   -.0960899
             intensive |   .0214835   .0322959     0.67   0.506    -.0418153    .0847823
                  male |  -.0043564   .0720596    -0.06   0.952    -.1455906    .1368778
                   age |   -.002756   .0023302    -1.18   0.237    -.0073231     .001811
                 agpop |  -.0077297   .0093049    -0.83   0.406    -.0259669    .0105075
             earlyarea |   .0024422   .0015127     1.61   0.106    -.0005226    .0054069
              literacy |  -.0156787   .0758116    -0.21   0.836    -.1642666    .1329093
               friend1 |          0  (omitted)
               friend2 |  -.2605082   .1200417    -2.17   0.030    -.4957855   -.0252308
               friend3 |  -.0556269   .1208755    -0.46   0.645    -.2925386    .1812849
               friend4 |  -.0934516   .1532378    -0.61   0.542    -.3937922     .206889
               friend5 |  -.0846688   .0693994    -1.22   0.222    -.2206892    .0513516
               friend6 |  -.0714191   .0858412    -0.83   0.405    -.2396648    .0968267
               friend7 |   .0816191   .1458181     0.56   0.576    -.2041791    .3674173
               friend8 |          0  (omitted)
           _Iaddress_2 |   .2786312   .0671077     4.15   0.000     .1471026    .4101599
           _Iaddress_3 |   .2183506   .0931169     2.34   0.019     .0358449    .4008563
           _Iaddress_4 |   .1901818   .0655638     2.90   0.004     .0616791    .3186846
           _Iaddress_5 |   .0312505   .0724029     0.43   0.666    -.1106565    .1731576
           _Iaddress_6 |    .240698   .0946576     2.54   0.011     .0551726    .4262235
           _Iaddress_7 |   .0244916   .1128542     0.22   0.828    -.1966987    .2456818
           _Iaddress_8 |   .1789532   .0698849     2.56   0.010     .0419812    .3159251
           _Iaddress_9 |  -.0101841   .0644372    -0.16   0.874    -.1364787    .1161104
          _Iaddress_10 |   .1626479   .0207928     7.82   0.000     .1218947    .2034011
          _Iaddress_11 |   .4497184   .1275773     3.53   0.000     .1996714    .6997653
          _Iaddress_12 |    .136695   .0868885     1.57   0.116    -.0336033    .3069932
                 _cons |   1.032408    .180142     5.73   0.000     .6793364     1.38548
----------------------------------------------------------------------------------------
Instrumented:  network_rate_pretakeup
Instruments:   price intensive male age agpop earlyarea literacy friend2 friend3
               friend4 friend5 friend6 friend7 _Iaddress_2 _Iaddress_3 _Iaddress_4
               _Iaddress_5 _Iaddress_6 _Iaddress_7 _Iaddress_8 _Iaddress_9
               _Iaddress_10 _Iaddress_11 _Iaddress_12 network_avgprice

. estat firststage

  First-stage regression summary statistics
  --------------------------------------------------------------------------
               |            Adjusted      Partial       Robust
      Variable |   R-sq.       R-sq.        R-sq.       F(1,11)   Prob > F
  -------------+------------------------------------------------------------
  network_ra~p |  0.3781      0.3371       0.1291       19.7753    0.0010
  --------------------------------------------------------------------------
  (F statistic adjusted for 12 clusters in address)


. outreg2 using `outputfile7'
Table7.xls
dir : seeout

. 
. 
. **********************************************************5. Social learning of insurance benefits*****
> ***********************************
. use temp, replace

. gen inter_net_knowledge = network_rate_preintensive*knowledge_network
(1175 missing values generated)

. 
. *3. Test learning of insurance benefits
. *table 5
. local outputfile5 Table5.xls 

. reg understanding intensive delay inter_inten_delay male age agpop ricearea_2010 literacy risk_averse d
> isaster_prob _Ivilid* if info_none == 1, cluster(address)

Linear regression                                      Number of obs =    3262
                                                       F( 52,   172) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.2412
                                                       Root MSE      =  .26865

                                   (Std. Err. adjusted for 173 clusters in address)
-----------------------------------------------------------------------------------
                  |               Robust
    understanding |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
        intensive |    .315485    .011963    26.37   0.000     .2918717    .3390983
            delay |   .2235408   .0143594    15.57   0.000     .1951975    .2518841
inter_inten_delay |  -.2504379   .0199778   -12.54   0.000    -.2898711   -.2110048
             male |   .0400922   .0185321     2.16   0.032     .0035127    .0766718
              age |  -.0009903   .0004442    -2.23   0.027     -.001867   -.0001135
            agpop |    .001871   .0024722     0.76   0.450    -.0030089    .0067508
    ricearea_2010 |   .0005494   .0001821     3.02   0.003       .00019    .0009088
         literacy |   .0817955   .0122004     6.70   0.000     .0577137    .1058772
      risk_averse |   .0790353   .0142781     5.54   0.000     .0508525    .1072182
    disaster_prob |     .00074   .0002745     2.70   0.008     .0001983    .0012818
        _Ivilid_2 |  -.0690472   .0560859    -1.23   0.220    -.1797526    .0416581
        _Ivilid_3 |  -.0759326   .0516262    -1.47   0.143     -.177835    .0259699
        _Ivilid_4 |  -.1131678   .0073235   -15.45   0.000    -.1276234   -.0987123
        _Ivilid_5 |  -.0320563   .0047053    -6.81   0.000    -.0413439   -.0227686
        _Ivilid_6 |  -.0516947   .0608264    -0.85   0.397     -.171757    .0683677
        _Ivilid_7 |  -.0601146   .0271145    -2.22   0.028    -.1136345   -.0065946
        _Ivilid_8 |  -.0334959   .0191843    -1.75   0.083    -.0713628    .0043711
        _Ivilid_9 |  -.0469956   .0173657    -2.71   0.007     -.081273   -.0127182
       _Ivilid_10 |  -.1248947   .0243047    -5.14   0.000    -.1728687   -.0769208
       _Ivilid_11 |  -.0766906   .0201987    -3.80   0.000    -.1165599   -.0368214
       _Ivilid_12 |  -.0545407   .0449492    -1.21   0.227    -.1432637    .0341823
       _Ivilid_13 |  -.0340615   .0277526    -1.23   0.221    -.0888411    .0207182
       _Ivilid_14 |  -.0529874   .0244541    -2.17   0.032    -.1012561   -.0047187
       _Ivilid_15 |  -.1060542   .0062443   -16.98   0.000    -.1183795    -.093729
       _Ivilid_16 |  -.0820731   .0057299   -14.32   0.000    -.0933831   -.0707632
       _Ivilid_17 |   -.062828   .0266513    -2.36   0.020    -.1154338   -.0102223
       _Ivilid_18 |  -.0295043   .0072363    -4.08   0.000    -.0437876   -.0152209
       _Ivilid_19 |  -.1101086   .0146599    -7.51   0.000    -.1390451    -.081172
       _Ivilid_20 |  -.0044114   .0272537    -0.16   0.872    -.0582062    .0493834
       _Ivilid_21 |  -.0559493   .0344222    -1.63   0.106    -.1238935     .011995
       _Ivilid_22 |  -.0200434   .0383168    -0.52   0.602     -.095675    .0555883
       _Ivilid_23 |  -.1511573   .0614937    -2.46   0.015    -.2725367    -.029778
       _Ivilid_24 |  -.0588508   .0243576    -2.42   0.017    -.1069291   -.0107724
       _Ivilid_25 |  -.0632577   .0124595    -5.08   0.000     -.087851   -.0386644
       _Ivilid_26 |  -.0189428   .0387382    -0.49   0.625    -.0954063    .0575207
       _Ivilid_27 |  -.0499775   .0166656    -3.00   0.003     -.082873   -.0170821
       _Ivilid_28 |   -.138918   .0342951    -4.05   0.000    -.2066114   -.0712246
       _Ivilid_29 |  -.0718485   .0214059    -3.36   0.001    -.1141005   -.0295965
       _Ivilid_30 |  -.1698112   .0448523    -3.79   0.000     -.258343   -.0812793
       _Ivilid_31 |  -.0968074   .0081153   -11.93   0.000    -.1128257    -.080789
       _Ivilid_32 |  -.0969415   .0131814    -7.35   0.000    -.1229596   -.0709234
       _Ivilid_33 |  -.0188988   .0071424    -2.65   0.009    -.0329968   -.0048008
       _Ivilid_34 |  -.1012958   .0073625   -13.76   0.000    -.1158283   -.0867633
       _Ivilid_35 |  -.1115279   .0064956   -17.17   0.000    -.1243493   -.0987064
       _Ivilid_36 |  -.1135123   .0194063    -5.85   0.000    -.1518174   -.0752072
       _Ivilid_37 |  -.0699017   .0344988    -2.03   0.044    -.1379973   -.0018062
       _Ivilid_38 |   .0190066   .0236626     0.80   0.423    -.0276998    .0657131
       _Ivilid_39 |  -.1028394   .0253926    -4.05   0.000    -.1529606   -.0527183
       _Ivilid_40 |  -.1168103   .0123734    -9.44   0.000    -.1412336    -.092387
       _Ivilid_41 |  -.0113984   .0543578    -0.21   0.834    -.1186927    .0958958
       _Ivilid_42 |  -.0664225   .0255292    -2.60   0.010    -.1168134   -.0160316
       _Ivilid_43 |    .030161   .0158764     1.90   0.059    -.0011766    .0614987
       _Ivilid_44 |   .0048998    .041537     0.12   0.906     -.077088    .0868877
       _Ivilid_45 |   .0076052   .0313634     0.24   0.809    -.0543016    .0695119
       _Ivilid_46 |  -.1025147   .0153187    -6.69   0.000    -.1327516   -.0722779
       _Ivilid_47 |  -.0366634   .0308466    -1.19   0.236    -.0975501    .0242233
            _cons |   .2079849    .033018     6.30   0.000     .1428121    .2731576
-----------------------------------------------------------------------------------

. outreg2 using `outputfile5'
Table5.xls
dir : seeout

. test intensive inter_inten_delay

 ( 1)  intensive = 0
 ( 2)  inter_inten_delay = 0

       F(  2,   172) =  351.63
            Prob > F =    0.0000

. gen inter_inten_netyes = intensive*network_yes
(314 missing values generated)

. reg understanding intensive network_yes inter_inten_netyes male age agpop ricearea_2010 literacy risk_a
> verse disaster_prob _Ivilid* if delay == 1 & info_none == 1, cluster(address)
note: _Ivilid_5 omitted because of collinearity
note: _Ivilid_23 omitted because of collinearity
note: _Ivilid_27 omitted because of collinearity

Linear regression                                      Number of obs =    1255
                                                       F( 49,   165) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1537
                                                       Root MSE      =  .27379

                                    (Std. Err. adjusted for 166 clusters in address)
------------------------------------------------------------------------------------
                   |               Robust
     understanding |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
         intensive |   .1967505   .0224734     8.75   0.000      .152378    .2411229
       network_yes |   .1903847   .0220097     8.65   0.000     .1469279    .2338416
inter_inten_netyes |  -.2306416   .0331185    -6.96   0.000    -.2960322    -.165251
              male |   .0382157   .0340698     1.12   0.264    -.0290533    .1054847
               age |  -.0011209   .0007597    -1.48   0.142    -.0026208     .000379
             agpop |   .0009602   .0044209     0.22   0.828    -.0077685     .009689
     ricearea_2010 |   .0000727   .0005619     0.13   0.897    -.0010366    .0011821
          literacy |   .0716029   .0206108     3.47   0.001      .030908    .1122979
       risk_averse |   .0288737   .0267853     1.08   0.283    -.0240125    .0817598
     disaster_prob |    .001951   .0004554     4.28   0.000     .0010518    .0028503
         _Ivilid_2 |  -.1423405   .0409238    -3.48   0.001    -.2231424   -.0615386
         _Ivilid_3 |  -.0455404   .0334861    -1.36   0.176    -.1116568    .0205761
         _Ivilid_4 |   .0218702   .0284712     0.77   0.443    -.0343447    .0780851
         _Ivilid_5 |          0  (omitted)
         _Ivilid_6 |   -.031931   .1224395    -0.26   0.795    -.2736812    .2098192
         _Ivilid_7 |    .009931   .0379536     0.26   0.794    -.0650064    .0848683
         _Ivilid_8 |  -.0070212   .0208561    -0.34   0.737    -.0482005    .0341581
         _Ivilid_9 |   .0414134   .0464149     0.89   0.374    -.0502303    .1330572
        _Ivilid_10 |  -.0122853   .0226667    -0.54   0.589    -.0570395    .0324688
        _Ivilid_11 |   .0032027    .034844     0.09   0.927    -.0655949    .0720004
        _Ivilid_12 |   .0992177   .0396655     2.50   0.013     .0209004     .177535
        _Ivilid_13 |   -.018383   .0452617    -0.41   0.685    -.1077498    .0709838
        _Ivilid_14 |   -.039872   .0131343    -3.04   0.003    -.0658049   -.0139391
        _Ivilid_15 |  -.0736011   .0313856    -2.35   0.020    -.1355703   -.0116319
        _Ivilid_16 |   .1575957   .0123405    12.77   0.000     .1332299    .1819614
        _Ivilid_17 |  -.0787195   .0252081    -3.12   0.002    -.1284914   -.0289475
        _Ivilid_18 |   .0640647   .0266896     2.40   0.017     .0113675    .1167619
        _Ivilid_19 |  -.0679204   .0435255    -1.56   0.121    -.1538592    .0180184
        _Ivilid_20 |   .0470835   .0346581     1.36   0.176    -.0213472    .1155141
        _Ivilid_21 |  -.1493843     .06601    -2.26   0.025    -.2797175   -.0190511
        _Ivilid_22 |   .0771329   .0600659     1.28   0.201     -.041464    .1957299
        _Ivilid_23 |          0  (omitted)
        _Ivilid_24 |   .0540158   .0609898     0.89   0.377    -.0664052    .1744367
        _Ivilid_25 |   .0260586   .0255157     1.02   0.309    -.0243207    .0764379
        _Ivilid_26 |    -.06995   .0250284    -2.79   0.006    -.1193672   -.0205328
        _Ivilid_27 |          0  (omitted)
        _Ivilid_28 |  -.1634048   .0311747    -5.24   0.000    -.2249576    -.101852
        _Ivilid_29 |   -.033006   .0299297    -1.10   0.272    -.0921006    .0260886
        _Ivilid_30 |    -.05648   .0725276    -0.78   0.437    -.1996817    .0867217
        _Ivilid_31 |  -.1104018   .0090958   -12.14   0.000     -.128361   -.0924427
        _Ivilid_32 |  -.1739598   .0645916    -2.69   0.008    -.3014923   -.0464273
        _Ivilid_33 |  -.0481959   .1174146    -0.41   0.682    -.2800246    .1836328
        _Ivilid_34 |  -.0045812   .0934262    -0.05   0.961    -.1890462    .1798838
        _Ivilid_35 |  -.1175944   .0121669    -9.67   0.000    -.1416173   -.0935715
        _Ivilid_36 |  -.0613408   .0381342    -1.61   0.110    -.1366347    .0139531
        _Ivilid_37 |   .0536452   .0237978     2.25   0.025     .0066577    .1006327
        _Ivilid_38 |   .0766364   .0228894     3.35   0.001     .0314426    .1218302
        _Ivilid_39 |  -.0597633   .1177919    -0.51   0.613    -.2923369    .1728103
        _Ivilid_40 |  -.0674662   .0348101    -1.94   0.054     -.136197    .0012645
        _Ivilid_41 |   .0666836   .0236928     2.81   0.005     .0199036    .1134637
        _Ivilid_42 |  -.0079749   .0235342    -0.34   0.735    -.0544418     .038492
        _Ivilid_43 |   .1128352   .0248276     4.54   0.000     .0638144     .161856
        _Ivilid_44 |   .1068189   .0801736     1.33   0.185    -.0514795    .2651174
        _Ivilid_45 |   .0584552   .0401612     1.46   0.147     -.020841    .1377514
        _Ivilid_46 |   .0073733   .0407308     0.18   0.857    -.0730475    .0877942
        _Ivilid_47 |   .0280063    .061577     0.45   0.650    -.0935742    .1495868
             _cons |   .2581552   .0638063     4.05   0.000     .1321731    .3841374
------------------------------------------------------------------------------------

. outreg2 using `outputfile5'
Table5.xls
dir : seeout

. reg understanding network_rate_preintensive male age agpop ricearea_2010 literacy intensive risk_averse
>  disaster_prob _Ivilid* if delay == 1 & info_none == 1, cluster(address)
note: _Ivilid_5 omitted because of collinearity
note: _Ivilid_23 omitted because of collinearity
note: _Ivilid_27 omitted because of collinearity

Linear regression                                      Number of obs =    1255
                                                       F( 48,   165) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1304
                                                       Root MSE      =  .27741

                                           (Std. Err. adjusted for 166 clusters in address)
-------------------------------------------------------------------------------------------
                          |               Robust
            understanding |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
network_rate_preintensive |   .2903382   .0488262     5.95   0.000     .1939336    .3867428
                     male |   .0290795   .0327242     0.89   0.375    -.0355326    .0936916
                      age |  -.0013051   .0007766    -1.68   0.095    -.0028384    .0002282
                    agpop |   .0012814   .0044833     0.29   0.775    -.0075707    .0101334
            ricearea_2010 |   2.31e-06   .0005908     0.00   0.997    -.0011642    .0011688
                 literacy |    .071431   .0211104     3.38   0.001     .0297497    .1131124
                intensive |   .0729582   .0167374     4.36   0.000     .0399111    .1060053
              risk_averse |   .0364176   .0272073     1.34   0.183    -.0173018     .090137
            disaster_prob |   .0019642   .0004552     4.31   0.000     .0010654     .002863
                _Ivilid_2 |  -.1496663   .0336538    -4.45   0.000     -.216114   -.0832186
                _Ivilid_3 |  -.0511716   .0358927    -1.43   0.156    -.1220398    .0196966
                _Ivilid_4 |  -.0090709   .0353649    -0.26   0.798    -.0788969    .0607551
                _Ivilid_5 |          0  (omitted)
                _Ivilid_6 |  -.0612883   .0972199    -0.63   0.529    -.2532437    .1306671
                _Ivilid_7 |  -.0132677   .0359415    -0.37   0.712    -.0842322    .0576967
                _Ivilid_8 |  -.0429605   .0194515    -2.21   0.029    -.0813666   -.0045545
                _Ivilid_9 |   .0349513   .0390137     0.90   0.372    -.0420792    .1119817
               _Ivilid_10 |  -.0458325   .0226062    -2.03   0.044    -.0904672   -.0011977
               _Ivilid_11 |  -.0245752   .0354367    -0.69   0.489    -.0945431    .0453927
               _Ivilid_12 |   .0656666   .0388046     1.69   0.092    -.0109509    .1422841
               _Ivilid_13 |  -.0500875   .0422324    -1.19   0.237     -.133473     .033298
               _Ivilid_14 |  -.0578346   .0142843    -4.05   0.000    -.0860382    -.029631
               _Ivilid_15 |  -.1071957   .0307329    -3.49   0.001    -.1678761   -.0465153
               _Ivilid_16 |   .1573139   .0125889    12.50   0.000     .1324577      .18217
               _Ivilid_17 |  -.1075669   .0278736    -3.86   0.000    -.1626017    -.052532
               _Ivilid_18 |   .0218645   .0135776     1.61   0.109    -.0049439    .0486728
               _Ivilid_19 |  -.0988364   .0461886    -2.14   0.034    -.1900332   -.0076396
               _Ivilid_20 |    .034811   .0367139     0.95   0.344    -.0376786    .1073006
               _Ivilid_21 |  -.1658965   .0630501    -2.63   0.009    -.2903855   -.0414074
               _Ivilid_22 |   .0604162   .0762553     0.79   0.429    -.0901456    .2109781
               _Ivilid_23 |          0  (omitted)
               _Ivilid_24 |   .0069316   .0626602     0.11   0.912    -.1167876    .1306508
               _Ivilid_25 |   .0119958   .0291735     0.41   0.681    -.0456057    .0695973
               _Ivilid_26 |  -.1091171   .0255342    -4.27   0.000    -.1595329   -.0587012
               _Ivilid_27 |          0  (omitted)
               _Ivilid_28 |  -.1861002   .0385882    -4.82   0.000    -.2622905     -.10991
               _Ivilid_29 |  -.0435741   .0323595    -1.35   0.180    -.1074661    .0203179
               _Ivilid_30 |  -.0687948   .0818348    -0.84   0.402    -.2303733    .0927836
               _Ivilid_31 |  -.1242622   .0093196   -13.33   0.000    -.1426631   -.1058612
               _Ivilid_32 |  -.2010838   .0560399    -3.59   0.000    -.3117315   -.0904362
               _Ivilid_33 |  -.0893459    .098553    -0.91   0.366    -.2839334    .1052415
               _Ivilid_34 |  -.0030132    .088781    -0.03   0.973    -.1783064      .17228
               _Ivilid_35 |  -.1420203    .011354   -12.51   0.000    -.1644383   -.1196024
               _Ivilid_36 |   -.098232   .0551381    -1.78   0.077    -.2070992    .0106352
               _Ivilid_37 |   .0344963   .0191146     1.80   0.073    -.0032445    .0722371
               _Ivilid_38 |   .0284236    .007614     3.73   0.000     .0133902     .043457
               _Ivilid_39 |   -.077207   .0831221    -0.93   0.354    -.2413271    .0869131
               _Ivilid_40 |  -.0915266   .0394006    -2.32   0.021    -.1693209   -.0137323
               _Ivilid_41 |   .0413234   .0280541     1.47   0.143     -.014068    .0967147
               _Ivilid_42 |  -.0302447   .0261189    -1.16   0.249    -.0818151    .0213257
               _Ivilid_43 |   .1239638   .0207662     5.97   0.000     .0829621    .1649655
               _Ivilid_44 |   .1008287   .0762257     1.32   0.188    -.0496747    .2513322
               _Ivilid_45 |   .0472542   .0370805     1.27   0.204    -.0259591    .1204676
               _Ivilid_46 |  -.0047816   .0468655    -0.10   0.919     -.097315    .0877518
               _Ivilid_47 |   .0109866   .0619094     0.18   0.859    -.1112502    .1332234
                    _cons |   .3544897   .0614765     5.77   0.000     .2331077    .4758718
-------------------------------------------------------------------------------------------

. outreg2 using `outputfile5'
Table5.xls
dir : seeout

. ivreg understanding (knowledge_network=network_rate_preintensive) male age agpop ricearea_2010 literacy
>  intensive risk_averse disaster_prob _Ivilid* if delay == 1 & info_none == 1, cluster(address)

Instrumental variables (2SLS) regression               Number of obs =     958
                                                       F( 48,   164) =       .
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0522
                                                       Root MSE      =  .29059

                                   (Std. Err. adjusted for 165 clusters in address)
-----------------------------------------------------------------------------------
                  |               Robust
    understanding |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
knowledge_network |   .4142141   .0799105     5.18   0.000     .2564281    .5720001
             male |   .0926473    .038099     2.43   0.016     .0174195    .1678751
              age |  -.0010965   .0009092    -1.21   0.230    -.0028917    .0006987
            agpop |   .0036102   .0050998     0.71   0.480    -.0064595      .01368
    ricearea_2010 |  -.0004572   .0007345    -0.62   0.535    -.0019075    .0009932
         literacy |   .0756161   .0253506     2.98   0.003     .0255606    .1256717
        intensive |   .0404118   .0192068     2.10   0.037     .0024874    .0783363
      risk_averse |   .0251728   .0344086     0.73   0.465    -.0427681    .0931137
    disaster_prob |   .0011876   .0005732     2.07   0.040     .0000558    .0023195
        _Ivilid_2 |  -.0036559   .1149433    -0.03   0.975    -.2306155    .2233036
        _Ivilid_3 |   .1350018   .0172358     7.83   0.000     .1009691    .1690345
        _Ivilid_4 |    .144144   .0338563     4.26   0.000     .0772935    .2109944
        _Ivilid_5 |          0  (omitted)
        _Ivilid_6 |   .1875004     .12018     1.56   0.121     -.049799    .4247999
        _Ivilid_7 |   .1839706   .0396916     4.64   0.000     .1055982    .2623431
        _Ivilid_8 |   .1188897   .0140457     8.46   0.000      .091156    .1466234
        _Ivilid_9 |   .1541683   .0666336     2.31   0.022      .022598    .2857385
       _Ivilid_10 |   .1256239    .062474     2.01   0.046     .0022669     .248981
       _Ivilid_11 |   .1580363   .0486468     3.25   0.001     .0619816    .2540911
       _Ivilid_12 |   .3109792   .0530854     5.86   0.000     .2061603    .4157982
       _Ivilid_13 |   .1875435   .0503123     3.73   0.000     .0882002    .2868868
       _Ivilid_14 |    .105613   .0248652     4.25   0.000     .0565159    .1547101
       _Ivilid_15 |  -.0679723    .028535    -2.38   0.018    -.1243157    -.011629
       _Ivilid_16 |   .2164512   .0218447     9.91   0.000     .1733181    .2595843
       _Ivilid_17 |   .0598918   .0418301     1.43   0.154    -.0227031    .1424868
       _Ivilid_18 |   .0960517   .0235171     4.08   0.000     .0496164    .1424871
       _Ivilid_19 |   .0955894   .0518025     1.85   0.067    -.0066965    .1978754
       _Ivilid_20 |   .2041884   .0452011     4.52   0.000     .1149374    .2934395
       _Ivilid_21 |  -.0067514   .0565229    -0.12   0.905    -.1183579     .104855
       _Ivilid_22 |   .2588701   .0700006     3.70   0.000     .1206515    .3970888
       _Ivilid_23 |          0  (omitted)
       _Ivilid_24 |   .2142168   .0953896     2.25   0.026     .0258668    .4025669
       _Ivilid_25 |   .1744753   .0361678     4.82   0.000     .1030607    .2458899
       _Ivilid_26 |   .0462165   .0616641     0.75   0.455    -.0755413    .1679744
       _Ivilid_27 |          0  (omitted)
       _Ivilid_28 |   .0404364   .0248152     1.63   0.105    -.0085619    .0894348
       _Ivilid_29 |   .1269741   .0342276     3.71   0.000     .0593906    .1945576
       _Ivilid_30 |    .302618   .0870579     3.48   0.001     .1307192    .4745167
       _Ivilid_31 |   .1387405    .017836     7.78   0.000     .1035227    .1739583
       _Ivilid_32 |  -.0050891   .0992446    -0.05   0.959    -.2010509    .1908727
       _Ivilid_33 |   .0388109   .1832782     0.21   0.833    -.3230782       .4007
       _Ivilid_34 |   .2230842   .0666651     3.35   0.001     .0914516    .3547167
       _Ivilid_35 |    .087849   .0190938     4.60   0.000     .0501476    .1255504
       _Ivilid_36 |   .0449636   .0593481     0.76   0.450    -.0722212    .1621485
       _Ivilid_37 |   .2086375   .0315437     6.61   0.000     .1463533    .2709217
       _Ivilid_38 |   .1728868    .028281     6.11   0.000     .1170449    .2287287
       _Ivilid_39 |   .0558255   .0642071     0.87   0.386    -.0709536    .1826046
       _Ivilid_40 |   .0864451   .0522078     1.66   0.100     -.016641    .1895313
       _Ivilid_41 |   .2446357   .0242216    10.10   0.000     .1968093    .2924621
       _Ivilid_42 |   .1138086   .0307432     3.70   0.000     .0531051     .174512
       _Ivilid_43 |   .2677333   .0195637    13.69   0.000     .2291042    .3063625
       _Ivilid_44 |    .230009   .0777591     2.96   0.004     .0764709     .383547
       _Ivilid_45 |   .1584642   .0524315     3.02   0.003     .0549364     .261992
       _Ivilid_46 |   .1044761   .0705366     1.48   0.140    -.0348008    .2437531
       _Ivilid_47 |   .1565155   .0484449     3.23   0.001     .0608594    .2521717
            _cons |   .0150651   .0809794     0.19   0.853    -.1448315    .1749616
-----------------------------------------------------------------------------------
Instrumented:  knowledge_network
Instruments:   male age agpop ricearea_2010 literacy intensive risk_averse
               disaster_prob _Ivilid_2 _Ivilid_3 _Ivilid_4 _Ivilid_5 _Ivilid_6
               _Ivilid_7 _Ivilid_8 _Ivilid_9 _Ivilid_10 _Ivilid_11 _Ivilid_12
               _Ivilid_13 _Ivilid_14 _Ivilid_15 _Ivilid_16 _Ivilid_17 _Ivilid_18
               _Ivilid_19 _Ivilid_20 _Ivilid_21 _Ivilid_22 _Ivilid_23 _Ivilid_24
               _Ivilid_25 _Ivilid_26 _Ivilid_27 _Ivilid_28 _Ivilid_29 _Ivilid_30
               _Ivilid_31 _Ivilid_32 _Ivilid_33 _Ivilid_34 _Ivilid_35 _Ivilid_36
               _Ivilid_37 _Ivilid_38 _Ivilid_39 _Ivilid_40 _Ivilid_41 _Ivilid_42
               _Ivilid_43 _Ivilid_44 _Ivilid_45 _Ivilid_46 _Ivilid_47
               network_rate_preintensive
-----------------------------------------------------------------------------------

. outreg2 using `outputfile5'
Table5.xls
dir : seeout

. 
. 
. **********************************************************6. Effect of default*************************
> ***********************************
. *6.1 Table A5: characteristics of insurance takers by default option
. preserve

. keep if takeup_survey == 1 & delay == 0
(3970 observations deleted)

. foreach x in male age agpop ricearea_2010 literacy general_trust understanding disaster_prob reveal{
  2.    ttest `x', by(default)
  3. }

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     391    .9028133    .0149993    .2965913    .8733238    .9323028
       1 |     541    .9297597    .0109972    .2557881    .9081572    .9513622
---------+--------------------------------------------------------------------
combined |     932    .9184549    .0089692    .2738173    .9008528    .9360571
---------+--------------------------------------------------------------------
    diff |           -.0269464    .0181636               -.0625928       .0087
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -1.4835
Ho: diff = 0                                     degrees of freedom =      930

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0691         Pr(|T| > |t|) = 0.1383          Pr(T > t) = 0.9309

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     391    51.58824    .5894158    11.65494    50.42941    52.74707
       1 |     539     51.2115    .4964436    11.52562     50.2363    52.18671
---------+--------------------------------------------------------------------
combined |     930    51.36989    .3795726    11.57541    50.62497    52.11481
---------+--------------------------------------------------------------------
    diff |            .3767325    .7692593               -1.132957    1.886422
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.4897
Ho: diff = 0                                     degrees of freedom =      928

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.6878         Pr(|T| > |t|) = 0.6244          Pr(T > t) = 0.3122

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     391    4.667519    .0920036    1.819254    4.486634    4.848404
       1 |     541    5.053604    .0854565    1.987668    4.885736    5.221472
---------+--------------------------------------------------------------------
combined |     932    4.891631    .0631296    1.927263    4.767738    5.015524
---------+--------------------------------------------------------------------
    diff |           -.3860853     .127368               -.6360473   -.1361232
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -3.0313
Ho: diff = 0                                     degrees of freedom =      930

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0013         Pr(|T| > |t|) = 0.0025          Pr(T > t) = 0.9987

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     391    15.10041    1.151446    22.76838    12.83659    17.36423
       1 |     540    14.91324    .7073679    16.43774     13.5237    16.30278
---------+--------------------------------------------------------------------
combined |     931    14.99185    .6338137    19.33911    13.74798    16.23572
---------+--------------------------------------------------------------------
    diff |            .1871685    1.284857                -2.33439    2.708726
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.1457
Ho: diff = 0                                     degrees of freedom =      929

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.5579         Pr(|T| > |t|) = 0.8842          Pr(T > t) = 0.4421

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     388    .8247423     .019326    .3806783    .7867451    .8627394
       1 |     536    .7966418    .0174015    .4028728    .7624582    .8308253
---------+--------------------------------------------------------------------
combined |     924    .8084416    .0129531    .3937405    .7830206    .8338625
---------+--------------------------------------------------------------------
    diff |            .0281005     .026243               -.0234025    .0796034
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.0708
Ho: diff = 0                                     degrees of freedom =      922

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8577         Pr(|T| > |t|) = 0.2845          Pr(T > t) = 0.1423

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     391    .8695652    .0170536    .3372127    .8360368    .9030937
       1 |     541      .87061    .0144433    .3359417    .8422381    .8989818
---------+--------------------------------------------------------------------
combined |     932    .8701717    .0110157    .3362949    .8485532    .8917902
---------+--------------------------------------------------------------------
    diff |           -.0010448    .0223344               -.0448764    .0427869
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.0468
Ho: diff = 0                                     degrees of freedom =      930

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.4813         Pr(|T| > |t|) = 0.9627          Pr(T > t) = 0.5187

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     388    .5185567     .014938    .2942445    .4891869    .5479265
       1 |     521    .4664108    .0135174    .3085393    .4398554    .4929661
---------+--------------------------------------------------------------------
combined |     909    .4886689     .010065    .3034553    .4689156    .5084222
---------+--------------------------------------------------------------------
    diff |             .052146    .0202864                .0123322    .0919597
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   2.5705
Ho: diff = 0                                     degrees of freedom =      907

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9948         Pr(|T| > |t|) = 0.0103          Pr(T > t) = 0.0052

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     391    32.98977    .8876192    17.55153    31.24465    34.73489
       1 |     541    34.51941    .7213244    16.77758    33.10246    35.93635
---------+--------------------------------------------------------------------
combined |     932    33.87768     .560584    17.11389    32.77753    34.97784
---------+--------------------------------------------------------------------
    diff |           -1.529639     1.13548                -3.75804    .6987622
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -1.3471
Ho: diff = 0                                     degrees of freedom =      930

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0891         Pr(|T| > |t|) = 0.1783          Pr(T > t) = 0.9109

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     375        .104    .0157846    .3056684    .0729622    .1350378
       1 |     507     .122288    .0145644    .3279417    .0936738    .1509021
---------+--------------------------------------------------------------------
combined |     882    .1145125    .0107283    .3186133    .0934565    .1355684
---------+--------------------------------------------------------------------
    diff |            -.018288    .0217045               -.0608866    .0243107
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.8426
Ho: diff = 0                                     degrees of freedom =      880

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.1998         Pr(|T| > |t|) = 0.3997          Pr(T > t) = 0.8002

. restore

. 
. *6.2 Table 6, column 1: Default effect
. local outputfile6 Table6.xls

. reg takeup_survey default male age agpop ricearea_2010 literacy intensive risk_averse disaster_prob _Iv
> ilid* if delay == 0, cluster(address)

Linear regression                                      Number of obs =    2137
                                                       F( 51,   172) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1372
                                                       Root MSE      =  .46614

                               (Std. Err. adjusted for 173 clusters in address)
-------------------------------------------------------------------------------
              |               Robust
takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      default |   .1243839    .032762     3.80   0.000     .0597166    .1890512
         male |    .028585    .048169     0.59   0.554    -.0664935    .1236636
          age |   .0018687   .0010612     1.76   0.080     -.000226    .0039633
        agpop |  -.0029394    .005198    -0.57   0.572    -.0131996    .0073208
ricearea_2010 |   .0006926   .0007484     0.93   0.356    -.0007847    .0021699
     literacy |   .0896239   .0262525     3.41   0.001     .0378053    .1414425
    intensive |   .1417409   .0260352     5.44   0.000     .0903512    .1931306
  risk_averse |   .0069645   .0359764     0.19   0.847    -.0640477    .0779766
disaster_prob |  -.0000193    .000649    -0.03   0.976    -.0013003    .0012618
    _Ivilid_2 |  -.3590474   .1493533    -2.40   0.017    -.6538486   -.0642461
    _Ivilid_3 |  -.1647613   .0255951    -6.44   0.000    -.2152822   -.1142404
    _Ivilid_4 |  -.1852111   .0793039    -2.34   0.021    -.3417453    -.028677
    _Ivilid_5 |  -.1060449    .109587    -0.97   0.335    -.3223535    .1102637
    _Ivilid_6 |   .2308263   .0320306     7.21   0.000     .1676027    .2940499
    _Ivilid_7 |  -.1951692   .0506874    -3.85   0.000    -.2952187   -.0951197
    _Ivilid_8 |  -.1622669   .1186323    -1.37   0.173    -.3964295    .0718957
    _Ivilid_9 |  -.1942772   .0771265    -2.52   0.013    -.3465135   -.0420408
   _Ivilid_10 |  -.1626648   .1224894    -1.33   0.186    -.4044408    .0791112
   _Ivilid_11 |  -.1017585   .0883103    -1.15   0.251      -.27607     .072553
   _Ivilid_12 |    .038015   .0981211     0.39   0.699    -.1556615    .2316915
   _Ivilid_13 |    .025383    .087472     0.29   0.772    -.1472737    .1980398
   _Ivilid_14 |  -.0817437   .1202776    -0.68   0.498    -.3191539    .1556666
   _Ivilid_15 |   .1918201   .0352066     5.45   0.000     .1223274    .2613128
   _Ivilid_16 |  -.3792881   .0346022   -10.96   0.000    -.4475878   -.3109884
   _Ivilid_17 |  -.2975791   .0742166    -4.01   0.000    -.4440717   -.1510864
   _Ivilid_18 |  -.0047348   .1044188    -0.05   0.964    -.2108421    .2013725
   _Ivilid_19 |  -.2199406   .0646004    -3.40   0.001    -.3474521    -.092429
   _Ivilid_20 |  -.0817622   .1111973    -0.74   0.463    -.3012493    .1377248
   _Ivilid_21 |  -.1432112    .071658    -2.00   0.047    -.2846536   -.0017689
   _Ivilid_22 |  -.2366445   .1609077    -1.47   0.143    -.5542526    .0809636
   _Ivilid_23 |  -.1346251   .1121126    -1.20   0.231    -.3559187    .0866685
   _Ivilid_24 |  -.0648137   .0454598    -1.43   0.156    -.1545446    .0249172
   _Ivilid_25 |   .1115678   .0724057     1.54   0.125    -.0313504     .254486
   _Ivilid_26 |   .1797129   .0888549     2.02   0.045     .0043263    .3550994
   _Ivilid_27 |  -.1386769   .0555941    -2.49   0.014    -.2484114   -.0289425
   _Ivilid_28 |   .1284964   .0825097     1.56   0.121    -.0343656    .2913585
   _Ivilid_29 |  -.3357545   .0665809    -5.04   0.000    -.4671753   -.2043336
   _Ivilid_30 |  -.2105228     .07387    -2.85   0.005    -.3563312   -.0647144
   _Ivilid_31 |   .0897129    .020359     4.41   0.000     .0495272    .1298987
   _Ivilid_32 |   .2984204   .0682726     4.37   0.000     .1636604    .4331803
   _Ivilid_33 |   .1707936   .0981182     1.74   0.084    -.0228773    .3644645
   _Ivilid_34 |  -.1922728    .178607    -1.08   0.283    -.5448166     .160271
   _Ivilid_35 |  -.1752673   .0151184   -11.59   0.000    -.2051087   -.1454259
   _Ivilid_36 |  -.1064176   .0435588    -2.44   0.016    -.1923962   -.0204391
   _Ivilid_37 |  -.2444187   .0851272    -2.87   0.005    -.4124471   -.0763903
   _Ivilid_38 |   .0562957   .0295849     1.90   0.059    -.0021006     .114692
   _Ivilid_39 |  -.3819729   .0685508    -5.57   0.000     -.517282   -.2466638
   _Ivilid_40 |  -.0527916   .0991234    -0.53   0.595    -.2484465    .1428634
   _Ivilid_41 |  -.0959608    .025922    -3.70   0.000    -.1471269   -.0447946
   _Ivilid_42 |  -.3260689   .0430074    -7.58   0.000    -.4109591   -.2411786
   _Ivilid_43 |  -.0489877   .0517371    -0.95   0.345    -.1511092    .0531337
   _Ivilid_44 |  -.4053919   .0869937    -4.66   0.000    -.5771047   -.2336792
   _Ivilid_45 |   .0380435   .1096675     0.35   0.729    -.1784239    .2545109
   _Ivilid_46 |  -.2463831     .05788    -4.26   0.000    -.3606296   -.1321366
   _Ivilid_47 |  -.1869839   .1143337    -1.64   0.104    -.4126617    .0386939
        _cons |   .2425267   .0916635     2.65   0.009     .0615965    .4234569
-------------------------------------------------------------------------------

. outreg2 using `outputfile6'
Table6.xls
dir : seeout

. 
. *6.3 Table A4, check heterogeneity of the default effect
. gen inter_default_network = network_rate_preintensive*default
(314 missing values generated)

. gen inter_default_intensive = intensive*default

. gen inter_default_trust = default*general_trust 

. 
. local outputfile62 TableA4.xls

. reg takeup_survey network_rate_preintensive default inter_default_network intensive male age agpop rice
> area_2010 literacy risk_averse disaster_prob friend* _Ivilid* if delay == 1 & info_none == 1, cluster(a
> ddress)
note: friend1 omitted because of collinearity
note: friend2 omitted because of collinearity
note: _Ivilid_5 omitted because of collinearity
note: _Ivilid_23 omitted because of collinearity
note: _Ivilid_27 omitted because of collinearity

Linear regression                                      Number of obs =    1255
                                                       F( 53,   165) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1193
                                                       Root MSE      =  .47629

                                           (Std. Err. adjusted for 166 clusters in address)
-------------------------------------------------------------------------------------------
                          |               Robust
            takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
network_rate_preintensive |   .2857227    .120996     2.36   0.019     .0468225    .5246228
                  default |    .001864   .0445645     0.04   0.967    -.0861261    .0898542
    inter_default_network |   .0104731   .1581715     0.07   0.947     -.301828    .3227741
                intensive |   .0298385   .0332512     0.90   0.371    -.0358142    .0954912
                     male |   .0158794   .0743393     0.21   0.831    -.1308995    .1626584
                      age |   .0044935   .0012094     3.72   0.000     .0021055    .0068814
                    agpop |  -.0101475   .0068856    -1.47   0.142    -.0237427    .0034477
            ricearea_2010 |     .00431   .0010242     4.21   0.000     .0022877    .0063322
                 literacy |   .0873106    .032675     2.67   0.008     .0227954    .1518257
              risk_averse |   .1092659   .0490556     2.23   0.027     .0124083    .2061234
            disaster_prob |   .0019385   .0008043     2.41   0.017     .0003506    .0035265
                  friend1 |          0  (omitted)
                  friend2 |          0  (omitted)
                  friend3 |    .121363   .2243501     0.54   0.589     -.321604      .56433
                  friend4 |   .1815004   .1298234     1.40   0.164    -.0748288    .4378297
                  friend5 |    .320191   .0655962     4.88   0.000      .190675    .4497071
                _Ivilid_2 |  -.4644817   .1463096    -3.17   0.002    -.7533621   -.1756013
                _Ivilid_3 |  -.3019909   .0707681    -4.27   0.000    -.4417187   -.1622631
                _Ivilid_4 |  -.1599565   .0601712    -2.66   0.009    -.2787613   -.0411516
                _Ivilid_5 |          0  (omitted)
                _Ivilid_6 |   .0525148    .149422     0.35   0.726    -.2425108    .3475404
                _Ivilid_7 |  -.1316769   .0711559    -1.85   0.066    -.2721703    .0088166
                _Ivilid_8 |  -.0979032   .0814388    -1.20   0.231    -.2586998    .0628934
                _Ivilid_9 |  -.2155066   .1407087    -1.53   0.128    -.4933282    .0623151
               _Ivilid_10 |   -.130323   .0838745    -1.55   0.122    -.2959287    .0352826
               _Ivilid_11 |  -.2104559   .0713643    -2.95   0.004    -.3513608    -.069551
               _Ivilid_12 |  -.0188725   .1047583    -0.18   0.857    -.2257121     .187967
               _Ivilid_13 |  -.0545371   .0656279    -0.83   0.407    -.1841157    .0750415
               _Ivilid_14 |  -.3011927   .0838879    -3.59   0.000    -.4668248   -.1355606
               _Ivilid_15 |   .1240893   .1071344     1.16   0.248    -.0874418    .3356204
               _Ivilid_16 |   -.023496    .023082    -1.02   0.310    -.0690702    .0220782
               _Ivilid_17 |  -.3067602   .0643031    -4.77   0.000    -.4337231   -.1797973
               _Ivilid_18 |  -.0619322   .1711873    -0.36   0.718    -.3999323    .2760679
               _Ivilid_19 |  -.3415037   .0786288    -4.34   0.000     -.496752   -.1862554
               _Ivilid_20 |  -.0385332   .0919436    -0.42   0.676    -.2200707    .1430044
               _Ivilid_21 |  -.2562249   .0792497    -3.23   0.001    -.4126992   -.0997506
               _Ivilid_22 |  -.1927925    .115842    -1.66   0.098    -.4215162    .0359311
               _Ivilid_23 |          0  (omitted)
               _Ivilid_24 |  -.1032104    .134473    -0.77   0.444      -.36872    .1622992
               _Ivilid_25 |   .1115745   .1560878     0.71   0.476    -.1966124    .4197613
               _Ivilid_26 |  -.1327074   .0371657    -3.57   0.000     -.206089   -.0593257
               _Ivilid_27 |          0  (omitted)
               _Ivilid_28 |  -.0421291   .0825806    -0.51   0.611      -.20518    .1209218
               _Ivilid_29 |  -.3294121   .0861183    -3.83   0.000    -.4994481   -.1593761
               _Ivilid_30 |  -.2308604   .1475992    -1.56   0.120     -.522287    .0605661
               _Ivilid_31 |  -.2032892    .036697    -5.54   0.000    -.2757454    -.130833
               _Ivilid_32 |   .0683371    .086731     0.79   0.432    -.1029084    .2395827
               _Ivilid_33 |  -.0334614   .0428847    -0.78   0.436    -.1181348    .0512121
               _Ivilid_34 |  -.0472809   .2114984    -0.22   0.823     -.464873    .3703113
               _Ivilid_35 |  -.3774772   .0384674    -9.81   0.000     -.453429   -.3015254
               _Ivilid_36 |  -.3615604    .100846    -3.59   0.000    -.5606753   -.1624455
               _Ivilid_37 |  -.1795668   .0333121    -5.39   0.000    -.2453397   -.1137939
               _Ivilid_38 |  -.1320742   .1983538    -0.67   0.506     -.523713    .2595647
               _Ivilid_39 |  -.1400324   .1354268    -1.03   0.303    -.4074253    .1273604
               _Ivilid_40 |  -.2860375   .1528591    -1.87   0.063    -.5878496    .0157746
               _Ivilid_41 |  -.1788241   .1023797    -1.75   0.083    -.3809672    .0233191
               _Ivilid_42 |  -.2875515    .047483    -6.06   0.000    -.3813041   -.1937989
               _Ivilid_43 |   .4215018    .030245    13.94   0.000     .3617847    .4812188
               _Ivilid_44 |  -.1126001   .1161175    -0.97   0.334    -.3418679    .1166677
               _Ivilid_45 |   .0754112    .090904     0.83   0.408    -.1040738    .2548961
               _Ivilid_46 |  -.2960474   .0381301    -7.76   0.000    -.3713331   -.2207616
               _Ivilid_47 |   -.264647   .0694018    -3.81   0.000     -.401677   -.1276169
                    _cons |   -.165944   .1069267    -1.55   0.123    -.3770649    .0451769
-------------------------------------------------------------------------------------------

. outreg2 using `outputfile62'
TableA4.xls
dir : seeout

. test network_rate_preintensive inter_default_network

 ( 1)  network_rate_preintensive = 0
 ( 2)  inter_default_network = 0

       F(  2,   165) =    6.36
            Prob > F =    0.0022

. test default inter_default_network

 ( 1)  default = 0
 ( 2)  inter_default_network = 0

       F(  2,   165) =    0.01
            Prob > F =    0.9912

. reg takeup_survey default inter_default_intensive male age agpop ricearea_2010 literacy intensive _Ivil
> id* if delay == 0, cluster(address)

Linear regression                                      Number of obs =    2137
                                                       F( 50,   172) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1398
                                                       Root MSE      =  .46533

                                         (Std. Err. adjusted for 173 clusters in address)
-----------------------------------------------------------------------------------------
                        |               Robust
          takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
                default |   .1752462   .0425045     4.12   0.000     .0913487    .2591438
inter_default_intensive |  -.1011173    .052051    -1.94   0.054    -.2038583    .0016237
                   male |   .0310292   .0481973     0.64   0.521    -.0641052    .1261636
                    age |   .0018305   .0010622     1.72   0.087    -.0002662    .0039272
                  agpop |  -.0035107   .0052097    -0.67   0.501    -.0137937    .0067724
          ricearea_2010 |   .0006934   .0007274     0.95   0.342    -.0007424    .0021291
               literacy |   .0885179   .0263211     3.36   0.001     .0365638    .1404719
              intensive |   .1910981   .0359503     5.32   0.000     .1201375    .2620587
              _Ivilid_2 |  -.3625144   .1524771    -2.38   0.019    -.6634817   -.0615472
              _Ivilid_3 |  -.1618092   .0253766    -6.38   0.000    -.2118988   -.1117196
              _Ivilid_4 |  -.1817259   .0799558    -2.27   0.024    -.3395469    -.023905
              _Ivilid_5 |  -.1066286   .1074738    -0.99   0.323    -.3187659    .1055087
              _Ivilid_6 |   .2330021   .0261209     8.92   0.000     .1814433     .284561
              _Ivilid_7 |  -.1897509   .0500731    -3.79   0.000    -.2885877   -.0909141
              _Ivilid_8 |  -.1588253     .11971    -1.33   0.186    -.3951152    .0774646
              _Ivilid_9 |  -.1927931   .0770569    -2.50   0.013     -.344892   -.0406942
             _Ivilid_10 |  -.1618003   .1192457    -1.36   0.177    -.3971737    .0735731
             _Ivilid_11 |    -.09721   .0890247    -1.09   0.276    -.2729316    .0785117
             _Ivilid_12 |    .043284   .0974783     0.44   0.658    -.1491237    .2356917
             _Ivilid_13 |   .0312008    .087287     0.36   0.721    -.1410909    .2034924
             _Ivilid_14 |  -.0764918   .1200358    -0.64   0.525    -.3134246    .1604411
             _Ivilid_15 |   .1969943   .0337545     5.84   0.000     .1303679    .2636207
             _Ivilid_16 |   -.373447   .0335252   -11.14   0.000    -.4396208   -.3072733
             _Ivilid_17 |  -.2937173   .0731266    -4.02   0.000    -.4380584   -.1493761
             _Ivilid_18 |   -.005512   .1059332    -0.05   0.959    -.2146085    .2035844
             _Ivilid_19 |  -.2159408   .0645805    -3.34   0.001    -.3434131   -.0884685
             _Ivilid_20 |  -.0773784   .1103043    -0.70   0.484    -.2951028    .1403461
             _Ivilid_21 |  -.1394027   .0706607    -1.97   0.050    -.2788764    .0000711
             _Ivilid_22 |  -.2286915   .1605209    -1.42   0.156    -.5455361    .0881531
             _Ivilid_23 |  -.1290822   .1116142    -1.16   0.249    -.3493921    .0912278
             _Ivilid_24 |  -.0617149   .0452063    -1.37   0.174    -.1509456    .0275157
             _Ivilid_25 |   .1151719   .0720044     1.60   0.112    -.0269542     .257298
             _Ivilid_26 |   .1846381   .0865984     2.13   0.034     .0137057    .3555705
             _Ivilid_27 |  -.1373903   .0571321    -2.40   0.017    -.2501608   -.0246199
             _Ivilid_28 |   .1309475   .0821989     1.59   0.113     -.031301     .293196
             _Ivilid_29 |  -.3329776   .0632683    -5.26   0.000    -.4578599   -.2080952
             _Ivilid_30 |  -.2073963   .0723234    -2.87   0.005     -.350152   -.0646405
             _Ivilid_31 |   .0979881   .0183398     5.34   0.000     .0617882    .1341881
             _Ivilid_32 |   .2959979   .0714387     4.14   0.000     .1549885    .4370072
             _Ivilid_33 |    .175473   .0971692     1.81   0.073    -.0163246    .3672705
             _Ivilid_34 |  -.1867595   .1804044    -1.04   0.302     -.542851    .1693321
             _Ivilid_35 |  -.1645598   .0147522   -11.15   0.000    -.1936785   -.1354412
             _Ivilid_36 |   -.105109   .0414531    -2.54   0.012    -.1869312   -.0232868
             _Ivilid_37 |  -.2397935   .0846674    -2.83   0.005    -.4069145   -.0726725
             _Ivilid_38 |   .0584074   .0277084     2.11   0.036      .003715    .1130997
             _Ivilid_39 |  -.3812843   .0700893    -5.44   0.000    -.5196302   -.2429384
             _Ivilid_40 |  -.0478473   .0982041    -0.49   0.627    -.2416877    .1459931
             _Ivilid_41 |   -.092763   .0233424    -3.97   0.000    -.1388375   -.0466885
             _Ivilid_42 |  -.3216566   .0400229    -8.04   0.000    -.4006559   -.2426573
             _Ivilid_43 |  -.0433504    .051424    -0.84   0.400    -.1448538    .0581529
             _Ivilid_44 |  -.4003049   .0872912    -4.59   0.000    -.5726048   -.2280049
             _Ivilid_45 |   .0401259   .1095602     0.37   0.715    -.1761297    .2563815
             _Ivilid_46 |  -.2430592   .0571926    -4.25   0.000     -.355949   -.1301695
             _Ivilid_47 |  -.1813113   .1143419    -1.59   0.115    -.4070053    .0443828
                  _cons |   .2181078   .0889461     2.45   0.015     .0425414    .3936743
-----------------------------------------------------------------------------------------

. test default inter_default_intensive

 ( 1)  default = 0
 ( 2)  inter_default_intensive = 0

       F(  2,   172) =    8.87
            Prob > F =    0.0002

. test intensive inter_default_intensive

 ( 1)  intensive = 0
 ( 2)  inter_default_intensive = 0

       F(  2,   172) =   17.03
            Prob > F =    0.0000

. outreg2 using `outputfile62'
TableA4.xls
dir : seeout

. reg takeup_survey default inter_default_trust general_trust male age agpop ricearea_2010 literacy inten
> sive _Ivilid* if delay == 0, cluster(address)

Linear regression                                      Number of obs =    2137
                                                       F( 51,   172) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1373
                                                       Root MSE      =  .46611

                                     (Std. Err. adjusted for 173 clusters in address)
-------------------------------------------------------------------------------------
                    |               Robust
      takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
            default |   .1123922   .0655102     1.72   0.088    -.0169153    .2416997
inter_default_trust |   .0135719   .0661753     0.21   0.838    -.1170484    .1441922
      general_trust |    .008877   .0406929     0.22   0.828    -.0714448    .0891988
               male |   .0295999    .048201     0.61   0.540    -.0655417    .1247415
                age |   .0018155    .001062     1.71   0.089    -.0002806    .0039117
              agpop |  -.0029694   .0051943    -0.57   0.568    -.0132222    .0072833
      ricearea_2010 |   .0006914   .0007486     0.92   0.357    -.0007863     .002169
           literacy |   .0894993   .0261268     3.43   0.001     .0379289    .1410697
          intensive |   .1418383   .0259915     5.46   0.000     .0905349    .1931416
          _Ivilid_2 |  -.3623041   .1497782    -2.42   0.017    -.6579441   -.0666641
          _Ivilid_3 |  -.1651157   .0236094    -6.99   0.000    -.2117172   -.1185143
          _Ivilid_4 |  -.1842367   .0797796    -2.31   0.022    -.3417098   -.0267635
          _Ivilid_5 |  -.1048303   .1126599    -0.93   0.353    -.3272043    .1175436
          _Ivilid_6 |   .2323567   .0278595     8.34   0.000     .1773662    .2873472
          _Ivilid_7 |  -.1962226   .0497687    -3.94   0.000    -.2944585   -.0979866
          _Ivilid_8 |  -.1643943   .1189686    -1.38   0.169    -.3992208    .0704323
          _Ivilid_9 |  -.1944066   .0766749    -2.54   0.012    -.3457515   -.0430617
         _Ivilid_10 |  -.1623291   .1199325    -1.35   0.178    -.3990582       .0744
         _Ivilid_11 |  -.1012882   .0890109    -1.14   0.257    -.2769825    .0744061
         _Ivilid_12 |   .0413616   .0972978     0.43   0.671    -.1506898    .2334131
         _Ivilid_13 |   .0246792   .0882601     0.28   0.780    -.1495332    .1988915
         _Ivilid_14 |  -.0831536   .1196082    -0.70   0.488    -.3192426    .1529353
         _Ivilid_15 |   .1924645   .0363836     5.29   0.000     .1206487    .2642804
         _Ivilid_16 |  -.3794879   .0333295   -11.39   0.000    -.4452755   -.3137003
         _Ivilid_17 |  -.2970531   .0732597    -4.05   0.000     -.441657   -.1524493
         _Ivilid_18 |  -.0062692   .1030357    -0.06   0.952    -.2096465    .1971082
         _Ivilid_19 |  -.2214106   .0641375    -3.45   0.001    -.3480085   -.0948127
         _Ivilid_20 |  -.0815849   .1105267    -0.74   0.461    -.2997483    .1365785
         _Ivilid_21 |  -.1446201   .0709365    -2.04   0.043    -.2846383   -.0046019
         _Ivilid_22 |  -.2373976   .1608186    -1.48   0.142    -.5548298    .0800346
         _Ivilid_23 |  -.1337677   .1109258    -1.21   0.230    -.3527187    .0851834
         _Ivilid_24 |  -.0658149   .0446393    -1.47   0.142    -.1539263    .0222966
         _Ivilid_25 |   .1112422    .072717     1.53   0.128    -.0322905    .2547748
         _Ivilid_26 |   .1803575   .0878729     2.05   0.042     .0069094    .3538056
         _Ivilid_27 |  -.1390521   .0545985    -2.55   0.012    -.2468214   -.0312828
         _Ivilid_28 |    .129171   .0814885     1.59   0.115    -.0316753    .2900173
         _Ivilid_29 |  -.3353893   .0641546    -5.23   0.000     -.462021   -.2087575
         _Ivilid_30 |  -.2069738   .0733348    -2.82   0.005    -.3517258   -.0622218
         _Ivilid_31 |   .0907524   .0182938     4.96   0.000     .0546431    .1268616
         _Ivilid_32 |   .2965949   .0667166     4.45   0.000     .1649061    .4282836
         _Ivilid_33 |   .1699432   .0980946     1.73   0.085     -.023681    .3635674
         _Ivilid_34 |  -.1890551   .1796208    -1.05   0.294       -.5436    .1654897
         _Ivilid_35 |   -.174579   .0143448   -12.17   0.000    -.2028936   -.1462645
         _Ivilid_36 |  -.1043589   .0417178    -2.50   0.013    -.1867036   -.0220141
         _Ivilid_37 |  -.2455201   .0849392    -2.89   0.004    -.4131776   -.0778626
         _Ivilid_38 |   .0539774   .0282862     1.91   0.058    -.0018554    .1098102
         _Ivilid_39 |  -.3823157   .0686982    -5.57   0.000    -.5179158   -.2467156
         _Ivilid_40 |  -.0519826   .0988199    -0.53   0.600    -.2470385    .1430734
         _Ivilid_41 |  -.0974736   .0264172    -3.69   0.000    -.1496171     -.04533
         _Ivilid_42 |  -.3262563   .0406983    -8.02   0.000    -.4065887   -.2459239
         _Ivilid_43 |  -.0495643   .0498708    -0.99   0.322    -.1480018    .0488732
         _Ivilid_44 |  -.4075454   .0875038    -4.66   0.000     -.580265   -.2348258
         _Ivilid_45 |   .0368001   .1088393     0.34   0.736    -.1780326    .2516328
         _Ivilid_46 |  -.2455399   .0571951    -4.29   0.000    -.3584346   -.1326452
         _Ivilid_47 |   -.185507   .1129928    -1.64   0.102     -.408538    .0375241
              _cons |   .2377676   .0993908     2.39   0.018     .0415849    .4339503
-------------------------------------------------------------------------------------

. test default inter_default_trust

 ( 1)  default = 0
 ( 2)  inter_default_trust = 0

       F(  2,   172) =    7.14
            Prob > F =    0.0010

. outreg2 using `outputfile62'
TableA4.xls
dir : seeout

. reg insurance_buy default male age agpop ricearea_2010 literacy _Ivilid* if delay == 0, cluster(address
> )

Linear regression                                      Number of obs =    2137
                                                       F( 48,   172) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1003
                                                       Root MSE      =  .47947

                               (Std. Err. adjusted for 173 clusters in address)
-------------------------------------------------------------------------------
              |               Robust
insurance_buy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      default |   .0096365   .0201178     0.48   0.633    -.0300731    .0493461
         male |  -.0029607   .0384731    -0.08   0.939    -.0789008    .0729795
          age |   .0010305   .0009399     1.10   0.274    -.0008246    .0028857
        agpop |  -.0044537   .0053146    -0.84   0.403    -.0149439    .0060366
ricearea_2010 |   .0008633   .0003913     2.21   0.029     .0000909    .0016357
     literacy |   .0404607   .0305236     1.33   0.187    -.0197884    .1007099
    _Ivilid_2 |  -.0548447   .0519914    -1.05   0.293     -.157468    .0477787
    _Ivilid_3 |   .0201261   .0490471     0.41   0.682    -.0766856    .1169379
    _Ivilid_4 |  -.2540568   .0332628    -7.64   0.000    -.3197126    -.188401
    _Ivilid_5 |   .1380099   .1365718     1.01   0.314    -.1315626    .4075824
    _Ivilid_6 |   .0301705   .0265438     1.14   0.257     -.022223    .0825639
    _Ivilid_7 |   .1991996   .0380345     5.24   0.000     .1241252     .274274
    _Ivilid_8 |   .2588598   .1266513     2.04   0.042     .0088688    .5088508
    _Ivilid_9 |   .2910543   .0606201     4.80   0.000     .1713992    .4107094
   _Ivilid_10 |  -.0230686   .0221017    -1.04   0.298    -.0666942    .0205569
   _Ivilid_11 |  -.1328008   .0399338    -3.33   0.001    -.2116242   -.0539774
   _Ivilid_12 |  -.1882036   .0764293    -2.46   0.015    -.3390638   -.0373435
   _Ivilid_13 |   .2680039   .0151337    17.71   0.000     .2381323    .2978756
   _Ivilid_14 |    .132825    .061733     2.15   0.033     .0109732    .2546768
   _Ivilid_15 |   .2955491   .0621646     4.75   0.000     .1728453    .4182529
   _Ivilid_16 |   .2310999   .0207791    11.12   0.000      .190085    .2721148
   _Ivilid_17 |   .0688356   .0469972     1.46   0.145    -.0239299    .1616011
   _Ivilid_18 |   .2269308   .0234314     9.68   0.000     .1806807    .2731808
   _Ivilid_19 |   .0400907    .027276     1.47   0.143    -.0137481    .0939296
   _Ivilid_20 |   .1664535   .0404813     4.11   0.000     .0865494    .2463576
   _Ivilid_21 |   .0359275   .0455839     0.79   0.432    -.0540484    .1259034
   _Ivilid_22 |   .1932276   .0373795     5.17   0.000      .119446    .2670093
   _Ivilid_23 |  -.2586891   .0659884    -3.92   0.000    -.3889404   -.1284378
   _Ivilid_24 |   .1306954   .0702655     1.86   0.065    -.0079983    .2693892
   _Ivilid_25 |   .3732109   .0955862     3.90   0.000     .1845378     .561884
   _Ivilid_26 |   .2818554   .1000305     2.82   0.005       .08441    .4793008
   _Ivilid_27 |   .2416914   .0628955     3.84   0.000     .1175449    .3658379
   _Ivilid_28 |   .1293375   .0280579     4.61   0.000     .0739553    .1847198
   _Ivilid_29 |    .096918   .0513885     1.89   0.061    -.0045153    .1983513
   _Ivilid_30 |  -.0410822   .0517546    -0.79   0.428    -.1432382    .0610738
   _Ivilid_31 |   .2973432   .0112236    26.49   0.000     .2751895     .319497
   _Ivilid_32 |   .3359825   .0219818    15.28   0.000     .2925937    .3793712
   _Ivilid_33 |   .3602483   .0413607     8.71   0.000     .2786083    .4418882
   _Ivilid_34 |   .0920709   .1075147     0.86   0.393    -.1201472    .3042891
   _Ivilid_35 |   .0696563   .0091453     7.62   0.000     .0516048    .0877078
   _Ivilid_36 |  -.0419071   .0663673    -0.63   0.529    -.1729064    .0890922
   _Ivilid_37 |    .103649   .0764252     1.36   0.177     -.047203    .2545011
   _Ivilid_38 |   .3186671   .0253733    12.56   0.000      .268584    .3687503
   _Ivilid_39 |  -.2460583   .0365202    -6.74   0.000    -.3181439   -.1739728
   _Ivilid_40 |   .0912455   .0621404     1.47   0.144    -.0314105    .2139014
   _Ivilid_41 |   .2297029   .0366231     6.27   0.000     .1574143    .3019915
   _Ivilid_42 |   .1163981   .0347265     3.35   0.001     .0478531    .1849432
   _Ivilid_43 |   .1924351   .0781916     2.46   0.015     .0380964    .3467738
   _Ivilid_44 |   .2472911   .0293271     8.43   0.000     .1894038    .3051784
   _Ivilid_45 |     .28721   .0372891     7.70   0.000     .2136068    .3608131
   _Ivilid_46 |  -.0713581   .0381811    -1.87   0.063     -.146722    .0040057
   _Ivilid_47 |    .137037   .0274609     4.99   0.000     .0828333    .1912408
        _cons |   .3543869   .0695793     5.09   0.000     .2170477    .4917261
-------------------------------------------------------------------------------

. outreg2 using `outputfile62'
TableA4.xls
dir : seeout

. 
. 
. **********************************************************7. Effect of overall take-up*****************
> *******************************************
. bysort address: egen pre_takeup_ratetemp = mean(takeup_survey) if delay == 0
(2727 missing values generated)

. bysort address: egen pre_takeup_rate = mean(pre_takeup_ratetemp)

. gen inter_pre_none = pre_takeup_rate*info_none

. gen inter_pre_none_iv = default*info_none

. 
. *Table 6, OLS and IV estimation, columns 2,3,5,7
. reg takeup_survey pre_takeup_rate info_none inter_pre_none male age agpop ricearea_2010 literacy intens
> ive risk_averse disaster_prob _Ivilid* if delay == 1, cluster(address)
note: _Ivilid_5 omitted because of collinearity
note: _Ivilid_23 omitted because of collinearity
note: _Ivilid_27 omitted because of collinearity

Linear regression                                      Number of obs =    2674
                                                       F( 50,   166) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1065
                                                       Root MSE      =  .47576

                                 (Std. Err. adjusted for 167 clusters in address)
---------------------------------------------------------------------------------
                |               Robust
  takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
pre_takeup_rate |   .3783081   .0679951     5.56   0.000     .2440616    .5125547
      info_none |    .119902   .0412197     2.91   0.004     .0385195    .2012844
 inter_pre_none |   -.285436   .0755417    -3.78   0.000    -.4345823   -.1362896
           male |    .024643    .045786     0.54   0.591    -.0657548    .1150409
            age |   .0054588   .0009013     6.06   0.000     .0036793    .0072382
          agpop |  -.0066224   .0048843    -1.36   0.177    -.0162658     .003021
  ricearea_2010 |    .002958   .0011303     2.62   0.010     .0007264    .0051896
       literacy |   .0823039   .0238363     3.45   0.001     .0352426    .1293652
      intensive |   .0129825   .0185809     0.70   0.486    -.0237029    .0496679
    risk_averse |   .2231323   .0336019     6.64   0.000     .1567901    .2894746
  disaster_prob |   .0014618   .0005481     2.67   0.008     .0003796     .002544
      _Ivilid_2 |  -.2337072   .0712308    -3.28   0.001    -.3743423   -.0930721
      _Ivilid_3 |  -.4029957   .0353636   -11.40   0.000    -.4728161   -.3331752
      _Ivilid_4 |  -.2922816   .0484037    -6.04   0.000    -.3878478   -.1967153
      _Ivilid_5 |          0  (omitted)
      _Ivilid_6 |  -.1566862   .0945435    -1.66   0.099    -.3433488    .0299765
      _Ivilid_7 |  -.2079367   .0294148    -7.07   0.000    -.2660121   -.1498613
      _Ivilid_8 |  -.2085291   .0575001    -3.63   0.000    -.3220548   -.0950034
      _Ivilid_9 |  -.3649564   .1026712    -3.55   0.000     -.567666   -.1622468
     _Ivilid_10 |  -.2715451   .0520393    -5.22   0.000    -.3742893   -.1688009
     _Ivilid_11 |  -.3354225   .0511056    -6.56   0.000    -.4363232   -.2345217
     _Ivilid_12 |  -.1998062   .0616585    -3.24   0.001    -.3215421   -.0780702
     _Ivilid_13 |  -.1921663   .0600363    -3.20   0.002    -.3106995   -.0736331
     _Ivilid_14 |  -.3546287   .0582608    -6.09   0.000    -.4696563    -.239601
     _Ivilid_15 |   .0044146   .0414495     0.11   0.915    -.0774216    .0862508
     _Ivilid_16 |  -.1049094   .0180322    -5.82   0.000    -.1405115   -.0693073
     _Ivilid_17 |   -.355649   .0537093    -6.62   0.000    -.4616904   -.2496076
     _Ivilid_18 |  -.1921683   .1557031    -1.23   0.219     -.499582    .1152453
     _Ivilid_19 |  -.3490824   .0456904    -7.64   0.000    -.4392916   -.2588732
     _Ivilid_20 |  -.2003698   .0711153    -2.82   0.005    -.3407769   -.0599628
     _Ivilid_21 |  -.3717571   .0254891   -14.58   0.000    -.4220816   -.3214326
     _Ivilid_22 |  -.2077812   .0780982    -2.66   0.009    -.3619751   -.0535874
     _Ivilid_23 |          0  (omitted)
     _Ivilid_24 |   -.224026   .0823797    -2.72   0.007    -.3866731   -.0613789
     _Ivilid_25 |  -.0933342    .119929    -0.78   0.438    -.3301169    .1434485
     _Ivilid_26 |  -.2077182   .0389962    -5.33   0.000    -.2847107   -.1307257
     _Ivilid_27 |          0  (omitted)
     _Ivilid_28 |  -.1702614   .0767538    -2.22   0.028    -.3218007    -.018722
     _Ivilid_29 |  -.3261535    .043188    -7.55   0.000    -.4114222   -.2408849
     _Ivilid_30 |   -.302998   .0891504    -3.40   0.001    -.4790128   -.1269832
     _Ivilid_31 |  -.3372698   .0289877   -11.63   0.000    -.3945018   -.2800378
     _Ivilid_32 |  -.1076618   .1099725    -0.98   0.329    -.3247868    .1094631
     _Ivilid_33 |  -.0378233   .0248852    -1.52   0.130    -.0869556     .011309
     _Ivilid_34 |  -.1754418   .0782817    -2.24   0.026    -.3299978   -.0208858
     _Ivilid_35 |  -.2189608   .0188459   -11.62   0.000    -.2561694   -.1817523
     _Ivilid_36 |  -.3473656   .0643921    -5.39   0.000    -.4744987   -.2202326
     _Ivilid_37 |  -.3423224   .0374846    -9.13   0.000    -.4163304   -.2683144
     _Ivilid_38 |  -.2797403   .0948215    -2.95   0.004    -.4669518   -.0925288
     _Ivilid_39 |  -.1745916     .05437    -3.21   0.002    -.2819374   -.0672458
     _Ivilid_40 |  -.3230592   .0630957    -5.12   0.000    -.4476326   -.1984858
     _Ivilid_41 |  -.1586706    .034928    -4.54   0.000    -.2276309   -.0897102
     _Ivilid_42 |  -.4140137   .0377163   -10.98   0.000    -.4884792   -.3395482
     _Ivilid_43 |   .0126971   .0661034     0.19   0.848    -.1178146    .1432089
     _Ivilid_44 |   -.236862   .0513538    -4.61   0.000    -.3382529   -.1354711
     _Ivilid_45 |  -.1882214   .0659512    -2.85   0.005    -.3184327   -.0580101
     _Ivilid_46 |    -.29875   .0404497    -7.39   0.000    -.3786121   -.2188879
     _Ivilid_47 |  -.2954884   .0528671    -5.59   0.000     -.399867   -.1911099
          _cons |   .0966625   .0745924     1.30   0.197    -.0506097    .2439346
---------------------------------------------------------------------------------

. test pre_takeup_rate inter_pre_none

 ( 1)  pre_takeup_rate = 0
 ( 2)  inter_pre_none = 0

       F(  2,   166) =   16.67
            Prob > F =    0.0000

. outreg2 using `outputfile6'
Table6.xls
dir : seeout

. ivreg takeup_survey (pre_takeup_rate inter_pre_none = default inter_pre_none_iv) info_none male age agp
> op ricearea_2010 literacy intensive risk_averse disaster_prob _Ivilid* if delay == 1, cluster(address)

Instrumental variables (2SLS) regression               Number of obs =    2674
                                                       F( 50,   166) =       .
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0954
                                                       Root MSE      =  .47871

                                 (Std. Err. adjusted for 167 clusters in address)
---------------------------------------------------------------------------------
                |               Robust
  takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
pre_takeup_rate |    .718746   .2348112     3.06   0.003     .2551447    1.182347
 inter_pre_none |  -.6429464   .3345363    -1.92   0.056    -1.303441     .017548
      info_none |   .2733139   .1409225     1.94   0.054    -.0049175    .5515453
           male |   .0262367   .0462054     0.57   0.571    -.0649893    .1174628
            age |   .0054179   .0009015     6.01   0.000      .003638    .0071978
          agpop |  -.0059661   .0050125    -1.19   0.236    -.0158627    .0039304
  ricearea_2010 |   .0030418   .0011207     2.71   0.007     .0008291    .0052545
       literacy |   .0801144   .0238601     3.36   0.001      .033006    .1272229
      intensive |   .0113416   .0185531     0.61   0.542    -.0252889    .0479721
    risk_averse |   .2238672   .0336353     6.66   0.000      .157459    .2902753
  disaster_prob |   .0014638   .0005587     2.62   0.010     .0003607    .0025669
      _Ivilid_2 |  -.2098053   .0534021    -3.93   0.000    -.3152402   -.1043705
      _Ivilid_3 |  -.4144028    .042952    -9.65   0.000    -.4992055   -.3296001
      _Ivilid_4 |  -.2945146   .0467532    -6.30   0.000    -.3868222    -.202207
      _Ivilid_5 |          0  (omitted)
      _Ivilid_6 |  -.2375926   .1417361    -1.68   0.096    -.5174303    .0422451
      _Ivilid_7 |  -.2097923   .0360231    -5.82   0.000    -.2809148   -.1386697
      _Ivilid_8 |  -.2165738   .0583664    -3.71   0.000    -.3318099   -.1013376
      _Ivilid_9 |  -.3720442   .0939672    -3.96   0.000    -.5575691   -.1865193
     _Ivilid_10 |  -.2813099   .0719129    -3.91   0.000    -.4232917   -.1393282
     _Ivilid_11 |  -.3583772   .0692636    -5.17   0.000    -.4951282   -.2216261
     _Ivilid_12 |  -.2453264    .093313    -2.63   0.009    -.4295597   -.0610931
     _Ivilid_13 |  -.2456633   .0929581    -2.64   0.009    -.4291958   -.0621308
     _Ivilid_14 |  -.3779831   .0677491    -5.58   0.000     -.511744   -.2442222
     _Ivilid_15 |  -.0716251   .0853979    -0.84   0.403    -.2402311     .096981
     _Ivilid_16 |  -.0598877   .0411498    -1.46   0.147    -.1411321    .0213567
     _Ivilid_17 |  -.3381107    .050017    -6.76   0.000    -.4368622   -.2393592
     _Ivilid_18 |  -.2283776   .1854978    -1.23   0.220    -.5946167    .1378614
     _Ivilid_19 |  -.3458309   .0505588    -6.84   0.000    -.4456521   -.2460097
     _Ivilid_20 |  -.2327397   .0917752    -2.54   0.012    -.4139367   -.0515426
     _Ivilid_21 |  -.3762921   .0274881   -13.69   0.000    -.4305635   -.3220207
     _Ivilid_22 |  -.1988753   .0606238    -3.28   0.001    -.3185684   -.0791822
     _Ivilid_23 |          0  (omitted)
     _Ivilid_24 |  -.2446933   .0739285    -3.31   0.001    -.3906546    -.098732
     _Ivilid_25 |  -.1447033   .1531892    -0.94   0.346    -.4471536     .157747
     _Ivilid_26 |  -.2763206   .0974813    -2.83   0.005    -.4687836   -.0838576
     _Ivilid_27 |          0  (omitted)
     _Ivilid_28 |  -.2275856   .1023318    -2.22   0.027    -.4296252   -.0255459
     _Ivilid_29 |  -.3085827   .0477414    -6.46   0.000    -.4028412   -.2143241
     _Ivilid_30 |  -.3098184   .0962826    -3.22   0.002    -.4999147   -.1197221
     _Ivilid_31 |  -.4045761   .0896863    -4.51   0.000    -.5816489   -.2275032
     _Ivilid_32 |  -.2002371   .1509893    -1.33   0.187    -.4983441    .0978699
     _Ivilid_33 |  -.0978259   .0777811    -1.26   0.210    -.2513936    .0557419
     _Ivilid_34 |   -.188349   .1179597    -1.60   0.112    -.4212437    .0445457
     _Ivilid_35 |  -.2426942   .0376187    -6.45   0.000    -.3169669   -.1684214
     _Ivilid_36 |  -.3664674    .079743    -4.60   0.000    -.5239085   -.2090262
     _Ivilid_37 |  -.3345972   .0324412   -10.31   0.000    -.3986478   -.2705467
     _Ivilid_38 |  -.3307676   .1228351    -2.69   0.008     -.573288   -.0882472
     _Ivilid_39 |  -.1478029   .0417894    -3.54   0.001    -.2303101   -.0652958
     _Ivilid_40 |   -.346245   .0800648    -4.32   0.000    -.5043215   -.1881686
     _Ivilid_41 |  -.1966277   .0566182    -3.47   0.001    -.3084122   -.0848431
     _Ivilid_42 |  -.3933055    .037115   -10.60   0.000    -.4665838   -.3200273
     _Ivilid_43 |  -.0104562   .0849512    -0.12   0.902    -.1781803    .1572679
     _Ivilid_44 |  -.2013113   .0556451    -3.62   0.000    -.3111746   -.0914481
     _Ivilid_45 |  -.2293014   .0923416    -2.48   0.014    -.4116168    -.046986
     _Ivilid_46 |  -.2995925   .0448446    -6.68   0.000    -.3881319   -.2110532
     _Ivilid_47 |  -.2925342   .0448747    -6.52   0.000     -.381133   -.2039354
          _cons |  -.0364237   .1130376    -0.32   0.748    -.2596004    .1867529
---------------------------------------------------------------------------------
Instrumented:  pre_takeup_rate inter_pre_none
Instruments:   info_none male age agpop ricearea_2010 literacy intensive
               risk_averse disaster_prob _Ivilid_2 _Ivilid_3 _Ivilid_4
               _Ivilid_5 _Ivilid_6 _Ivilid_7 _Ivilid_8 _Ivilid_9 _Ivilid_10
               _Ivilid_11 _Ivilid_12 _Ivilid_13 _Ivilid_14 _Ivilid_15
               _Ivilid_16 _Ivilid_17 _Ivilid_18 _Ivilid_19 _Ivilid_20
               _Ivilid_21 _Ivilid_22 _Ivilid_23 _Ivilid_24 _Ivilid_25
               _Ivilid_26 _Ivilid_27 _Ivilid_28 _Ivilid_29 _Ivilid_30
               _Ivilid_31 _Ivilid_32 _Ivilid_33 _Ivilid_34 _Ivilid_35
               _Ivilid_36 _Ivilid_37 _Ivilid_38 _Ivilid_39 _Ivilid_40
               _Ivilid_41 _Ivilid_42 _Ivilid_43 _Ivilid_44 _Ivilid_45
               _Ivilid_46 _Ivilid_47 default inter_pre_none_iv
---------------------------------------------------------------------------------

. test pre_takeup_rate inter_pre_none

 ( 1)  pre_takeup_rate = 0
 ( 2)  inter_pre_none = 0

       F(  2,   166) =    4.78
            Prob > F =    0.0096

. outreg2 using `outputfile6'
Table6.xls
dir : seeout

. ivregress 2sls takeup_survey (pre_takeup_rate = default) male age agpop ricearea_2010 literacy intensiv
> e risk_averse disaster_prob _Ivilid* if delay == 1 & info_none == 0, cluster(address)
note: _Ivilid_5 omitted because of collinearity
note: _Ivilid_23 omitted because of collinearity
note: _Ivilid_47 omitted because of collinearity

Instrumental variables (2SLS) regression               Number of obs =    1378
                                                       Wald chi2(52) = 5218.44
                                                       Prob > chi2   =  0.0000
                                                       R-squared     =  0.1265
                                                       Root MSE      =  .46586

                                 (Std. Err. adjusted for 166 clusters in address)
---------------------------------------------------------------------------------
                |               Robust
  takeup_survey |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
pre_takeup_rate |    .791097    .267112     2.96   0.003      .267567    1.314627
           male |     .03754   .0525577     0.71   0.475    -.0654712    .1405511
            age |   .0052447   .0012625     4.15   0.000     .0027702    .0077192
          agpop |   -.002354   .0065718    -0.36   0.720    -.0152344    .0105265
  ricearea_2010 |   .0027682   .0011119     2.49   0.013     .0005888    .0049475
       literacy |   .0821087   .0350045     2.35   0.019     .0135011    .1507163
      intensive |  -.0090163     .02614    -0.34   0.730    -.0602497    .0422171
    risk_averse |   .2367229    .044207     5.35   0.000     .1500788    .3233671
  disaster_prob |   .0012724   .0007374     1.73   0.084    -.0001729    .0027177
      _Ivilid_2 |   .3452332   .0904892     3.82   0.000     .1678776    .5225889
      _Ivilid_3 |  -.1475013   .0815764    -1.81   0.071    -.3073881    .0123855
      _Ivilid_4 |  -.0474271   .0836391    -0.57   0.571    -.2113567    .1165025
      _Ivilid_5 |          0  (omitted)
      _Ivilid_6 |  -.1484284   .1580481    -0.94   0.348    -.4581971    .1613402
      _Ivilid_7 |   .0743107   .0948378     0.78   0.433    -.1115681    .2601895
      _Ivilid_8 |   .0163503    .119463     0.14   0.891     -.217793    .2504935
      _Ivilid_9 |  -.1603012   .1084906    -1.48   0.140    -.3729389    .0523364
     _Ivilid_10 |  -.0826628   .1092264    -0.76   0.449    -.2967426     .131417
     _Ivilid_11 |  -.1534891   .1078959    -1.42   0.155    -.3649611     .057983
     _Ivilid_12 |  -.0935962   .1324701    -0.71   0.480    -.3532327    .1660404
     _Ivilid_13 |  -.0926566    .156907    -0.59   0.555    -.4001887    .2148756
     _Ivilid_14 |  -.0714032   .0985734    -0.72   0.469    -.2646035    .1217972
     _Ivilid_15 |   .1326152   .1389213     0.95   0.340    -.1396655    .4048959
     _Ivilid_16 |   .2361172   .0935626     2.52   0.012     .0527379    .4194964
     _Ivilid_17 |  -.0231316   .1081977    -0.21   0.831    -.2351953    .1889321
     _Ivilid_18 |  -.0222282   .2023617    -0.11   0.913    -.4188499    .3743935
     _Ivilid_19 |    .003062   .1008332     0.03   0.976    -.1945675    .2006915
     _Ivilid_20 |  -.0485209    .134787    -0.36   0.719    -.3126987    .2156568
     _Ivilid_21 |  -.1198367   .1023518    -1.17   0.242    -.3204425     .080769
     _Ivilid_22 |   .1448299   .0829718     1.75   0.081    -.0177919    .3074517
     _Ivilid_23 |          0  (omitted)
     _Ivilid_24 |  -.0070314   .0924207    -0.08   0.939    -.1881727    .1741099
     _Ivilid_25 |    .014153   .1572495     0.09   0.928    -.2940503    .3223564
     _Ivilid_26 |  -.0402247   .1443299    -0.28   0.780    -.3231062    .2426568
     _Ivilid_27 |   .3609595   .0754213     4.79   0.000     .2131365    .5087824
     _Ivilid_28 |   -.033045    .157204    -0.21   0.834    -.3411591    .2750692
     _Ivilid_29 |   .0510028    .090727     0.56   0.574    -.1268188    .2288245
     _Ivilid_30 |   .0088087   .1902086     0.05   0.963    -.3639934    .3816108
     _Ivilid_31 |  -.2197117   .1348703    -1.63   0.103    -.4840525    .0446292
     _Ivilid_32 |  -.1019524   .1964345    -0.52   0.604     -.486957    .2830522
     _Ivilid_33 |   .1772401   .1373794     1.29   0.197    -.0920186    .4464987
     _Ivilid_34 |    .071788   .0835278     0.86   0.390    -.0919234    .2354994
     _Ivilid_35 |   .1599285   .0865597     1.85   0.065    -.0097253    .3295823
     _Ivilid_36 |  -.0424915   .1039057    -0.41   0.683     -.246143      .16116
     _Ivilid_37 |  -.0875917   .0909481    -0.96   0.335    -.2658466    .0906633
     _Ivilid_38 |  -.1616332   .1227244    -1.32   0.188    -.4021686    .0789022
     _Ivilid_39 |   .1942197   .0803926     2.42   0.016     .0366531    .3517864
     _Ivilid_40 |  -.0710834   .1012756    -0.70   0.483    -.2695799     .127413
     _Ivilid_41 |   .0737319   .1034164     0.71   0.476    -.1289606    .2764243
     _Ivilid_42 |  -.1374196   .0937899    -1.47   0.143    -.3212445    .0464053
     _Ivilid_43 |  -.1158199   .1755434    -0.66   0.509    -.4598786    .2282388
     _Ivilid_44 |   .0554539   .0911521     0.61   0.543    -.1232011    .2341088
     _Ivilid_45 |    -.16342   .1201656    -1.36   0.174    -.3989402    .0721002
     _Ivilid_46 |   .0446944   .1040201     0.43   0.667    -.1591812      .24857
     _Ivilid_47 |          0  (omitted)
          _cons |  -.3247496   .1529328    -2.12   0.034    -.6244923   -.0250069
---------------------------------------------------------------------------------
Instrumented:  pre_takeup_rate
Instruments:   male age agpop ricearea_2010 literacy intensive risk_averse
               disaster_prob _Ivilid_2 _Ivilid_3 _Ivilid_4 _Ivilid_6 _Ivilid_7
               _Ivilid_8 _Ivilid_9 _Ivilid_10 _Ivilid_11 _Ivilid_12 _Ivilid_13
               _Ivilid_14 _Ivilid_15 _Ivilid_16 _Ivilid_17 _Ivilid_18
               _Ivilid_19 _Ivilid_20 _Ivilid_21 _Ivilid_22 _Ivilid_24
               _Ivilid_25 _Ivilid_26 _Ivilid_27 _Ivilid_28 _Ivilid_29
               _Ivilid_30 _Ivilid_31 _Ivilid_32 _Ivilid_33 _Ivilid_34
               _Ivilid_35 _Ivilid_36 _Ivilid_37 _Ivilid_38 _Ivilid_39
               _Ivilid_40 _Ivilid_41 _Ivilid_42 _Ivilid_43 _Ivilid_44
               _Ivilid_45 _Ivilid_46 default

. outreg2 using `outputfile6'
Table6.xls
dir : seeout

. estat firststage

  First-stage regression summary statistics
  --------------------------------------------------------------------------
               |            Adjusted      Partial       Robust
      Variable |   R-sq.       R-sq.        R-sq.      F(1,165)   Prob > F
  -------------+------------------------------------------------------------
  pre_takeup~e |  0.4685      0.4476       0.0807        11.749    0.0008
  --------------------------------------------------------------------------
  (F statistic adjusted for 166 clusters in address)


. ivregress 2sls takeup_survey (pre_takeup_rate = default) male age agpop ricearea_2010 literacy intensiv
> e risk_averse disaster_prob _Ivilid* if delay == 1 & info_none == 1, cluster(address)
note: _Ivilid_5 omitted because of collinearity
note: _Ivilid_23 omitted because of collinearity
note: _Ivilid_47 omitted because of collinearity

Instrumental variables (2SLS) regression               Number of obs =    1296
                                                       Wald chi2(52) =25999.85
                                                       Prob > chi2   =  0.0000
                                                       R-squared     =  0.1097
                                                       Root MSE      =  .46962

                                 (Std. Err. adjusted for 166 clusters in address)
---------------------------------------------------------------------------------
                |               Robust
  takeup_survey |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
pre_takeup_rate |   .0171326   .3247691     0.05   0.958    -.6194031    .6536683
           male |   .0098724    .073801     0.13   0.894    -.1347749    .1545198
            age |   .0049169   .0011917     4.13   0.000     .0025812    .0072526
          agpop |  -.0096521   .0069023    -1.40   0.162    -.0231804    .0038763
  ricearea_2010 |    .004391   .0009719     4.52   0.000     .0024862    .0062958
       literacy |   .0790718   .0324715     2.44   0.015     .0154289    .1427147
      intensive |   .0305985   .0310955     0.98   0.325    -.0303475    .0915446
    risk_averse |   .2163687   .0452639     4.78   0.000     .1276531    .3050843
  disaster_prob |   .0015533   .0008501     1.83   0.068    -.0001127    .0032194
      _Ivilid_2 |  -.2423566   .1640119    -1.48   0.139    -.5638141    .0791009
      _Ivilid_3 |  -.1042446   .0952442    -1.09   0.274    -.2909198    .0824307
      _Ivilid_4 |   .0487371   .0777566     0.63   0.531    -.1036631    .2011372
      _Ivilid_5 |          0  (omitted)
      _Ivilid_6 |   .2608235   .2314704     1.13   0.260      -.19285    .7144971
      _Ivilid_7 |   .0888957   .0966762     0.92   0.358    -.1005861    .2783776
      _Ivilid_8 |   .1180765   .0943267     1.25   0.211    -.0668004    .3029534
      _Ivilid_9 |   -.005584   .1483603    -0.04   0.970    -.2963649    .2851968
     _Ivilid_10 |    .059982   .1075344     0.56   0.577    -.1507815    .2707455
     _Ivilid_11 |   .0194406   .1084442     0.18   0.858     -.193106    .2319873
     _Ivilid_12 |   .1956355   .1658717     1.18   0.238     -.129467    .5207379
     _Ivilid_13 |   .1760041   .1365255     1.29   0.197     -.091581    .4435891
     _Ivilid_14 |  -.0976062   .1103058    -0.88   0.376    -.3138016    .1185892
     _Ivilid_15 |   .3374233   .1777947     1.90   0.058    -.0110479    .6858946
     _Ivilid_16 |   .2427284   .0871709     2.78   0.005     .0718766    .4135801
     _Ivilid_17 |  -.0632245   .1029594    -0.61   0.539    -.2650212    .1385722
     _Ivilid_18 |    .145009   .2057073     0.70   0.481    -.2581698    .5481879
     _Ivilid_19 |  -.1205736   .1001315    -1.20   0.229    -.3168277    .0756806
     _Ivilid_20 |   .1631584   .1298221     1.26   0.209    -.0912883    .4176051
     _Ivilid_21 |  -.0434997   .1045437    -0.42   0.677    -.2484015    .1614021
     _Ivilid_22 |   .0312812    .128697     0.24   0.808    -.2209603    .2835226
     _Ivilid_23 |          0  (omitted)
     _Ivilid_24 |   .0930729   .1516828     0.61   0.539      -.20422    .3903657
     _Ivilid_25 |   .2885917   .2009873     1.44   0.151    -.1053363    .6825196
     _Ivilid_26 |   .0673276   .1610481     0.42   0.676    -.2483209     .382976
     _Ivilid_27 |   .2615671   .0630974     4.15   0.000     .1378985    .3852356
     _Ivilid_28 |   .1608708   .1438971     1.12   0.264    -.1211623     .442904
     _Ivilid_29 |  -.0780796   .0963418    -0.81   0.418    -.2669061    .1107468
     _Ivilid_30 |  -.0493198   .1576491    -0.31   0.754    -.3583064    .2596668
     _Ivilid_31 |  -.0085472   .1513566    -0.06   0.955    -.3052008    .2881063
     _Ivilid_32 |   .2771645   .2012186     1.38   0.168    -.1172168    .6715457
     _Ivilid_33 |   .1775004   .1313575     1.35   0.177    -.0799555    .4349563
     _Ivilid_34 |   .1178331   .2247551     0.52   0.600    -.3226788    .5583451
     _Ivilid_35 |  -.1775551   .0807895    -2.20   0.028    -.3358997   -.0192106
     _Ivilid_36 |  -.1071666   .1354245    -0.79   0.429    -.3725937    .1582606
     _Ivilid_37 |    .016625   .0656378     0.25   0.800    -.1120227    .1452727
     _Ivilid_38 |   .0664297   .2165425     0.31   0.759    -.3579859    .4908453
     _Ivilid_39 |   .0661745   .1116634     0.59   0.553    -.1526818    .2850307
     _Ivilid_40 |  -.0373537   .1809561    -0.21   0.836    -.3920212    .3173137
     _Ivilid_41 |   .0963593    .164339     0.59   0.558    -.2257391    .4184577
     _Ivilid_42 |   -.061311     .07373    -0.83   0.406    -.2058191    .0831971
     _Ivilid_43 |   .5756649   .0831833     6.92   0.000     .4126287    .7387011
     _Ivilid_44 |    .130857   .1213511     1.08   0.281    -.1069868    .3687009
     _Ivilid_45 |   .2937861   .1493137     1.97   0.049     .0011366    .5864356
     _Ivilid_46 |  -.0734092   .0722197    -1.02   0.309    -.2149571    .0681388
     _Ivilid_47 |          0  (omitted)
          _cons |  -.0328503   .1451257    -0.23   0.821    -.3172914    .2515909
---------------------------------------------------------------------------------
Instrumented:  pre_takeup_rate
Instruments:   male age agpop ricearea_2010 literacy intensive risk_averse
               disaster_prob _Ivilid_2 _Ivilid_3 _Ivilid_4 _Ivilid_6 _Ivilid_7
               _Ivilid_8 _Ivilid_9 _Ivilid_10 _Ivilid_11 _Ivilid_12 _Ivilid_13
               _Ivilid_14 _Ivilid_15 _Ivilid_16 _Ivilid_17 _Ivilid_18
               _Ivilid_19 _Ivilid_20 _Ivilid_21 _Ivilid_22 _Ivilid_24
               _Ivilid_25 _Ivilid_26 _Ivilid_27 _Ivilid_28 _Ivilid_29
               _Ivilid_30 _Ivilid_31 _Ivilid_32 _Ivilid_33 _Ivilid_34
               _Ivilid_35 _Ivilid_36 _Ivilid_37 _Ivilid_38 _Ivilid_39
               _Ivilid_40 _Ivilid_41 _Ivilid_42 _Ivilid_43 _Ivilid_44
               _Ivilid_45 _Ivilid_46 default

. outreg2 using `outputfile6'
Table6.xls
dir : seeout

. estat firststage

  First-stage regression summary statistics
  --------------------------------------------------------------------------
               |            Adjusted      Partial       Robust
      Variable |   R-sq.       R-sq.        R-sq.      F(1,165)   Prob > F
  -------------+------------------------------------------------------------
  pre_takeup~e |  0.4431      0.4198       0.0620       9.55455    0.0023
  --------------------------------------------------------------------------
  (F statistic adjusted for 166 clusters in address)


. 
. *Table 6, reduced form estimation, columns 4,6,8
. reg takeup_survey default info_none inter_pre_none_iv male age agpop ricearea_2010 literacy intensive r
> isk_averse disaster_prob _Ivilid* if delay == 1, cluster(address)
note: _Ivilid_5 omitted because of collinearity
note: _Ivilid_23 omitted because of collinearity
note: _Ivilid_27 omitted because of collinearity

Linear regression                                      Number of obs =    2674
                                                       F( 50,   166) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0979
                                                       Root MSE      =  .47804

                                   (Std. Err. adjusted for 167 clusters in address)
-----------------------------------------------------------------------------------
                  |               Robust
    takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
          default |   .0928912   .0301047     3.09   0.002     .0334537    .1523288
        info_none |    .041293   .0279173     1.48   0.141    -.0138257    .0964116
inter_pre_none_iv |  -.0914404   .0446301    -2.05   0.042    -.1795561   -.0033247
             male |   .0215182    .045975     0.47   0.640    -.0692529    .1122893
              age |   .0055139   .0009142     6.03   0.000     .0037089    .0073188
            agpop |  -.0064307   .0048578    -1.32   0.187    -.0160218    .0031604
    ricearea_2010 |   .0028415   .0011856     2.40   0.018     .0005007    .0051823
         literacy |    .084529    .024049     3.51   0.001     .0370476    .1320103
        intensive |   .0151943   .0186605     0.81   0.417    -.0216483    .0520368
      risk_averse |   .2202274    .034033     6.47   0.000     .1530341    .2874206
    disaster_prob |   .0014925   .0005436     2.75   0.007     .0004193    .0025657
        _Ivilid_2 |  -.2846909   .1166859    -2.44   0.016    -.5150706   -.0543111
        _Ivilid_3 |  -.4065379   .0361682   -11.24   0.000     -.477947   -.3351289
        _Ivilid_4 |  -.3070051   .0724731    -4.24   0.000    -.4500929   -.1639173
        _Ivilid_5 |          0  (omitted)
        _Ivilid_6 |  -.0779871   .0928255    -0.84   0.402    -.2612577    .1052836
        _Ivilid_7 |  -.2242794   .0283543    -7.91   0.000    -.2802609   -.1682978
        _Ivilid_8 |   -.208294    .073773    -2.82   0.005    -.3539484   -.0626397
        _Ivilid_9 |  -.3726874   .1080916    -3.45   0.001    -.5860988   -.1592759
       _Ivilid_10 |  -.2491567    .032149    -7.75   0.000    -.3126303   -.1856832
       _Ivilid_11 |  -.3309201   .0525572    -6.30   0.000    -.4346868   -.2271535
       _Ivilid_12 |   -.159941   .0612117    -2.61   0.010    -.2807947   -.0390873
       _Ivilid_13 |  -.1392172   .0626329    -2.22   0.028    -.2628769   -.0155574
       _Ivilid_14 |  -.3311537   .0609456    -5.43   0.000    -.4514822   -.2108253
       _Ivilid_15 |   .0981537   .0375856     2.61   0.010     .0239463    .1723611
       _Ivilid_16 |   -.152263   .0152104   -10.01   0.000    -.1822937   -.1222322
       _Ivilid_17 |  -.3790467   .0607587    -6.24   0.000    -.4990062   -.2590872
       _Ivilid_18 |  -.1545293   .1416397    -1.09   0.277    -.4341767     .125118
       _Ivilid_19 |  -.3631785   .0473607    -7.67   0.000    -.4566854   -.2696716
       _Ivilid_20 |  -.1716021   .0725682    -2.36   0.019    -.3148777   -.0283265
       _Ivilid_21 |  -.3619086   .0371035    -9.75   0.000    -.4351643    -.288653
       _Ivilid_22 |  -.2332223   .1006061    -2.32   0.022    -.4318547   -.0345899
       _Ivilid_23 |          0  (omitted)
       _Ivilid_24 |  -.2182491   .0903922    -2.41   0.017    -.3967157   -.0397825
       _Ivilid_25 |  -.0221118   .0956924    -0.23   0.818    -.2110429    .1668192
       _Ivilid_26 |  -.1173747   .0194294    -6.04   0.000    -.1557352   -.0790141
       _Ivilid_27 |          0  (omitted)
       _Ivilid_28 |  -.1041841   .0696402    -1.50   0.137    -.2416788    .0333107
       _Ivilid_29 |  -.3657222   .0459974    -7.95   0.000    -.4565375   -.2749069
       _Ivilid_30 |  -.3150299    .082344    -3.83   0.000    -.4776064   -.1524533
       _Ivilid_31 |  -.2814193   .0250774   -11.22   0.000    -.3309311   -.2319075
       _Ivilid_32 |   .0094289   .1049432     0.09   0.929    -.1977665    .2166243
       _Ivilid_33 |   .0426924   .0196538     2.17   0.031     .0038888    .0814959
       _Ivilid_34 |  -.1707526   .0420321    -4.06   0.000    -.2537391   -.0877661
       _Ivilid_35 |  -.2297602   .0271918    -8.45   0.000    -.2834466   -.1760739
       _Ivilid_36 |  -.3275409   .0588122    -5.57   0.000    -.4436571   -.2114247
       _Ivilid_37 |  -.3696888    .060982    -6.06   0.000    -.4900891   -.2492886
       _Ivilid_38 |   -.237592   .0920522    -2.58   0.011     -.419336   -.0558481
       _Ivilid_39 |  -.2276446   .0942753    -2.41   0.017    -.4137778   -.0415114
       _Ivilid_40 |  -.2913036   .0623633    -4.67   0.000    -.4144311    -.168176
       _Ivilid_41 |  -.1516313   .0416476    -3.64   0.000    -.2338586    -.069404
       _Ivilid_42 |  -.4524626   .0416174   -10.87   0.000    -.5346302    -.370295
       _Ivilid_43 |   .0456059   .0529427     0.86   0.390    -.0589219    .1501338
       _Ivilid_44 |   -.289684   .0574482    -5.04   0.000    -.4031072   -.1762608
       _Ivilid_45 |  -.1345796   .0814094    -1.65   0.100     -.295311    .0261518
       _Ivilid_46 |  -.3132927   .0366881    -8.54   0.000    -.3857281   -.2408573
       _Ivilid_47 |  -.2989517   .0631559    -4.73   0.000    -.4236441   -.1742593
            _cons |   .2045794   .0739204     2.77   0.006     .0586342    .3505247
-----------------------------------------------------------------------------------

. outreg2 using `outputfile6'
Table6.xls
dir : seeout

. reg takeup_survey default male age agpop ricearea_2010 literacy intensive risk_averse disaster_prob _Iv
> ilid* if delay == 1 & info_none == 0, cluster(address)
note: _Ivilid_5 omitted because of collinearity
note: _Ivilid_23 omitted because of collinearity
note: _Ivilid_43 omitted because of collinearity

Linear regression                                      Number of obs =    1378
                                                       F( 48,   165) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1212
                                                       Root MSE      =  .47653

                               (Std. Err. adjusted for 166 clusters in address)
-------------------------------------------------------------------------------
              |               Robust
takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      default |   .0933698   .0301155     3.10   0.002     .0339083    .1528313
         male |   .0326418   .0545541     0.60   0.550    -.0750723    .1403558
          age |    .005566   .0013215     4.21   0.000     .0029568    .0081752
        agpop |  -.0036538   .0066524    -0.55   0.584    -.0167885    .0094809
ricearea_2010 |   .0024568   .0011999     2.05   0.042     .0000877    .0048259
     literacy |   .0917127   .0371909     2.47   0.015     .0182813     .165144
    intensive |   .0025656   .0274047     0.09   0.926    -.0515436    .0566747
  risk_averse |   .2199091   .0468202     4.70   0.000     .1274651    .3123531
disaster_prob |   .0013058   .0007431     1.76   0.081    -.0001613     .002773
    _Ivilid_2 |   .1916839   .1382702     1.39   0.168    -.0813231    .4646908
    _Ivilid_3 |  -.1574643   .1167417    -1.35   0.179    -.3879645    .0730359
    _Ivilid_4 |  -.0836998   .1447206    -0.58   0.564    -.3694427     .202043
    _Ivilid_5 |          0  (omitted)
    _Ivilid_6 |   .1546601   .1157653     1.34   0.183    -.0739122    .3832324
    _Ivilid_7 |    .033465    .127958     0.26   0.794    -.2191811    .2861112
    _Ivilid_8 |   .0212766    .147425     0.14   0.885     -.269806    .3123593
    _Ivilid_9 |  -.1719023   .1490743    -1.15   0.251    -.4662415    .1224368
   _Ivilid_10 |   -.032441   .1164899    -0.28   0.781    -.2624439     .197562
   _Ivilid_11 |  -.1110139    .136927    -0.81   0.419    -.3813687     .159341
   _Ivilid_12 |   .0585113   .1286831     0.45   0.650    -.1955664     .312589
   _Ivilid_13 |   .0969203   .1565426     0.62   0.537    -.2121645     .406005
   _Ivilid_14 |   .0105453   .1227448     0.09   0.932    -.2318075    .2528982
   _Ivilid_15 |   .4023856   .1128568     3.57   0.000      .179556    .6252152
   _Ivilid_16 |   .0622829   .1088343     0.57   0.568    -.1526046    .2771704
   _Ivilid_17 |  -.1218491   .1349542    -0.90   0.368    -.3883087    .1446106
   _Ivilid_18 |   .1034478   .1583128     0.65   0.514    -.2091322    .4160278
   _Ivilid_19 |  -.0439185   .1249515    -0.35   0.726    -.2906285    .2027915
   _Ivilid_20 |   .0638828   .1363986     0.47   0.640    -.2054289    .3331945
   _Ivilid_21 |  -.1063054    .145008    -0.73   0.465    -.3926159    .1800051
   _Ivilid_22 |   .0702548   .1465612     0.48   0.632    -.2191222    .3596319
   _Ivilid_23 |          0  (omitted)
   _Ivilid_24 |   .0312284   .1260855     0.25   0.805    -.2177205    .2801773
   _Ivilid_25 |   .2341768   .1248425     1.88   0.062    -.0123179    .4806715
   _Ivilid_26 |   .2302571   .1112451     2.07   0.040     .0106097    .4499045
   _Ivilid_27 |   .3360082   .1110427     3.03   0.003     .1167604    .5552559
   _Ivilid_28 |   .1965417   .1292316     1.52   0.130    -.0586191    .4517024
   _Ivilid_29 |  -.0824268   .1287864    -0.64   0.523    -.3367085    .1718548
   _Ivilid_30 |  -.0115638   .1919308    -0.06   0.952    -.3905208    .3673932
   _Ivilid_31 |   .0040288   .1148431     0.04   0.972    -.2227228    .2307803
   _Ivilid_32 |   .2808169   .1839717     1.53   0.129    -.0824252     .644059
   _Ivilid_33 |   .4094517   .1096324     3.73   0.000     .1929885    .6259149
   _Ivilid_34 |   .1007929   .1761108     0.57   0.568    -.2469282     .448514
   _Ivilid_35 |    .177746   .1126172     1.58   0.116    -.0446106    .4001026
   _Ivilid_36 |   .0214706     .12247     0.18   0.861    -.2203397    .2632809
   _Ivilid_37 |  -.1588826   .1497908    -1.06   0.290    -.4546363    .1368711
   _Ivilid_38 |   .0175013    .116517     0.15   0.881    -.2125552    .2475579
   _Ivilid_39 |   .0448932   .1467429     0.31   0.760    -.2448427     .334629
   _Ivilid_40 |   .0288082   .1302375     0.22   0.825    -.2283387     .285955
   _Ivilid_41 |   .1423079   .1197745     1.19   0.236    -.0941804    .3787961
   _Ivilid_42 |   -.245901   .1247009    -1.97   0.050    -.4921162    .0003143
   _Ivilid_43 |          0  (omitted)
   _Ivilid_44 |  -.1199479   .1168961    -1.03   0.306     -.350753    .1108571
   _Ivilid_45 |    .009844   .1458163     0.07   0.946    -.2780624    .2977503
   _Ivilid_46 |   .0090789   .1237038     0.07   0.942    -.2351676    .2533254
   _Ivilid_47 |  -.0300174   .1536924    -0.20   0.845    -.3334746    .2734398
        _cons |  -.0724418   .1333478    -0.54   0.588    -.3357299    .1908463
-------------------------------------------------------------------------------

. outreg2 using `outputfile6'
Table6.xls
dir : seeout

. reg takeup_survey default male age agpop ricearea_2010 literacy intensive risk_averse disaster_prob _Iv
> ilid* if delay == 1 & info_none == 1, cluster(address)
note: _Ivilid_5 omitted because of collinearity
note: _Ivilid_23 omitted because of collinearity
note: _Ivilid_32 omitted because of collinearity

Linear regression                                      Number of obs =    1296
                                                       F( 48,   165) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1097
                                                       Root MSE      =  .47952

                               (Std. Err. adjusted for 166 clusters in address)
-------------------------------------------------------------------------------
              |               Robust
takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      default |   .0017779   .0345319     0.05   0.959    -.0664034    .0699592
         male |   .0097626   .0751127     0.13   0.897    -.1385433    .1580685
          age |    .004911   .0012122     4.05   0.000     .0025175    .0073045
        agpop |  -.0095958   .0069364    -1.38   0.168    -.0232914    .0040999
ricearea_2010 |   .0044008   .0009778     4.50   0.000     .0024702    .0063315
     literacy |   .0793062   .0330897     2.40   0.018     .0139724      .14464
    intensive |   .0306282   .0318512     0.96   0.338    -.0322603    .0935168
  risk_averse |   .2163654   .0463465     4.67   0.000     .1248568     .307874
disaster_prob |   .0015643   .0008108     1.93   0.055    -.0000365     .003165
    _Ivilid_2 |  -.5312055   .1675117    -3.17   0.002    -.8619482   -.2004628
    _Ivilid_3 |  -.3897488   .0907535    -4.29   0.000    -.5689368   -.2105609
    _Ivilid_4 |  -.2370887   .0782823    -3.03   0.003    -.3916529   -.0825245
    _Ivilid_5 |          0  (omitted)
    _Ivilid_6 |  -.0179426    .159324    -0.11   0.910    -.3325192     .296634
    _Ivilid_7 |  -.1974989   .0902981    -2.19   0.030    -.3757875   -.0192103
    _Ivilid_8 |  -.1678006   .0935308    -1.79   0.075    -.3524721    .0168709
    _Ivilid_9 |  -.2909849   .1352983    -2.15   0.033    -.5581241   -.0238457
   _Ivilid_10 |  -.2248947   .0980367    -2.29   0.023    -.4184629   -.0313265
   _Ivilid_11 |  -.2652842   .0937506    -2.83   0.005    -.4503896   -.0801788
   _Ivilid_12 |  -.0858869    .129325    -0.66   0.508    -.3412321    .1694583
   _Ivilid_13 |  -.1054293   .0718249    -1.47   0.144    -.2472437    .0363851
   _Ivilid_14 |  -.3814576   .1044111    -3.65   0.000    -.5876116   -.1753035
   _Ivilid_15 |   .0575815   .1285211     0.45   0.655    -.1961765    .3113395
   _Ivilid_16 |   -.046546   .0611755    -0.76   0.448    -.1673338    .0742418
   _Ivilid_17 |  -.3511779   .0999922    -3.51   0.001     -.548607   -.1537488
   _Ivilid_18 |  -.1378222   .1885904    -0.73   0.466    -.5101838    .2345394
   _Ivilid_19 |  -.4069027   .1035652    -3.93   0.000    -.6113866   -.2024188
   _Ivilid_20 |  -.1200294    .109136    -1.10   0.273    -.3355126    .0954537
   _Ivilid_21 |  -.3282746   .1024858    -3.20   0.002    -.5306273    -.125922
   _Ivilid_22 |   -.255869   .1325042    -1.93   0.055    -.5174913    .0057534
   _Ivilid_23 |          0  (omitted)
   _Ivilid_24 |  -.1915797   .1528032    -1.25   0.212    -.4932813    .1101218
   _Ivilid_25 |   .0072884   .1668486     0.04   0.965    -.3221451    .3367219
   _Ivilid_26 |  -.2118492    .066309    -3.19   0.002    -.3427729   -.0809256
   _Ivilid_27 |  -.0245975   .0652735    -0.38   0.707    -.1534765    .1042816
   _Ivilid_28 |  -.1202866   .0848069    -1.42   0.158    -.2877331      .04716
   _Ivilid_29 |  -.3657619   .0974407    -3.75   0.000    -.5581533   -.1733705
   _Ivilid_30 |  -.3351549   .1579189    -2.12   0.035    -.6469571   -.0233526
   _Ivilid_31 |  -.2891539   .0645584    -4.48   0.000    -.4166208   -.1616869
   _Ivilid_32 |          0  (omitted)
   _Ivilid_33 |  -.1031818   .0701059    -1.47   0.143     -.241602    .0352384
   _Ivilid_34 |  -.1670629   .2154113    -0.78   0.439    -.5923808    .2582549
   _Ivilid_35 |  -.4627841   .0614802    -7.53   0.000    -.5841734   -.3413948
   _Ivilid_36 |   -.391329   .1196706    -3.27   0.001    -.6276121   -.1550459
   _Ivilid_37 |   -.269696   .0658678    -4.09   0.000    -.3997483   -.1396436
   _Ivilid_38 |  -.2148714     .18065    -1.19   0.236    -.5715549    .1418122
   _Ivilid_39 |  -.2219869   .1155089    -1.92   0.056     -.450053    .0060793
   _Ivilid_40 |   -.320614   .1624885    -1.97   0.050    -.6414387    .0002107
   _Ivilid_41 |  -.1875138   .1491325    -1.26   0.210    -.4819677    .1069402
   _Ivilid_42 |  -.3493458   .0716014    -4.88   0.000    -.4907189   -.2079726
   _Ivilid_43 |   .2923048   .0635892     4.60   0.000     .1667515    .4178582
   _Ivilid_44 |  -.1586373   .1163976    -1.36   0.175    -.3884579    .0711834
   _Ivilid_45 |   .0128519   .1065201     0.12   0.904    -.1974664    .2231701
   _Ivilid_46 |  -.3597616   .0736622    -4.88   0.000    -.5052036   -.2143195
   _Ivilid_47 |  -.2866262   .0866366    -3.31   0.001    -.4576855   -.1155669
        _cons |   .2579278   .0935874     2.76   0.007     .0731446    .4427109
-------------------------------------------------------------------------------

. outreg2 using `outputfile6'
Table6.xls
dir : seeout

. 
. **********************************************************8. Effect of friends' take-up****************
> ********************************************
. gen inter_pre_takeup = network_rate_presession*pre_takeup_rate
(314 missing values generated)

. gen inter_pre_takeup_iv = network_rate_presession*default
(314 missing values generated)

. 
. gen inter_prenetwork_none = network_rate_pretakeup*info_none
(1186 missing values generated)

. gen inter_prenetwork_none_iv1 = inter_pre_takeup_iv*info_none
(314 missing values generated)

. 
. *Table 7, OLS and IV estimation, columns 1,2,3,5,7
. reg network_rate_pretakeup inter_pre_takeup_iv male age agpop ricearea_2010 literacy intensive _Ivilid*
>  if delay == 1 & info_takeup_rate ~= 1, cluster(address)
note: _Ivilid_5 omitted because of collinearity
note: _Ivilid_23 omitted because of collinearity
note: _Ivilid_27 omitted because of collinearity

Linear regression                                      Number of obs =    1500
                                                       F( 46,   164) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1627
                                                       Root MSE      =  .39812

                                     (Std. Err. adjusted for 165 clusters in address)
-------------------------------------------------------------------------------------
                    |               Robust
network_rate_pret~p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
inter_pre_takeup_iv |   .3017253   .0603705     5.00   0.000     .1825216    .4209291
               male |   .0099835   .0464539     0.21   0.830    -.0817413    .1017083
                age |  -.0008927    .000995    -0.90   0.371    -.0028574    .0010719
              agpop |   .0056112   .0049957     1.12   0.263     -.004253    .0154753
      ricearea_2010 |   .0003086   .0007671     0.40   0.688     -.001206    .0018232
           literacy |  -.0049616   .0297235    -0.17   0.868    -.0636516    .0537285
          intensive |    .003868   .0202431     0.19   0.849    -.0361027    .0438387
          _Ivilid_2 |  -.2804313   .1676531    -1.67   0.096    -.6114681    .0506056
          _Ivilid_3 |  -.1890754   .0310318    -6.09   0.000    -.2503487   -.1278021
          _Ivilid_4 |  -.0929387    .033321    -2.79   0.006    -.1587321   -.0271453
          _Ivilid_5 |          0  (omitted)
          _Ivilid_6 |   .0623156   .0510657     1.22   0.224    -.0385153    .1631465
          _Ivilid_7 |  -.0302785   .0840611    -0.36   0.719    -.1962601    .1357031
          _Ivilid_8 |   .0085149    .103978     0.08   0.935    -.1967934    .2138231
          _Ivilid_9 |   .0154062   .0462868     0.33   0.740    -.0759888    .1068012
         _Ivilid_10 |   -.030028   .0863768    -0.35   0.729     -.200582     .140526
         _Ivilid_11 |   .0411325   .1148005     0.36   0.721     -.185545    .2678101
         _Ivilid_12 |   .0522503    .116648     0.45   0.655    -.1780752    .2825757
         _Ivilid_13 |   .1873839   .1262741     1.48   0.140    -.0619488    .4367165
         _Ivilid_14 |   .0716919   .0842099     0.85   0.396    -.0945834    .2379672
         _Ivilid_15 |   .2870165   .0663207     4.33   0.000      .156064     .417969
         _Ivilid_16 |  -.3394065   .0153959   -22.05   0.000    -.3698063   -.3090067
         _Ivilid_17 |  -.1788914   .0804083    -2.22   0.027    -.3376604   -.0201224
         _Ivilid_18 |   .0580531     .19675     0.30   0.768    -.3304365    .4465427
         _Ivilid_19 |   .0232636   .0558663     0.42   0.678    -.0870464    .1335736
         _Ivilid_20 |   .0377294   .0685319     0.55   0.583    -.0975892     .173048
         _Ivilid_21 |  -.0563133   .0763954    -0.74   0.462    -.2071587    .0945321
         _Ivilid_22 |  -.1372628   .1152899    -1.19   0.236    -.3649067    .0903811
         _Ivilid_23 |          0  (omitted)
         _Ivilid_24 |   .0311406    .066739     0.47   0.641    -.1006379    .1629191
         _Ivilid_25 |   .2380181   .1398611     1.70   0.091    -.0381425    .5141788
         _Ivilid_26 |    .336535   .0697398     4.83   0.000     .1988314    .4742387
         _Ivilid_27 |          0  (omitted)
         _Ivilid_28 |   .2048446   .0950516     2.16   0.033     .0171619    .3925273
         _Ivilid_29 |  -.0872502    .131872    -0.66   0.509    -.3476359    .1731355
         _Ivilid_30 |  -.1241258   .1027372    -1.21   0.229    -.3269839    .0787323
         _Ivilid_31 |   .1813646   .0269347     6.73   0.000      .128181    .2345482
         _Ivilid_32 |   .5222407   .0335232    15.58   0.000      .456048    .5884335
         _Ivilid_33 |   .2040766   .1186274     1.72   0.087    -.0301574    .4383106
         _Ivilid_34 |   .1302857   .0319611     4.08   0.000     .0671774    .1933939
         _Ivilid_35 |   .2131512   .0317805     6.71   0.000     .1503996    .2759028
         _Ivilid_36 |   .1648624   .0427886     3.85   0.000     .0803749    .2493499
         _Ivilid_37 |  -.0690734   .0776414    -0.89   0.375     -.222379    .0842323
         _Ivilid_38 |   .2328168   .0270881     8.59   0.000     .1793303    .2863033
         _Ivilid_39 |  -.2647857   .0619003    -4.28   0.000      -.38701   -.1425615
         _Ivilid_40 |   .0664279    .092729     0.72   0.475    -.1166687    .2495246
         _Ivilid_41 |  -.0204141   .0706457    -0.29   0.773    -.1599066    .1190784
         _Ivilid_42 |  -.2334805   .0560625    -4.16   0.000    -.3441778   -.1227831
         _Ivilid_43 |    .056738   .1997349     0.28   0.777    -.3376454    .4511214
         _Ivilid_44 |  -.2355226   .0574407    -4.10   0.000    -.3489413   -.1221039
         _Ivilid_45 |   .1564744   .1027926     1.52   0.130    -.0464931    .3594419
         _Ivilid_46 |  -.2582433   .0382037    -6.76   0.000    -.3336778   -.1828089
         _Ivilid_47 |  -.1198785   .1097321    -1.09   0.276    -.3365483    .0967912
              _cons |    .402904   .0736835     5.47   0.000     .2574134    .5483946
-------------------------------------------------------------------------------------

. outreg2 using `outputfile7'
Table7.xls
dir : seeout

. reg takeup_survey pre_takeup_rate network_rate_pretakeup info_none inter_pre_none inter_prenetwork_none
>  male age agpop ricearea_2010 literacy intensive _Ivilid* if delay == 1 & info_takeup_rate ~= 1, cluste
> r(address)
note: _Ivilid_5 omitted because of collinearity
note: _Ivilid_23 omitted because of collinearity
note: _Ivilid_27 omitted because of collinearity

Linear regression                                      Number of obs =    1500
                                                       F( 50,   164) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1143
                                                       Root MSE      =  .47516

                                        (Std. Err. adjusted for 165 clusters in address)
----------------------------------------------------------------------------------------
                       |               Robust
         takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
       pre_takeup_rate |   .4480858   .1170533     3.83   0.000       .21696    .6792116
network_rate_pretakeup |   .1057882   .0495125     2.14   0.034     .0080241    .2035523
             info_none |   .1347258   .0587059     2.29   0.023      .018809    .2506426
        inter_pre_none |  -.3424199   .1308373    -2.62   0.010    -.6007626   -.0840771
 inter_prenetwork_none |  -.0416882   .0701122    -0.59   0.553    -.1801271    .0967508
                  male |   .0617462   .0594603     1.04   0.301    -.0556602    .1791526
                   age |    .005506   .0012009     4.59   0.000     .0031348    .0078771
                 agpop |  -.0072382   .0062766    -1.15   0.251    -.0196317    .0051552
         ricearea_2010 |   .0045819   .0008561     5.35   0.000     .0028914    .0062724
              literacy |   .0985112   .0307926     3.20   0.002     .0377102    .1593122
             intensive |    .032469   .0261531     1.24   0.216    -.0191711    .0841091
             _Ivilid_2 |  -.3894109   .0901073    -4.32   0.000    -.5673309   -.2114908
             _Ivilid_3 |  -.4550803   .0618092    -7.36   0.000    -.5771246    -.333036
             _Ivilid_4 |  -.3743419    .082479    -4.54   0.000    -.5371995   -.2114843
             _Ivilid_5 |          0  (omitted)
             _Ivilid_6 |  -.1252862   .1873333    -0.67   0.505    -.4951823    .2446099
             _Ivilid_7 |  -.3309725     .06461    -5.12   0.000    -.4585471   -.2033979
             _Ivilid_8 |   -.328684   .0483585    -6.80   0.000    -.4241696   -.2331985
             _Ivilid_9 |  -.3185999   .1578632    -2.02   0.045    -.6303062   -.0068935
            _Ivilid_10 |   -.385285   .1070963    -3.60   0.000    -.5967504   -.1738196
            _Ivilid_11 |  -.4783226   .0826903    -5.78   0.000    -.6415975   -.3150477
            _Ivilid_12 |  -.3659966   .0964935    -3.79   0.000    -.5565264   -.1754668
            _Ivilid_13 |  -.2945352   .0598144    -4.92   0.000    -.4126408   -.1764296
            _Ivilid_14 |  -.4139944    .067554    -6.13   0.000    -.5473821   -.2806067
            _Ivilid_15 |   -.123854   .0440735    -2.81   0.006    -.2108786   -.0368295
            _Ivilid_16 |   .0452572   .0259158     1.75   0.083    -.0059144    .0964289
            _Ivilid_17 |  -.4448641    .051224    -8.68   0.000    -.5460078   -.3437205
            _Ivilid_18 |  -.2744746   .1794751    -1.53   0.128    -.6288545    .0799052
            _Ivilid_19 |  -.4180642   .0576475    -7.25   0.000    -.5318911   -.3042372
            _Ivilid_20 |  -.2506241   .1057355    -2.37   0.019    -.4594025   -.0418457
            _Ivilid_21 |  -.4921452   .0697158    -7.06   0.000    -.6298015    -.354489
            _Ivilid_22 |  -.3706206    .097056    -3.82   0.000     -.562261   -.1789802
            _Ivilid_23 |          0  (omitted)
            _Ivilid_24 |  -.2746429   .1282603    -2.14   0.034    -.5278974   -.0213885
            _Ivilid_25 |  -.2252233   .1756385    -1.28   0.202    -.5720275    .1215809
            _Ivilid_26 |  -.3281907   .0436116    -7.53   0.000    -.4143033   -.2420781
            _Ivilid_27 |          0  (omitted)
            _Ivilid_28 |  -.2771742   .0782827    -3.54   0.001     -.431746   -.1226024
            _Ivilid_29 |  -.4507488   .0802504    -5.62   0.000    -.6092059   -.2922916
            _Ivilid_30 |  -.2782826    .088213    -3.15   0.002    -.4524621    -.104103
            _Ivilid_31 |  -.4343554    .043433   -10.00   0.000    -.5201154   -.3485954
            _Ivilid_32 |  -.1190135   .1416911    -0.84   0.402    -.3987874    .1607605
            _Ivilid_33 |  -.0975095   .1201893    -0.81   0.418    -.3348274    .1398084
            _Ivilid_34 |  -.3208512   .0500128    -6.42   0.000    -.4196032   -.2220992
            _Ivilid_35 |   -.498335   .0242358   -20.56   0.000    -.5461895   -.4504805
            _Ivilid_36 |  -.5342594   .0343652   -15.55   0.000    -.6021147   -.4664041
            _Ivilid_37 |  -.3709417   .0467479    -7.93   0.000     -.463247   -.2786364
            _Ivilid_38 |  -.2970443   .1536458    -1.93   0.055    -.6004232    .0063347
            _Ivilid_39 |  -.0178993    .024718    -0.72   0.470    -.0667059    .0309073
            _Ivilid_40 |   -.492107   .0659863    -7.46   0.000    -.6223992   -.3618149
            _Ivilid_41 |  -.3163884   .0555394    -5.70   0.000    -.4260528    -.206724
            _Ivilid_42 |  -.4435964   .0606609    -7.31   0.000    -.5633735   -.3238194
            _Ivilid_43 |   .0287044    .037991     0.76   0.451    -.0463102     .103719
            _Ivilid_44 |  -.3374901   .0382972    -8.81   0.000    -.4131092    -.261871
            _Ivilid_45 |  -.2457445   .0903751    -2.72   0.007    -.4241932   -.0672958
            _Ivilid_46 |  -.3002533    .075156    -4.00   0.000    -.4486515   -.1518551
            _Ivilid_47 |  -.3702436   .0755817    -4.90   0.000    -.5194823   -.2210049
                 _cons |   .1150628   .0949635     1.21   0.227     -.072446    .3025715
----------------------------------------------------------------------------------------

. outreg2 using `outputfile7'
Table7.xls
dir : seeout

. test pre_takeup_rate inter_pre_none

 ( 1)  pre_takeup_rate = 0
 ( 2)  inter_pre_none = 0

       F(  2,   164) =    7.33
            Prob > F =    0.0009

. test network_rate_pretakeup inter_prenetwork_none

 ( 1)  network_rate_pretakeup = 0
 ( 2)  inter_prenetwork_none = 0

       F(  2,   164) =    3.02
            Prob > F =    0.0515

. ivreg takeup_survey (network_rate_pretakeup pre_takeup_rate inter_pre_none inter_prenetwork_none = inte
> r_pre_takeup_iv network_rate_presession default inter_pre_none_iv inter_prenetwork_none_iv1) info_none 
> male age agpop ricearea_2010 literacy intensive _Ivilid* if delay == 1 & info_takeup_rate ~= 1, cluster
> (address)

Instrumental variables (2SLS) regression               Number of obs =    1500
                                                       F( 50,   164) =       .
                                                       Prob > F      =  0.0000
                                                       R-squared     =       .
                                                       Root MSE      =  .51888

                                        (Std. Err. adjusted for 165 clusters in address)
----------------------------------------------------------------------------------------
                       |               Robust
         takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
network_rate_pretakeup |   .5555076   .2587766     2.15   0.033     .0445442    1.066471
       pre_takeup_rate |   .8812737   .7259145     1.21   0.226    -.5520695    2.314617
        inter_pre_none |  -.7355128   1.017638    -0.72   0.471    -2.744875    1.273849
 inter_prenetwork_none |  -.0142672   1.198548    -0.01   0.991    -2.380841    2.352307
             info_none |   .2735405   .3292833     0.83   0.407    -.3766408    .9237218
                  male |   .0538005   .0662081     0.81   0.418    -.0769297    .1845307
                   age |   .0057859   .0014006     4.13   0.000     .0030205    .0085513
                 agpop |  -.0079007    .007203    -1.10   0.274    -.0221232    .0063218
         ricearea_2010 |   .0042707   .0011336     3.77   0.000     .0020324     .006509
              literacy |   .0956355   .0384637     2.49   0.014     .0196877    .1715834
             intensive |   .0292571   .0300934     0.97   0.332    -.0301633    .0886775
             _Ivilid_2 |  -.2794817   .0520198    -5.37   0.000    -.3821966   -.1767667
             _Ivilid_3 |  -.4258723    .118042    -3.61   0.000    -.6589503   -.1927943
             _Ivilid_4 |  -.3759745   .1689272    -2.23   0.027    -.7095271   -.0424219
             _Ivilid_5 |          0  (omitted)
             _Ivilid_6 |    -.32935   .3281671    -1.00   0.317    -.9773273    .3186273
             _Ivilid_7 |  -.3640761   .1302763    -2.79   0.006    -.6213111   -.1068411
             _Ivilid_8 |  -.3721819   .1069162    -3.48   0.001    -.5832916   -.1610722
             _Ivilid_9 |  -.3738825   .1392929    -2.68   0.008    -.6489211   -.0988439
            _Ivilid_10 |  -.3845608   .1962255    -1.96   0.052    -.7720148    .0028932
            _Ivilid_11 |  -.5952315   .2287334    -2.60   0.010    -1.046874   -.1435895
            _Ivilid_12 |  -.5114591   .2473528    -2.07   0.040    -.9998658   -.0230524
            _Ivilid_13 |  -.4954147   .1938347    -2.56   0.012     -.878148   -.1126814
            _Ivilid_14 |  -.5155862   .1951802    -2.64   0.009    -.9009762   -.1301963
            _Ivilid_15 |  -.3893712   .2895283    -1.34   0.181    -.9610548    .1823124
            _Ivilid_16 |    .252636   .0708613     3.57   0.000      .112718    .3925541
            _Ivilid_17 |  -.3571389    .072251    -4.94   0.000     -.499801   -.2144769
            _Ivilid_18 |   -.378647   .3373438    -1.12   0.263    -1.044744      .28745
            _Ivilid_19 |  -.4576514   .2159443    -2.12   0.036    -.8840408   -.0312619
            _Ivilid_20 |  -.3530791   .1927981    -1.83   0.069    -.7337656    .0276073
            _Ivilid_21 |  -.4937643   .1050874    -4.70   0.000     -.701263   -.2862656
            _Ivilid_22 |  -.3418134   .0960178    -3.56   0.000    -.5314039    -.152223
            _Ivilid_23 |          0  (omitted)
            _Ivilid_24 |  -.3599345   .1410648    -2.55   0.012     -.638472   -.0813971
            _Ivilid_25 |  -.4334375    .326033    -1.33   0.186    -1.077201    .2103259
            _Ivilid_26 |   -.576029    .306324    -1.88   0.062    -1.180876    .0288183
            _Ivilid_27 |          0  (omitted)
            _Ivilid_28 |  -.4826775   .2366201    -2.04   0.043     -.949892   -.0154629
            _Ivilid_29 |  -.4452786   .1932306    -2.30   0.022    -.8268192    -.063738
            _Ivilid_30 |   -.286195   .1445049    -1.98   0.049    -.5715249   -.0008651
            _Ivilid_31 |  -.6839016    .309697    -2.21   0.029    -1.295409   -.0723941
            _Ivilid_32 |  -.4909333   .4307228    -1.14   0.256     -1.34141    .3595437
            _Ivilid_33 |  -.3207119   .3659277    -0.88   0.382    -1.043249     .401825
            _Ivilid_34 |   -.465421   .3671967    -1.27   0.207    -1.190464    .2596216
            _Ivilid_35 |  -.6966965   .2772768    -2.51   0.013    -1.244189   -.1492039
            _Ivilid_36 |  -.6719978   .2427768    -2.77   0.006    -1.151369   -.1926266
            _Ivilid_37 |  -.3765829   .1172697    -3.21   0.002    -.6081359   -.1450298
            _Ivilid_38 |  -.5153552   .3280281    -1.57   0.118    -1.163058    .1323477
            _Ivilid_39 |    .106108   .0629024     1.69   0.094    -.0180949     .230311
            _Ivilid_40 |  -.5753059   .1772901    -3.24   0.001    -.9253713   -.2252405
            _Ivilid_41 |  -.4275851   .1837419    -2.33   0.021    -.7903898   -.0647803
            _Ivilid_42 |  -.3493278   .0940443    -3.71   0.000    -.5350215    -.163634
            _Ivilid_43 |  -.0258903   .1628324    -0.16   0.874    -.3474085     .295628
            _Ivilid_44 |  -.2104069   .0975253    -2.16   0.032     -.402974   -.0178399
            _Ivilid_45 |  -.3957742   .2460577    -1.61   0.110    -.8816237    .0900753
            _Ivilid_46 |  -.2240533   .1422413    -1.58   0.117    -.5049136     .056807
            _Ivilid_47 |  -.3351932   .1167586    -2.87   0.005     -.565737   -.1046494
                 _cons |  -.2031076   .1932855    -1.05   0.295    -.5847565    .1785414
----------------------------------------------------------------------------------------
Instrumented:  network_rate_pretakeup pre_takeup_rate inter_pre_none
               inter_prenetwork_none
Instruments:   info_none male age agpop ricearea_2010 literacy intensive _Ivilid_2
               _Ivilid_3 _Ivilid_4 _Ivilid_5 _Ivilid_6 _Ivilid_7 _Ivilid_8 _Ivilid_9
               _Ivilid_10 _Ivilid_11 _Ivilid_12 _Ivilid_13 _Ivilid_14 _Ivilid_15
               _Ivilid_16 _Ivilid_17 _Ivilid_18 _Ivilid_19 _Ivilid_20 _Ivilid_21
               _Ivilid_22 _Ivilid_23 _Ivilid_24 _Ivilid_25 _Ivilid_26 _Ivilid_27
               _Ivilid_28 _Ivilid_29 _Ivilid_30 _Ivilid_31 _Ivilid_32 _Ivilid_33
               _Ivilid_34 _Ivilid_35 _Ivilid_36 _Ivilid_37 _Ivilid_38 _Ivilid_39
               _Ivilid_40 _Ivilid_41 _Ivilid_42 _Ivilid_43 _Ivilid_44 _Ivilid_45
               _Ivilid_46 _Ivilid_47 inter_pre_takeup_iv network_rate_presession
               default inter_pre_none_iv inter_prenetwork_none_iv1
----------------------------------------------------------------------------------------

. outreg2 using `outputfile7'
Table7.xls
dir : seeout

. test pre_takeup_rate inter_pre_none

 ( 1)  pre_takeup_rate = 0
 ( 2)  inter_pre_none = 0

       F(  2,   164) =    0.74
            Prob > F =    0.4792

. test network_rate_pretakeup inter_prenetwork_none

 ( 1)  network_rate_pretakeup = 0
 ( 2)  inter_prenetwork_none = 0

       F(  2,   164) =    2.31
            Prob > F =    0.1022

. ivregress 2sls takeup_survey (network_rate_pretakeup pre_takeup_rate = inter_pre_takeup_iv default) mal
> e age agpop ricearea_2010 literacy intensive _Ivilid* if delay == 1 & info_takeup_list == 1, cluster(ad
> dress)
note: _Ivilid_5 omitted because of collinearity
note: _Ivilid_23 omitted because of collinearity
note: _Ivilid_47 omitted because of collinearity

Instrumental variables (2SLS) regression               Number of obs =     613
                                                       Wald chi2(51) = 1018.07
                                                       Prob > chi2   =  0.0000
                                                       R-squared     =  0.0185
                                                       Root MSE      =  .49321

                                        (Std. Err. adjusted for 164 clusters in address)
----------------------------------------------------------------------------------------
                       |               Robust
         takeup_survey |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
network_rate_pretakeup |   .5789829   .2162311     2.68   0.007     .1551777    1.002788
       pre_takeup_rate |   .9271174   .7352364     1.26   0.207    -.5139194    2.368154
                  male |   .0059459   .0734812     0.08   0.936    -.1380747    .1499665
                   age |    .006509   .0023092     2.82   0.005      .001983     .011035
                 agpop |    .000642   .0103728     0.06   0.951    -.0196883    .0209722
         ricearea_2010 |   .0035054   .0013848     2.53   0.011     .0007912    .0062195
              literacy |   .1092181   .0597792     1.83   0.068    -.0079469    .2263831
             intensive |   .0369904    .041837     0.88   0.377    -.0450087    .1189895
             _Ivilid_2 |   .3457488   .2260296     1.53   0.126    -.0972611    .7887587
             _Ivilid_3 |  -.2263853   .2432706    -0.93   0.352     -.703187    .2504164
             _Ivilid_4 |  -.0221334   .1791569    -0.12   0.902    -.3732745    .3290077
             _Ivilid_5 |          0  (omitted)
             _Ivilid_6 |   -.129355   .4195347    -0.31   0.758    -.9516278    .6929179
             _Ivilid_7 |  -.2286506   .1817518    -1.26   0.208    -.5848776    .1275763
             _Ivilid_8 |   -.306083   .1716047    -1.78   0.074     -.642422    .0302559
             _Ivilid_9 |  -.1939152   .2396679    -0.81   0.418    -.6636556    .2758252
            _Ivilid_10 |  -.0119526   .2184654    -0.05   0.956     -.440137    .4162318
            _Ivilid_11 |  -.2908382   .2627137    -1.11   0.268    -.8057476    .2240713
            _Ivilid_12 |  -.2804446   .3000292    -0.93   0.350    -.8684911    .3076018
            _Ivilid_13 |  -.4764992   .3065363    -1.55   0.120    -1.077299     .124301
            _Ivilid_14 |  -.2011471   .2661988    -0.76   0.450    -.7228871     .320593
            _Ivilid_15 |  -.2336864   .3776209    -0.62   0.536    -.9738098     .506437
            _Ivilid_16 |   .6517982    .183774     3.55   0.000     .2916077    1.011989
            _Ivilid_17 |   .0409636   .2043663     0.20   0.841     -.359587    .4415141
            _Ivilid_18 |    -.17977   .3459393    -0.52   0.603    -.8577986    .4982585
            _Ivilid_19 |   .0579998   .1748411     0.33   0.740    -.2846826    .4006821
            _Ivilid_20 |  -.2559246   .2544946    -1.01   0.315    -.7547249    .2428757
            _Ivilid_21 |  -.2164047   .2095359    -1.03   0.302    -.6270874    .1942781
            _Ivilid_22 |   .0876204   .1637084     0.54   0.592    -.2332421    .4084829
            _Ivilid_23 |          0  (omitted)
            _Ivilid_24 |  -.1958545    .171914    -1.14   0.255    -.5327997    .1410908
            _Ivilid_25 |     -.3072   .2809767    -1.09   0.274    -.8579042    .2435043
            _Ivilid_26 |  -.2587317   .2421004    -1.07   0.285    -.7332398    .2157764
            _Ivilid_27 |   .3040416   .1816113     1.67   0.094      -.05191    .6599931
            _Ivilid_28 |  -.4538181    .298174    -1.52   0.128    -1.038228    .1305922
            _Ivilid_29 |  -.0419838   .2254915    -0.19   0.852    -.4839389    .3999714
            _Ivilid_30 |   .0234501   .1944096     0.12   0.904    -.3575856    .4044859
            _Ivilid_31 |  -.4095235   .3088008    -1.33   0.185    -1.014762     .195715
            _Ivilid_32 |  -.5657664   .3204761    -1.77   0.077    -1.193888    .0623551
            _Ivilid_33 |   .0724286   .2941563     0.25   0.806    -.5041072    .6489644
            _Ivilid_34 |    .058644   .2036294     0.29   0.773    -.3404623    .4577503
            _Ivilid_35 |  -.3741896   .1719762    -2.18   0.030    -.7112568   -.0371224
            _Ivilid_36 |  -.2598314    .181139    -1.43   0.151    -.6148574    .0951945
            _Ivilid_37 |  -.2065483   .1664394    -1.24   0.215    -.5327636     .119667
            _Ivilid_38 |  -.3516462   .2579248    -1.36   0.173    -.8571695    .1538771
            _Ivilid_39 |   .4953849   .1893454     2.62   0.009     .1242747    .8664951
            _Ivilid_40 |  -.1895984   .2190593    -0.87   0.387    -.6189468      .23975
            _Ivilid_41 |  -.0442168    .262262    -0.17   0.866     -.558241    .4698074
            _Ivilid_42 |  -.0267515    .199262    -0.13   0.893    -.4172978    .3637948
            _Ivilid_43 |  -.2496718    .166333    -1.50   0.133    -.5756785    .0763349
            _Ivilid_44 |   .1384615   .2205035     0.63   0.530    -.2937174    .5706404
            _Ivilid_45 |  -.3222218   .2352799    -1.37   0.171    -.7833619    .1389183
            _Ivilid_46 |   .1335198   .2192442     0.61   0.543     -.296191    .5632306
            _Ivilid_47 |          0  (omitted)
                 _cons |  -.5505915   .2607255    -2.11   0.035    -1.061604   -.0395789
----------------------------------------------------------------------------------------
Instrumented:  network_rate_pretakeup pre_takeup_rate
Instruments:   male age agpop ricearea_2010 literacy intensive _Ivilid_2 _Ivilid_3
               _Ivilid_4 _Ivilid_6 _Ivilid_7 _Ivilid_8 _Ivilid_9 _Ivilid_10 _Ivilid_11
               _Ivilid_12 _Ivilid_13 _Ivilid_14 _Ivilid_15 _Ivilid_16 _Ivilid_17
               _Ivilid_18 _Ivilid_19 _Ivilid_20 _Ivilid_21 _Ivilid_22 _Ivilid_24
               _Ivilid_25 _Ivilid_26 _Ivilid_27 _Ivilid_28 _Ivilid_29 _Ivilid_30
               _Ivilid_31 _Ivilid_32 _Ivilid_33 _Ivilid_34 _Ivilid_35 _Ivilid_36
               _Ivilid_37 _Ivilid_38 _Ivilid_39 _Ivilid_40 _Ivilid_41 _Ivilid_42
               _Ivilid_43 _Ivilid_44 _Ivilid_45 _Ivilid_46 inter_pre_takeup_iv default

. outreg2 using `outputfile7'
Table7.xls
dir : seeout

. ivregress 2sls takeup_survey (network_rate_pretakeup pre_takeup_rate = inter_pre_takeup_iv default) mal
> e age agpop ricearea_2010 literacy intensive _Ivilid* if delay == 1 & info_none == 1, cluster(address)
note: _Ivilid_5 omitted because of collinearity
note: _Ivilid_23 omitted because of collinearity
note: _Ivilid_47 omitted because of collinearity

Instrumental variables (2SLS) regression               Number of obs =     887
                                                       Wald chi2(51) = 9959.51
                                                       Prob > chi2   =  0.0000
                                                       R-squared     =  0.1161
                                                       Root MSE      =  .46394

                                        (Std. Err. adjusted for 164 clusters in address)
----------------------------------------------------------------------------------------
                       |               Robust
         takeup_survey |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
network_rate_pretakeup |   .0602933   1.232098     0.05   0.961    -2.354575    2.475162
       pre_takeup_rate |   .1629282   .6948489     0.23   0.815    -1.198951    1.524807
                  male |   .0151083   .0984773     0.15   0.878    -.1779035    .2081202
                   age |     .00438   .0014705     2.98   0.003     .0014979    .0072621
                 agpop |  -.0100584   .0074888    -1.34   0.179    -.0247362    .0046193
         ricearea_2010 |   .0048769   .0014336     3.40   0.001     .0020671    .0076868
              literacy |    .099853   .0447322     2.23   0.026     .0121796    .1875264
             intensive |   .0318841   .0373121     0.85   0.393    -.0412462    .1050144
             _Ivilid_2 |  -.1856043   .1909419    -0.97   0.331    -.5598436    .1886349
             _Ivilid_3 |  -.0561286   .1277157    -0.44   0.660    -.3064468    .1941895
             _Ivilid_4 |   .0159862   .2259739     0.07   0.944    -.4269145    .4588868
             _Ivilid_5 |          0  (omitted)
             _Ivilid_6 |    .241666   .3795335     0.64   0.524    -.5022061    .9855381
             _Ivilid_7 |   .0981736   .1173913     0.84   0.403    -.1319091    .3282563
             _Ivilid_8 |   .1462976   .1440918     1.02   0.310    -.1361172    .4287124
             _Ivilid_9 |    .081409   .1843471     0.44   0.659    -.2799046    .4427227
            _Ivilid_10 |  -.0013871   .1967618    -0.01   0.994    -.3870332     .384259
            _Ivilid_11 |    -.10732   .2811326    -0.38   0.703    -.6583297    .4436897
            _Ivilid_12 |   .0529883   .3278837     0.16   0.872     -.589652    .6956286
            _Ivilid_13 |   .1292431   .2268127     0.57   0.569    -.3153016    .5737878
            _Ivilid_14 |  -.0639546   .2467647    -0.26   0.796    -.5476046    .4196953
            _Ivilid_15 |   .2827206    .407704     0.69   0.488    -.5163645    1.081806
            _Ivilid_16 |   .3813757   .1485041     2.57   0.010      .090313    .6724383
            _Ivilid_17 |  -.1044523   .1050525    -0.99   0.320    -.3103515    .1014468
            _Ivilid_18 |   .0789846   .2910286     0.27   0.786     -.491421    .6493902
            _Ivilid_19 |  -.1297412   .3162622    -0.41   0.682    -.7496037    .4901214
            _Ivilid_20 |   .2035583   .1953764     1.04   0.297    -.1793723    .5864889
            _Ivilid_21 |  -.0766009   .1488704    -0.51   0.607    -.3683814    .2151796
            _Ivilid_22 |  -.0302328   .1625729    -0.19   0.852    -.3488698    .2884042
            _Ivilid_23 |          0  (omitted)
            _Ivilid_24 |   .1221484   .2198787     0.56   0.579    -.3088059    .5531026
            _Ivilid_25 |   .1726146   .3265265     0.53   0.597    -.4673655    .8125947
            _Ivilid_26 |   .0017329   .4459594     0.00   0.997    -.8723313    .8757972
            _Ivilid_27 |   .2919881   .0865296     3.37   0.001     .1223933     .461583
            _Ivilid_28 |   .1791023   .2892272     0.62   0.536    -.3877726    .7459773
            _Ivilid_29 |  -.0997536   .1840009    -0.54   0.588    -.4603888    .2608816
            _Ivilid_30 |    .052055   .2300675     0.23   0.821    -.3988691    .5029791
            _Ivilid_31 |   -.076514   .5053252    -0.15   0.880    -1.066933    .9139053
            _Ivilid_32 |   .3445461   .6372423     0.54   0.589    -.9044258    1.593518
            _Ivilid_33 |   .1646667   .6479399     0.25   0.799    -1.105272    1.434606
            _Ivilid_34 |  -.0349938   .5809746    -0.06   0.952    -1.173683    1.103695
            _Ivilid_35 |  -.2034373   .4067646    -0.50   0.617    -1.000681    .5938066
            _Ivilid_36 |  -.2478603   .4030677    -0.61   0.539    -1.037858    .5421378
            _Ivilid_37 |   .1207323   .1533274     0.79   0.431    -.1797838    .4212485
            _Ivilid_38 |   .0652834   .4323687     0.15   0.880    -.7821437    .9127106
            _Ivilid_39 |   .3467274   .1173219     2.96   0.003     .1167806    .5766742
            _Ivilid_40 |  -.1595717   .2467039    -0.65   0.518    -.6431026    .3239591
            _Ivilid_41 |  -.1879482   .2441499    -0.77   0.441    -.6664733    .2905769
            _Ivilid_42 |  -.0298218   .0853182    -0.35   0.727    -.1970423    .1373988
            _Ivilid_43 |   .6555577   .1342187     4.88   0.000     .3924938    .9186216
            _Ivilid_44 |   .0745597   .1648755     0.45   0.651    -.2485903    .3977096
            _Ivilid_45 |    .278808   .3468003     0.80   0.421     -.400908    .9585241
            _Ivilid_46 |  -.0192146   .2411832    -0.08   0.937     -.491925    .4534958
            _Ivilid_47 |          0  (omitted)
                 _cons |  -.0436218   .3131729    -0.14   0.889    -.6574294    .5701858
----------------------------------------------------------------------------------------
Instrumented:  network_rate_pretakeup pre_takeup_rate
Instruments:   male age agpop ricearea_2010 literacy intensive _Ivilid_2 _Ivilid_3
               _Ivilid_4 _Ivilid_6 _Ivilid_7 _Ivilid_8 _Ivilid_9 _Ivilid_10 _Ivilid_11
               _Ivilid_12 _Ivilid_13 _Ivilid_14 _Ivilid_15 _Ivilid_16 _Ivilid_17
               _Ivilid_18 _Ivilid_19 _Ivilid_20 _Ivilid_21 _Ivilid_22 _Ivilid_24
               _Ivilid_25 _Ivilid_26 _Ivilid_27 _Ivilid_28 _Ivilid_29 _Ivilid_30
               _Ivilid_31 _Ivilid_32 _Ivilid_33 _Ivilid_34 _Ivilid_35 _Ivilid_36
               _Ivilid_37 _Ivilid_38 _Ivilid_39 _Ivilid_40 _Ivilid_41 _Ivilid_42
               _Ivilid_43 _Ivilid_44 _Ivilid_45 _Ivilid_46 inter_pre_takeup_iv default

. outreg2 using `outputfile7'
Table7.xls
dir : seeout

. 
. *Table 7, reduced form estimation, columns 4,6,8
. reg takeup_survey inter_pre_takeup_iv default inter_pre_none_iv inter_prenetwork_none_iv1 info_none mal
> e age agpop ricearea_2010 literacy intensive _Ivilid* if delay == 1 & info_takeup_rate ~= 1, cluster(ad
> dress)
note: _Ivilid_5 omitted because of collinearity
note: _Ivilid_23 omitted because of collinearity
note: _Ivilid_32 omitted because of collinearity

Linear regression                                      Number of obs =    1930
                                                       F( 50,   165) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0936
                                                       Root MSE      =   .4804

                                           (Std. Err. adjusted for 166 clusters in address)
-------------------------------------------------------------------------------------------
                          |               Robust
            takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
      inter_pre_takeup_iv |   .3231551   .0858161     3.77   0.000     .1537158    .4925944
                  default |   .0357121   .0587013     0.61   0.544    -.0801905    .1516148
        inter_pre_none_iv |  -.0465792   .0693575    -0.67   0.503    -.1835219    .0903634
inter_prenetwork_none_iv1 |  -.2461567   .1139867    -2.16   0.032    -.4712173   -.0210962
                info_none |   .0283827    .037277     0.76   0.448    -.0452186    .1019841
                     male |   .0430229   .0559405     0.77   0.443    -.0674285    .1534743
                      age |   .0050843   .0010835     4.69   0.000     .0029449    .0072236
                    agpop |  -.0072801   .0061832    -1.18   0.241    -.0194885    .0049284
            ricearea_2010 |   .0045053   .0007383     6.10   0.000     .0030476     .005963
                 literacy |   .0908608    .029114     3.12   0.002     .0333769    .1483447
                intensive |   .0331494   .0234619     1.41   0.160    -.0131749    .0794736
                _Ivilid_2 |  -.4409642    .146205    -3.02   0.003    -.7296381   -.1522903
                _Ivilid_3 |  -.3952232   .0759601    -5.20   0.000    -.5452023   -.2452441
                _Ivilid_4 |   -.310935   .0848183    -3.67   0.000    -.4784041   -.1434658
                _Ivilid_5 |          0  (omitted)
                _Ivilid_6 |  -.0138265   .1759778    -0.08   0.937    -.3612852    .3336322
                _Ivilid_7 |  -.2760231   .0666332    -4.14   0.000    -.4075868   -.1444594
                _Ivilid_8 |  -.2257033   .0931379    -2.42   0.016    -.4095991   -.0418076
                _Ivilid_9 |  -.3006821   .1440724    -2.09   0.038    -.5851453   -.0162188
               _Ivilid_10 |  -.1970848   .0744248    -2.65   0.009    -.3440325   -.0501371
               _Ivilid_11 |  -.3492341   .0771423    -4.53   0.000    -.5015473   -.1969208
               _Ivilid_12 |  -.1596019   .0871636    -1.83   0.069    -.3317016    .0124978
               _Ivilid_13 |  -.1643676    .086413    -1.90   0.059    -.3349854    .0062502
               _Ivilid_14 |  -.3280997   .0880394    -3.73   0.000    -.5019287   -.1542706
               _Ivilid_15 |   .0950132   .0537174     1.77   0.079     -.011049    .2010753
               _Ivilid_16 |  -.0449418   .0524881    -0.86   0.393    -.1485767    .0586931
               _Ivilid_17 |  -.3766451   .0692814    -5.44   0.000    -.5134375   -.2398528
               _Ivilid_18 |  -.1149216   .1313682    -0.87   0.383     -.374301    .1444579
               _Ivilid_19 |  -.3504187   .0717128    -4.89   0.000    -.4920118   -.2088257
               _Ivilid_20 |  -.1696503   .1082674    -1.57   0.119    -.3834184    .0441178
               _Ivilid_21 |  -.3831832   .0747461    -5.13   0.000    -.5307654    -.235601
               _Ivilid_22 |  -.2903753   .1304721    -2.23   0.027    -.5479854   -.0327652
               _Ivilid_23 |          0  (omitted)
               _Ivilid_24 |  -.2171298   .1339151    -1.62   0.107    -.4815379    .0472782
               _Ivilid_25 |  -.0202657   .1291427    -0.16   0.875    -.2752509    .2347194
               _Ivilid_26 |  -.1544862   .0530093    -2.91   0.004    -.2591502   -.0498221
               _Ivilid_27 |  -.0066622    .055051    -0.12   0.904    -.1153574     .102033
               _Ivilid_28 |   -.128751   .1072475    -1.20   0.232    -.3405054    .0830034
               _Ivilid_29 |  -.3906611    .087657    -4.46   0.000    -.5637351   -.2175871
               _Ivilid_30 |  -.2982076   .1160274    -2.57   0.011    -.5272974   -.0691177
               _Ivilid_31 |  -.3195675   .0563144    -5.67   0.000    -.4307573   -.2083777
               _Ivilid_32 |          0  (omitted)
               _Ivilid_33 |  -.0376374    .052365    -0.72   0.473    -.1410292    .0657543
               _Ivilid_34 |  -.2156092   .0585683    -3.68   0.000    -.3312491   -.0999694
               _Ivilid_35 |  -.3807304   .0536019    -7.10   0.000    -.4865645   -.2748964
               _Ivilid_36 |  -.3990954   .0676239    -5.90   0.000    -.5326151   -.2655758
               _Ivilid_37 |  -.3690343   .0782738    -4.71   0.000    -.5235816    -.214487
               _Ivilid_38 |  -.1709619   .1563415    -1.09   0.276    -.4796497    .1377258
               _Ivilid_39 |  -.2167806   .0678738    -3.19   0.002    -.3507938   -.0827674
               _Ivilid_40 |  -.3222478    .092281    -3.49   0.001    -.5044517   -.1400439
               _Ivilid_41 |  -.2080543   .0678265    -3.07   0.003    -.3419741   -.0741345
               _Ivilid_42 |  -.4226375   .0732094    -5.77   0.000    -.5671855   -.2780894
               _Ivilid_43 |   .1743601    .056842     3.07   0.003     .0621286    .2865915
               _Ivilid_44 |  -.3003105   .0798297    -3.76   0.000      -.45793   -.1426911
               _Ivilid_45 |   -.090009   .1142905    -0.79   0.432    -.3156693    .1356514
               _Ivilid_46 |  -.3189219   .0686405    -4.65   0.000    -.4544488    -.183395
               _Ivilid_47 |  -.2951212    .089495    -3.30   0.001    -.4718242   -.1184182
                    _cons |   .2587051   .0895484     2.89   0.004     .0818967    .4355135
-------------------------------------------------------------------------------------------

. outreg2 using `outputfile7'
Table7.xls
dir : seeout

. reg takeup_survey inter_pre_takeup_iv default male age agpop ricearea_2010 literacy intensive _Ivilid* 
> if delay == 1 & info_takeup_list == 1, cluster(address)
note: _Ivilid_5 omitted because of collinearity
note: _Ivilid_23 omitted because of collinearity
note: _Ivilid_43 omitted because of collinearity

Linear regression                                      Number of obs =     675
                                                       F( 47,   163) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1445
                                                       Root MSE      =  .48079

                                     (Std. Err. adjusted for 164 clusters in address)
-------------------------------------------------------------------------------------
                    |               Robust
      takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
inter_pre_takeup_iv |   .3381578   .0875667     3.86   0.000     .1652465    .5110691
            default |   .0393439   .0604844     0.65   0.516      -.08009    .1587779
               male |   .0407833   .0847021     0.48   0.631    -.1264715    .2080381
                age |   .0059498   .0019267     3.09   0.002     .0021452    .0097543
              agpop |  -.0003831   .0094286    -0.04   0.968    -.0190011    .0182348
      ricearea_2010 |   .0043585   .0014292     3.05   0.003     .0015364    .0071806
           literacy |   .0966077   .0527417     1.83   0.069    -.0075374    .2007528
          intensive |   .0379065   .0397246     0.95   0.341    -.0405348    .1163477
          _Ivilid_2 |   .0524797   .2319245     0.23   0.821    -.4054842    .5104435
          _Ivilid_3 |   -.133778   .2140491    -0.62   0.533    -.5564446    .2888885
          _Ivilid_4 |  -.1005248   .2215077    -0.45   0.651    -.5379194    .3368698
          _Ivilid_5 |          0  (omitted)
          _Ivilid_6 |   .3138691   .2568124     1.22   0.223     -.193239    .8209771
          _Ivilid_7 |  -.1009113   .1947258    -0.52   0.605    -.4854217    .2835991
          _Ivilid_8 |  -.0775611   .2175257    -0.36   0.722    -.5070927    .3519704
          _Ivilid_9 |   -.004796   .2880688    -0.02   0.987    -.5736238    .5640318
         _Ivilid_10 |   .1200742     .22249     0.54   0.590    -.3192601    .5594085
         _Ivilid_11 |  -.1437586   .2287527    -0.63   0.531    -.5954593    .3079421
         _Ivilid_12 |   .0129947   .2358908     0.06   0.956     -.452801    .4787905
         _Ivilid_13 |   .0516227   .2866364     0.18   0.857    -.5143766     .617622
         _Ivilid_14 |   .0898124   .2119905     0.42   0.672    -.3287892     .508414
         _Ivilid_15 |   .4315637   .2445099     1.77   0.079    -.0512516     .914379
         _Ivilid_16 |   .3327837   .1884996     1.77   0.079    -.0394322    .7049996
         _Ivilid_17 |  -.0617208   .2184089    -0.28   0.778    -.4929963    .3695548
         _Ivilid_18 |   .2177525   .2010028     1.08   0.280    -.1791526    .6146575
         _Ivilid_19 |   .0568142    .216391     0.26   0.793    -.3704768    .4841052
         _Ivilid_20 |   .0342804   .2403449     0.14   0.887    -.4403106    .5088713
         _Ivilid_21 |  -.1720096   .2297763    -0.75   0.455    -.6257316    .2817124
         _Ivilid_22 |  -.0019266   .2505016    -0.01   0.994    -.4965733    .4927201
         _Ivilid_23 |          0  (omitted)
         _Ivilid_24 |   .0117147   .2315133     0.05   0.960    -.4454372    .4688665
         _Ivilid_25 |   .2218615   .2053404     1.08   0.282    -.1836088    .6273317
         _Ivilid_26 |   .3249016   .1929101     1.68   0.094    -.0560233    .7058266
         _Ivilid_27 |   .3358649   .1945305     1.73   0.086    -.0482598    .7199897
         _Ivilid_28 |   .1783878   .2406145     0.74   0.460    -.2967356    .6535112
         _Ivilid_29 |  -.0500255   .2101268    -0.24   0.812    -.4649471    .3648961
         _Ivilid_30 |   .0750343    .233629     0.32   0.748    -.3862952    .5363639
         _Ivilid_31 |  -.0560268   .1999958    -0.28   0.780    -.4509435    .3388899
         _Ivilid_32 |   .2034106   .1913898     1.06   0.289    -.1745124    .5813336
         _Ivilid_33 |   .3746229   .1897413     1.97   0.050    -.0000448    .7492907
         _Ivilid_34 |   .1252933   .3134556     0.40   0.690    -.4936639    .7442505
         _Ivilid_35 |   .0837755   .1934333     0.43   0.666    -.2981826    .4657337
         _Ivilid_36 |  -.0364449   .2008178    -0.18   0.856    -.4329846    .3600948
         _Ivilid_37 |  -.1980563   .2404955    -0.82   0.411    -.6729446     .276832
         _Ivilid_38 |   .1625054   .1998308     0.81   0.417    -.2320855    .5570962
         _Ivilid_39 |    .109845   .2191072     0.50   0.617    -.3228095    .5424996
         _Ivilid_40 |   .0640712    .254849     0.25   0.802      -.43916    .5673023
         _Ivilid_41 |   .1468916   .2610855     0.56   0.574    -.3686543    .6624375
         _Ivilid_42 |  -.2180076   .2220071    -0.98   0.328    -.6563882     .220373
         _Ivilid_43 |          0  (omitted)
         _Ivilid_44 |  -.1213608   .2023484    -0.60   0.549    -.5209229    .2782013
         _Ivilid_45 |   .0254563    .242986     0.10   0.917    -.4543498    .5052624
         _Ivilid_46 |   .0772244   .2216692     0.35   0.728    -.3604891    .5149379
         _Ivilid_47 |   .1118766   .2345069     0.48   0.634    -.3511864    .5749396
              _cons |  -.1118318    .217388    -0.51   0.608    -.5410915    .3174279
-------------------------------------------------------------------------------------

. outreg2 using `outputfile7'
Table7.xls
dir : seeout

. reg takeup_survey inter_pre_takeup_iv default male age agpop ricearea_2010 literacy intensive _Ivilid* 
> if delay == 1 & info_none == 1, cluster(address)
note: _Ivilid_5 omitted because of collinearity
note: _Ivilid_23 omitted because of collinearity
note: _Ivilid_27 omitted because of collinearity

Linear regression                                      Number of obs =    1255
                                                       F( 47,   165) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0995
                                                       Root MSE      =  .48042

                                     (Std. Err. adjusted for 166 clusters in address)
-------------------------------------------------------------------------------------
                    |               Robust
      takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
inter_pre_takeup_iv |   .0840979   .0781451     1.08   0.283    -.0701954    .2383913
            default |  -.0169771    .043301    -0.39   0.696    -.1024725    .0685183
               male |   .0270358   .0734777     0.37   0.713    -.1180418    .1721135
                age |   .0042115   .0011918     3.53   0.001     .0018585    .0065646
              agpop |  -.0094014   .0071212    -1.32   0.189    -.0234618    .0046591
      ricearea_2010 |   .0045822   .0009792     4.68   0.000     .0026488    .0065157
           literacy |   .0898864   .0330289     2.72   0.007     .0246726    .1551003
          intensive |    .030988   .0333007     0.93   0.353    -.0347624    .0967383
          _Ivilid_2 |  -.5205166   .1490679    -3.49   0.001     -.814843   -.2261901
          _Ivilid_3 |  -.3431528   .0690447    -4.97   0.000    -.4794779   -.2068278
          _Ivilid_4 |  -.2238893   .0494061    -4.53   0.000     -.321439   -.1263396
          _Ivilid_5 |          0  (omitted)
          _Ivilid_6 |   .0149293   .1679298     0.09   0.929    -.3166389    .3464975
          _Ivilid_7 |  -.1709353   .0691344    -2.47   0.014    -.3074374   -.0344332
          _Ivilid_8 |  -.1205198   .0734088    -1.64   0.103    -.2654614    .0244218
          _Ivilid_9 |  -.2678543   .1416012    -1.89   0.060    -.5474382    .0117297
         _Ivilid_10 |   -.161717   .1053037    -1.54   0.127    -.3696336    .0461995
         _Ivilid_11 |  -.2622438   .0700678    -3.74   0.000    -.4005889   -.1238987
         _Ivilid_12 |  -.0576072   .1068465    -0.54   0.591    -.2685697    .1533553
         _Ivilid_13 |  -.0844948   .0661804    -1.28   0.203    -.2151643    .0461747
         _Ivilid_14 |  -.3436829     .08705    -3.95   0.000    -.5155583   -.1718075
         _Ivilid_15 |   .0973465   .1008103     0.97   0.336     -.101698    .2963911
         _Ivilid_16 |  -.0519983   .0220494    -2.36   0.020    -.0955337   -.0084629
         _Ivilid_17 |  -.3421068   .0666793    -5.13   0.000    -.4737614   -.2104521
         _Ivilid_18 |   -.101102   .1715921    -0.59   0.557    -.4399012    .2376972
         _Ivilid_19 |  -.3689319   .0787379    -4.69   0.000    -.5243956   -.2134682
         _Ivilid_20 |  -.0837507   .0889856    -0.94   0.348     -.259448    .0919465
         _Ivilid_21 |  -.2972639   .0823504    -3.61   0.000    -.4598603   -.1346676
         _Ivilid_22 |  -.2437706   .1304241    -1.87   0.063    -.5012859    .0137446
         _Ivilid_23 |          0  (omitted)
         _Ivilid_24 |  -.1505869    .135416    -1.11   0.268    -.4179584    .1167847
         _Ivilid_25 |   .0561486    .156947     0.36   0.721    -.2537347    .3660319
         _Ivilid_26 |  -.2117992   .0395006    -5.36   0.000     -.289791   -.1338074
         _Ivilid_27 |          0  (omitted)
         _Ivilid_28 |  -.1009526     .07396    -1.36   0.174    -.2469827    .0450775
         _Ivilid_29 |  -.3716775   .0863246    -4.31   0.000    -.5421208   -.2012343
         _Ivilid_30 |  -.3005286   .1512114    -1.99   0.049    -.5990872     -.00197
         _Ivilid_31 |  -.2593332   .0364753    -7.11   0.000    -.3313518   -.1873146
         _Ivilid_32 |    .076235    .056133     1.36   0.176    -.0345965    .1870665
         _Ivilid_33 |  -.0786841   .0367917    -2.14   0.034    -.1513273    -.006041
         _Ivilid_34 |  -.2039486   .1907065    -1.07   0.286    -.5804882     .172591
         _Ivilid_35 |  -.4522069    .035595   -12.70   0.000    -.5224873   -.3819265
         _Ivilid_36 |  -.3947295   .0995887    -3.96   0.000    -.5913619    -.198097
         _Ivilid_37 |  -.2475561   .0289332    -8.56   0.000    -.3046832    -.190429
         _Ivilid_38 |  -.1409272   .1944929    -0.72   0.470    -.5249428    .2430883
         _Ivilid_39 |  -.1970445   .1511365    -1.30   0.194    -.4954553    .1013663
         _Ivilid_40 |  -.3246429   .1477722    -2.20   0.029    -.6164111   -.0328747
         _Ivilid_41 |  -.2348986   .0928097    -2.53   0.012    -.4181463   -.0516509
         _Ivilid_42 |  -.3201387   .0417209    -7.67   0.000    -.4025143    -.237763
         _Ivilid_43 |   .3679241   .0244184    15.07   0.000     .3197114    .4161368
         _Ivilid_44 |  -.1679463   .1336692    -1.26   0.211     -.431869    .0959763
         _Ivilid_45 |   .0485278   .0908927     0.53   0.594    -.1309348    .2279904
         _Ivilid_46 |  -.3411177   .0370106    -9.22   0.000    -.4141931   -.2680423
         _Ivilid_47 |  -.3067837   .0755069    -4.06   0.000     -.455868   -.1576993
              _cons |   .3128523   .0961269     3.25   0.001     .1230549    .5026497
-------------------------------------------------------------------------------------

. outreg2 using `outputfile7'
Table7.xls
dir : seeout

. 
. 
. **********************************************************9. Network Structure*************************
> ***********************************
. local outputfile8 Table8.xls

. gen inter_net_allindegree = mean_allnetindegree*network_rate_preintensive
(314 missing values generated)

. gen inter_net_allpathout = mean_allnetpath_out_ind*network_rate_preintensive
(314 missing values generated)

. gen inter_net_alleigenvector = mean_allneteigenvector*network_rate_preintensive
(314 missing values generated)

. 
. gen inter_net_educindegree = mean_1steduc_indegree*network_rate_preintensive
(314 missing values generated)

. gen inter_net_educpathout = mean_1steduc_path_out_ind*network_rate_preintensive
(314 missing values generated)

. gen inter_net_educeigenvector = mean_1steduc_eigenvector*network_rate_preintensive
(314 missing values generated)

. 
. gen inter_net_indegree = indegree*network_rate_preintensive
(314 missing values generated)

. gen inter_net_pathin = path_in_ind*network_rate_preintensive
(314 missing values generated)

. gen inter_net_eigenvector = eigenvector*network_rate_preintensive
(314 missing values generated)

. 
. *1) degree
. reg takeup_survey network_rate_preintensive mean_1steduc_indegree inter_net_educindegree indegree inter
> _net_indegree mean_allnetindegree mean_allnetpath_out_ind inter_net_allindegree mean_allneteigenvector 
> male age agpop ricearea_2010 literacy intensive _Ivilid* if delay == 1 & info_none == 1, cluster(addres
> s)
note: _Ivilid_5 omitted because of collinearity
note: _Ivilid_23 omitted because of collinearity
note: _Ivilid_27 omitted because of collinearity

Linear regression                                      Number of obs =    1255
                                                       F( 54,   165) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1178
                                                       Root MSE      =  .47689

                                           (Std. Err. adjusted for 166 clusters in address)
-------------------------------------------------------------------------------------------
                          |               Robust
            takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
network_rate_preintensive |   .7933579   .2236905     3.55   0.001     .3516933    1.235023
    mean_1steduc_indegree |   .0121962   .0136203     0.90   0.372    -.0146963    .0390888
   inter_net_educindegree |  -.0952083   .0576818    -1.65   0.101    -.2090979    .0186814
                 indegree |   .0214411   .0095714     2.24   0.026      .002543    .0403392
       inter_net_indegree |  -.0811463   .0401092    -2.02   0.045    -.1603396   -.0019529
      mean_allnetindegree |   .0138772   .0142723     0.97   0.332    -.0143027    .0420572
  mean_allnetpath_out_ind |   .0122915   .0200129     0.61   0.540     -.027223    .0518059
    inter_net_allindegree |  -.0293505   .0558431    -0.53   0.600    -.1396096    .0809087
   mean_allneteigenvector |  -.0380208   .2780401    -0.14   0.891    -.5869959    .5109543
                     male |   .0284685   .0736094     0.39   0.699    -.1168692    .1738062
                      age |   .0040706    .001164     3.50   0.001     .0017724    .0063688
                    agpop |  -.0105626   .0068038    -1.55   0.122    -.0239964    .0028713
            ricearea_2010 |   .0047483   .0010204     4.65   0.000     .0027336     .006763
                 literacy |   .0854553   .0323568     2.64   0.009     .0215685    .1493421
                intensive |    .034873   .0331971     1.05   0.295    -.0306728    .1004188
                _Ivilid_2 |  -.4810278   .1505196    -3.20   0.002    -.7782206    -.183835
                _Ivilid_3 |  -.3095505   .0599999    -5.16   0.000     -.428017    -.191084
                _Ivilid_4 |  -.1910636   .0612396    -3.12   0.002    -.3119779   -.0701493
                _Ivilid_5 |          0  (omitted)
                _Ivilid_6 |   .0476854   .1627687     0.29   0.770    -.2736925    .3690633
                _Ivilid_7 |    -.14389   .0750661    -1.92   0.057    -.2921039     .004324
                _Ivilid_8 |  -.1059173   .0779534    -1.36   0.176     -.259832    .0479973
                _Ivilid_9 |  -.2503311   .1404409    -1.78   0.077    -.5276239    .0269618
               _Ivilid_10 |  -.1633811   .0969668    -1.68   0.094    -.3548367    .0280746
               _Ivilid_11 |  -.2148862   .0691744    -3.11   0.002    -.3514672   -.0783051
               _Ivilid_12 |  -.0344581   .0962224    -0.36   0.721     -.224444    .1555279
               _Ivilid_13 |  -.0559071   .0721633    -0.77   0.440    -.1983896    .0865755
               _Ivilid_14 |  -.3065021   .0884188    -3.47   0.001    -.4810802    -.131924
               _Ivilid_15 |   .1145199   .1240757     0.92   0.357    -.1304608    .3595006
               _Ivilid_16 |  -.0226943   .0343346    -0.66   0.510     -.090486    .0450975
               _Ivilid_17 |  -.3304599   .0648827    -5.09   0.000    -.4585673   -.2023525
               _Ivilid_18 |  -.0897698   .1674367    -0.54   0.593    -.4203644    .2408248
               _Ivilid_19 |  -.3452004   .0768704    -4.49   0.000    -.4969768    -.193424
               _Ivilid_20 |   -.049644   .0920146    -0.54   0.590    -.2313219    .1320339
               _Ivilid_21 |  -.2538724   .0741304    -3.42   0.001    -.4002388    -.107506
               _Ivilid_22 |  -.2107769   .1272497    -1.66   0.100    -.4620245    .0404707
               _Ivilid_23 |          0  (omitted)
               _Ivilid_24 |   -.125908     .13596    -0.93   0.356    -.3943537    .1425376
               _Ivilid_25 |   .1104521    .166927     0.66   0.509    -.2191362    .4400405
               _Ivilid_26 |  -.1791502   .0479608    -3.74   0.000    -.2738461   -.0844543
               _Ivilid_27 |          0  (omitted)
               _Ivilid_28 |  -.0639808   .0704102    -0.91   0.365     -.203002    .0750404
               _Ivilid_29 |  -.3328559   .0907447    -3.67   0.000    -.5120264   -.1536854
               _Ivilid_30 |  -.2533521   .1304666    -1.94   0.054    -.5109513    .0042471
               _Ivilid_31 |  -.2322933   .0254896    -9.11   0.000    -.2826212   -.1819654
               _Ivilid_32 |   .0823299   .0718237     1.15   0.253    -.0594821    .2241418
               _Ivilid_33 |   -.060466   .0543292    -1.11   0.267     -.167736     .046804
               _Ivilid_34 |  -.1407665   .1813989    -0.78   0.439    -.4989288    .2173958
               _Ivilid_35 |   -.405133   .0305843   -13.25   0.000    -.4655201    -.344746
               _Ivilid_36 |  -.3802261   .0951106    -4.00   0.000    -.5680168   -.1924353
               _Ivilid_37 |  -.2027219   .0372915    -5.44   0.000     -.276352   -.1290919
               _Ivilid_38 |  -.1225099   .2088206    -0.59   0.558    -.5348148    .2897949
               _Ivilid_39 |  -.1385701   .1699786    -0.82   0.416    -.4741837    .1970435
               _Ivilid_40 |  -.3100674   .1341795    -2.31   0.022    -.5749976   -.0451372
               _Ivilid_41 |  -.2071613   .1035346    -2.00   0.047    -.4115848   -.0027378
               _Ivilid_42 |  -.2981961   .0482767    -6.18   0.000    -.3935158   -.2028764
               _Ivilid_43 |   .4383353   .0542515     8.08   0.000     .3312187     .545452
               _Ivilid_44 |  -.1307824   .1248704    -1.05   0.296    -.3773322    .1157675
               _Ivilid_45 |   .0779436    .091581     0.85   0.396     -.102878    .2587653
               _Ivilid_46 |  -.2910875   .0449997    -6.47   0.000    -.3799369   -.2022381
               _Ivilid_47 |   -.268583   .0762754    -3.52   0.001    -.4191847   -.1179813
                    _cons |    .103586   .1194419     0.87   0.387    -.1322456    .3394176
-------------------------------------------------------------------------------------------

. test network_rate_preintensive inter_net_educindegree

 ( 1)  network_rate_preintensive = 0
 ( 2)  inter_net_educindegree = 0

       F(  2,   165) =    8.01
            Prob > F =    0.0005

. test mean_1steduc_indegree inter_net_educindegree

 ( 1)  mean_1steduc_indegree = 0
 ( 2)  inter_net_educindegree = 0

       F(  2,   165) =    1.70
            Prob > F =    0.1856

. test network_rate_preintensive inter_net_indegree

 ( 1)  network_rate_preintensive = 0
 ( 2)  inter_net_indegree = 0

       F(  2,   165) =    6.33
            Prob > F =    0.0023

. test indegree inter_net_indegree

 ( 1)  indegree = 0
 ( 2)  inter_net_indegree = 0

       F(  2,   165) =    2.93
            Prob > F =    0.0564

. outreg2 using `outputfile8'
Table8.xls
dir : seeout

. 
. *2) path
. reg takeup_survey network_rate_preintensive mean_1steduc_path_out_ind inter_net_educpathout path_in_ind
>  inter_net_pathin mean_allnetindegree mean_allnetpath_out_ind inter_net_allpathout mean_allneteigenvect
> or male age agpop ricearea_2010 literacy intensive _Ivilid* if delay == 1 & info_none == 1, cluster(add
> ress)
note: _Ivilid_5 omitted because of collinearity
note: _Ivilid_23 omitted because of collinearity
note: _Ivilid_27 omitted because of collinearity

Linear regression                                      Number of obs =    1255
                                                       F( 54,   165) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1230
                                                       Root MSE      =   .4755

                                           (Std. Err. adjusted for 166 clusters in address)
-------------------------------------------------------------------------------------------
                          |               Robust
            takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
network_rate_preintensive |   .7950016   .3110288     2.56   0.011     .1808921    1.409111
mean_1steduc_path_out_ind |   .0125423   .0199331     0.63   0.530    -.0268145    .0518991
    inter_net_educpathout |  -.1512639   .0824462    -1.83   0.068    -.3140495    .0115217
              path_in_ind |  -.0297054   .0177039    -1.68   0.095    -.0646607      .00525
         inter_net_pathin |  -.0702826   .0722632    -0.97   0.332    -.2129624    .0723972
      mean_allnetindegree |   .0065944   .0116273     0.57   0.571    -.0163631     .029552
  mean_allnetpath_out_ind |   .0385676   .0245951     1.57   0.119    -.0099941    .0871294
     inter_net_allpathout |  -.0586817   .1184341    -0.50   0.621    -.2925234      .17516
   mean_allneteigenvector |  -.0659644   .2764305    -0.24   0.812    -.6117614    .4798325
                     male |   .0310326    .072383     0.43   0.669    -.1118837     .173949
                      age |   .0038413   .0011598     3.31   0.001     .0015513    .0061313
                    agpop |  -.0104127   .0066271    -1.57   0.118    -.0234975    .0026721
            ricearea_2010 |   .0043266   .0010225     4.23   0.000     .0023078    .0063454
                 literacy |   .0848108   .0324409     2.61   0.010      .020758    .1488636
                intensive |   .0322124   .0329022     0.98   0.329    -.0327512     .097176
                _Ivilid_2 |  -.5526336    .146446    -3.77   0.000    -.8417832    -.263484
                _Ivilid_3 |  -.3912301   .0690484    -5.67   0.000    -.5275623   -.2548978
                _Ivilid_4 |  -.2637433   .0707723    -3.73   0.000    -.4034794   -.1240073
                _Ivilid_5 |          0  (omitted)
                _Ivilid_6 |  -.0488229   .1462008    -0.33   0.739    -.3374883    .2398425
                _Ivilid_7 |  -.2155897   .0826966    -2.61   0.010    -.3788696   -.0523097
                _Ivilid_8 |  -.1855701   .0797324    -2.33   0.021    -.3429974   -.0281427
                _Ivilid_9 |  -.3103706   .1545357    -2.01   0.046     -.615493   -.0052482
               _Ivilid_10 |  -.1898396   .1011104    -1.88   0.062    -.3894766    .0097974
               _Ivilid_11 |  -.3032568   .0672464    -4.51   0.000    -.4360311   -.1704825
               _Ivilid_12 |  -.1294651   .0853376    -1.52   0.131    -.2979596    .0390294
               _Ivilid_13 |  -.1344465   .0706364    -1.90   0.059    -.2739141    .0050212
               _Ivilid_14 |  -.3655257   .0867296    -4.21   0.000    -.5367685   -.1942829
               _Ivilid_15 |   .0617171   .1151909     0.54   0.593     -.165721    .2891553
               _Ivilid_16 |  -.1149249   .0391143    -2.94   0.004     -.192154   -.0376959
               _Ivilid_17 |  -.3888083   .0649565    -5.99   0.000    -.5170614   -.2605552
               _Ivilid_18 |  -.1385687   .1808399    -0.77   0.445    -.4956273      .21849
               _Ivilid_19 |  -.4262272     .08131    -5.24   0.000    -.5867693   -.2656851
               _Ivilid_20 |  -.1233013   .0935603    -1.32   0.189     -.308031    .0614283
               _Ivilid_21 |  -.3346911   .0863188    -3.88   0.000    -.5051228   -.1642594
               _Ivilid_22 |  -.2889722   .1234002    -2.34   0.020    -.5326191   -.0453253
               _Ivilid_23 |          0  (omitted)
               _Ivilid_24 |  -.1954258   .1415623    -1.38   0.169    -.4749329    .0840813
               _Ivilid_25 |   .0267399   .1588316     0.17   0.867    -.2868644    .3403443
               _Ivilid_26 |  -.2566718   .0484142    -5.30   0.000    -.3522631   -.1610806
               _Ivilid_27 |          0  (omitted)
               _Ivilid_28 |  -.1438279   .0932157    -1.54   0.125    -.3278773    .0402215
               _Ivilid_29 |  -.4130197   .0867553    -4.76   0.000    -.5843133    -.241726
               _Ivilid_30 |  -.3387192    .141296    -2.40   0.018    -.6177004    -.059738
               _Ivilid_31 |  -.2932185   .0246831   -11.88   0.000    -.3419539   -.2444831
               _Ivilid_32 |  -.0033273   .0920998    -0.04   0.971    -.1851733    .1785187
               _Ivilid_33 |  -.1754188   .0586374    -2.99   0.003    -.2911951   -.0596424
               _Ivilid_34 |  -.2437981   .1732613    -1.41   0.161    -.5858931    .0982969
               _Ivilid_35 |  -.4690396   .0368345   -12.73   0.000    -.5417673   -.3963118
               _Ivilid_36 |  -.4275155   .0947018    -4.51   0.000    -.6144991   -.2405319
               _Ivilid_37 |  -.2708619   .0351299    -7.71   0.000    -.3402239   -.2014999
               _Ivilid_38 |  -.1744874   .2049767    -0.85   0.396    -.5792027    .2302278
               _Ivilid_39 |  -.2225548   .1551726    -1.43   0.153    -.5289346    .0838251
               _Ivilid_40 |  -.3647659   .1509382    -2.42   0.017    -.6627851   -.0667466
               _Ivilid_41 |  -.2732074   .0936863    -2.92   0.004     -.458186   -.0882288
               _Ivilid_42 |  -.3698669   .0524521    -7.05   0.000    -.4734307   -.2663031
               _Ivilid_43 |    .343708   .0543119     6.33   0.000     .2364721    .4509439
               _Ivilid_44 |  -.2014372    .127101    -1.58   0.115    -.4523912    .0495168
               _Ivilid_45 |  -.0047455   .0934375    -0.05   0.960    -.1892328    .1797417
               _Ivilid_46 |  -.3760528   .0433491    -8.67   0.000    -.4616432   -.2904624
               _Ivilid_47 |  -.3414568   .0690315    -4.95   0.000    -.4777558   -.2051578
                    _cons |   .3080252   .1350326     2.28   0.024     .0414107    .5746397
-------------------------------------------------------------------------------------------

. test network_rate_preintensive inter_net_educpathout

 ( 1)  network_rate_preintensive = 0
 ( 2)  inter_net_educpathout = 0

       F(  2,   165) =    4.82
            Prob > F =    0.0092

. test mean_1steduc_path_out_ind inter_net_educpathout

 ( 1)  mean_1steduc_path_out_ind = 0
 ( 2)  inter_net_educpathout = 0

       F(  2,   165) =    2.50
            Prob > F =    0.0848

. test network_rate_preintensive inter_net_pathin

 ( 1)  network_rate_preintensive = 0
 ( 2)  inter_net_pathin = 0

       F(  2,   165) =    3.27
            Prob > F =    0.0404

. test path_in_ind inter_net_pathin

 ( 1)  path_in_ind = 0
 ( 2)  inter_net_pathin = 0

       F(  2,   165) =    5.66
            Prob > F =    0.0042

. outreg2 using `outputfile8'
Table8.xls
dir : seeout

. 
. *3)centrality
. reg takeup_survey network_rate_preintensive mean_1steduc_eigenvector inter_net_educeigenvector eigenvec
> tor inter_net_eigenvector mean_allnetindegree mean_allnetpath_out_ind mean_allneteigenvector inter_net_
> alleigenvector male age agpop ricearea_2010 literacy intensive _Ivilid* if delay == 1 & info_none == 1,
>  cluster(address)
note: _Ivilid_5 omitted because of collinearity
note: _Ivilid_23 omitted because of collinearity
note: _Ivilid_27 omitted because of collinearity

Linear regression                                      Number of obs =    1255
                                                       F( 54,   165) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1142
                                                       Root MSE      =  .47786

                                           (Std. Err. adjusted for 166 clusters in address)
-------------------------------------------------------------------------------------------
                          |               Robust
            takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
network_rate_preintensive |    .344747   .1580549     2.18   0.031     .0326762    .6568178
 mean_1steduc_eigenvector |   .2426548   .2922581     0.83   0.408    -.3343928    .8197025
inter_net_educeigenvector |  -2.508577   1.364436    -1.84   0.068    -5.202581    .1854267
              eigenvector |  -.0250102   .2726846    -0.09   0.927    -.5634111    .5133906
    inter_net_eigenvector |   .1031085   1.116304     0.09   0.927    -2.100972    2.307189
      mean_allnetindegree |   .0063054   .0117773     0.54   0.593    -.0169481     .029559
  mean_allnetpath_out_ind |    .011945   .0198746     0.60   0.549    -.0272964    .0511864
   mean_allneteigenvector |   .0052085   .3357353     0.02   0.988    -.6576826    .6680997
 inter_net_alleigenvector |   .6851909   1.228972     0.56   0.578    -1.741347    3.111729
                     male |   .0296901   .0738833     0.40   0.688    -.1161885    .1755686
                      age |   .0039794   .0011573     3.44   0.001     .0016943    .0062645
                    agpop |  -.0093406   .0067481    -1.38   0.168    -.0226644    .0039832
            ricearea_2010 |   .0044784   .0010149     4.41   0.000     .0024746    .0064822
                 literacy |   .0921932   .0324538     2.84   0.005     .0281149    .1562715
                intensive |   .0354827   .0334215     1.06   0.290    -.0305061    .1014716
                _Ivilid_2 |   -.463664   .1481477    -3.13   0.002    -.7561736   -.1711544
                _Ivilid_3 |  -.2922111   .0665982    -4.39   0.000    -.4237056   -.1607165
                _Ivilid_4 |  -.1889692   .0672669    -2.81   0.006    -.3217841   -.0561543
                _Ivilid_5 |          0  (omitted)
                _Ivilid_6 |   .0784339   .1708579     0.46   0.647    -.2589158    .4157836
                _Ivilid_7 |  -.1247481   .0794176    -1.57   0.118    -.2815538    .0320577
                _Ivilid_8 |  -.1069713   .0836109    -1.28   0.203    -.2720565    .0581139
                _Ivilid_9 |  -.2390423   .1480143    -1.61   0.108    -.5312886     .053204
               _Ivilid_10 |  -.1280459   .0937961    -1.37   0.174    -.3132412    .0571495
               _Ivilid_11 |  -.2143899   .0709299    -3.02   0.003    -.3544372   -.0743426
               _Ivilid_12 |   -.044262   .0989351    -0.45   0.655    -.2396041    .1510801
               _Ivilid_13 |  -.0455349   .0712402    -0.64   0.524    -.1861947    .0951249
               _Ivilid_14 |   -.294204   .0901733    -3.26   0.001    -.4722463   -.1161617
               _Ivilid_15 |   .1464917   .1252132     1.17   0.244    -.1007349    .3937183
               _Ivilid_16 |   -.023894   .0431602    -0.55   0.581    -.1091115    .0613234
               _Ivilid_17 |  -.3137476   .0662553    -4.74   0.000    -.4445652   -.1829301
               _Ivilid_18 |   -.057302   .1767791    -0.32   0.746    -.4063426    .2917387
               _Ivilid_19 |  -.3315191   .0846292    -3.92   0.000    -.4986148   -.1644234
               _Ivilid_20 |  -.0422004   .0905474    -0.47   0.642    -.2209813    .1365805
               _Ivilid_21 |  -.2563328   .0752085    -3.41   0.001    -.4048278   -.1078377
               _Ivilid_22 |   -.202276   .1297904    -1.56   0.121    -.4585401    .0539881
               _Ivilid_23 |          0  (omitted)
               _Ivilid_24 |  -.1172422   .1343764    -0.87   0.384    -.3825611    .1480767
               _Ivilid_25 |   .1109697   .1659549     0.67   0.505    -.2166992    .4386385
               _Ivilid_26 |  -.1461748   .0539208    -2.71   0.007    -.2526386   -.0397111
               _Ivilid_27 |          0  (omitted)
               _Ivilid_28 |  -.0390301   .0805155    -0.48   0.628    -.1980035    .1199433
               _Ivilid_29 |  -.3383428   .0878082    -3.85   0.000    -.5117153   -.1649702
               _Ivilid_30 |  -.2350384   .1402869    -1.68   0.096    -.5120272    .0419505
               _Ivilid_31 |  -.2372279   .0282049    -8.41   0.000    -.2929168   -.1815389
               _Ivilid_32 |   .0842822   .0913119     0.92   0.357    -.0960083    .2645727
               _Ivilid_33 |  -.0721071   .0558645    -1.29   0.199    -.1824086    .0381943
               _Ivilid_34 |  -.1247456   .1774024    -0.70   0.483    -.4750169    .2255257
               _Ivilid_35 |  -.3906085   .0335225   -11.65   0.000    -.4567969   -.3244202
               _Ivilid_36 |  -.3643249   .0999912    -3.64   0.000     -.561752   -.1668978
               _Ivilid_37 |  -.1865129   .0404433    -4.61   0.000     -.266366   -.1066599
               _Ivilid_38 |  -.1128411   .2047426    -0.55   0.582    -.5170943     .291412
               _Ivilid_39 |   -.142746   .1648838    -0.87   0.388    -.4683002    .1828081
               _Ivilid_40 |  -.2927426   .1470713    -1.99   0.048    -.5831269   -.0023583
               _Ivilid_41 |  -.2068458   .1037757    -1.99   0.048    -.4117453   -.0019463
               _Ivilid_42 |   -.285364   .0525011    -5.44   0.000    -.3890247   -.1817034
               _Ivilid_43 |   .4361817   .0549782     7.93   0.000     .3276302    .5447332
               _Ivilid_44 |  -.1264913   .1288016    -0.98   0.328     -.380803    .1278205
               _Ivilid_45 |   .0823554     .09174     0.90   0.371    -.0987802     .263491
               _Ivilid_46 |  -.2936401    .046833    -6.27   0.000    -.3861093   -.2011709
               _Ivilid_47 |  -.2696858   .0871143    -3.10   0.002    -.4416882   -.0976833
                    _cons |   .1894605   .1124097     1.69   0.094    -.0324863    .4114074
-------------------------------------------------------------------------------------------

. test network_rate_preintensive inter_net_educeigenvector

 ( 1)  network_rate_preintensive = 0
 ( 2)  inter_net_educeigenvector = 0

       F(  2,   165) =    4.62
            Prob > F =    0.0112

. test mean_1steduc_eigenvector inter_net_educeigenvector

 ( 1)  mean_1steduc_eigenvector = 0
 ( 2)  inter_net_educeigenvector = 0

       F(  2,   165) =    2.15
            Prob > F =    0.1201

. test network_rate_preintensive inter_net_eigenvector

 ( 1)  network_rate_preintensive = 0
 ( 2)  inter_net_eigenvector = 0

       F(  2,   165) =    2.69
            Prob > F =    0.0706

. test eigenvector inter_net_eigenvector

 ( 1)  eigenvector = 0
 ( 2)  inter_net_eigenvector = 0

       F(  2,   165) =    0.01
            Prob > F =    0.9950

. outreg2 using `outputfile8'
Table8.xls
dir : seeout

. 
. *4) all together
. reg takeup_survey network_rate_preintensive mean_1steduc_indegree inter_net_educindegree indegree inter
> _net_indegree mean_1steduc_path_out_ind inter_net_educpathout path_in_ind inter_net_pathin mean_1steduc
> _eigenvector inter_net_educeigenvector eigenvector inter_net_eigenvector mean_allnetindegree mean_allne
> tpath_out_ind mean_allneteigenvector inter_net_allindegree inter_net_allpathout inter_net_alleigenvecto
> r male age agpop ricearea_2010 literacy intensive _Ivilid* if delay == 1 & info_none == 1, cluster(addr
> ess)
note: _Ivilid_5 omitted because of collinearity
note: _Ivilid_23 omitted because of collinearity
note: _Ivilid_27 omitted because of collinearity

Linear regression                                      Number of obs =    1255
                                                       F( 64,   165) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1280
                                                       Root MSE      =  .47612

                                           (Std. Err. adjusted for 166 clusters in address)
-------------------------------------------------------------------------------------------
                          |               Robust
            takeup_survey |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
network_rate_preintensive |    1.13235   .3488948     3.25   0.001     .4434761    1.821224
    mean_1steduc_indegree |   .0088512   .0316501     0.28   0.780    -.0536402    .0713426
   inter_net_educindegree |  -.0350358   .1295475    -0.27   0.787    -.2908202    .2207486
                 indegree |    .021594   .0104876     2.06   0.041     .0008868    .0423012
       inter_net_indegree |  -.0935912   .0417677    -2.24   0.026    -.1760593   -.0111231
mean_1steduc_path_out_ind |  -.0012724   .0419836    -0.03   0.976    -.0841668    .0816219
    inter_net_educpathout |  -.0574096   .1639504    -0.35   0.727    -.3811208    .2663016
              path_in_ind |  -.0246591   .0182017    -1.35   0.177    -.0605974    .0112792
         inter_net_pathin |  -.0824448    .071036    -1.16   0.247    -.2227016     .057812
 mean_1steduc_eigenvector |   .0449762   .7136945     0.06   0.950    -1.364175    1.454127
inter_net_educeigenvector |  -1.061321   3.117494    -0.34   0.734    -7.216643    5.094001
              eigenvector |  -.2138729   .2868698    -0.75   0.457    -.7802817    .3525359
    inter_net_eigenvector |   1.052041   1.171233     0.90   0.370    -1.260494    3.364576
      mean_allnetindegree |   .0101342   .0151578     0.67   0.505     -.019794    .0400624
  mean_allnetpath_out_ind |   .0388891   .0265726     1.46   0.145     -.013577    .0913552
   mean_allneteigenvector |   -.028429    .341729    -0.08   0.934    -.7031544    .6462964
    inter_net_allindegree |  -.0310362    .055865    -0.56   0.579    -.1413387    .0792663
     inter_net_allpathout |  -.0946553   .1325779    -0.71   0.476    -.3564231    .1671126
 inter_net_alleigenvector |   .6254184   1.316482     0.48   0.635    -1.973903     3.22474
                     male |   .0319827   .0724176     0.44   0.659     -.111002    .1749673
                      age |   .0037993   .0011719     3.24   0.001     .0014853    .0061132
                    agpop |  -.0107379   .0065732    -1.63   0.104    -.0237163    .0022405
            ricearea_2010 |   .0046541   .0010149     4.59   0.000     .0026502     .006658
                 literacy |   .0800227   .0322942     2.48   0.014     .0162595    .1437858
                intensive |   .0320619   .0329842     0.97   0.332    -.0330637    .0971874
                _Ivilid_2 |  -.5244476   .1574896    -3.33   0.001    -.8354023   -.2134929
                _Ivilid_3 |  -.3691372   .0735395    -5.02   0.000     -.514337   -.2239375
                _Ivilid_4 |  -.2309535    .077667    -2.97   0.003    -.3843028   -.0776043
                _Ivilid_5 |          0  (omitted)
                _Ivilid_6 |  -.0067159   .1644742    -0.04   0.967    -.3314613    .3180295
                _Ivilid_7 |   -.185788   .0934322    -1.99   0.048    -.3702649   -.0013111
                _Ivilid_8 |  -.1540084   .0842945    -1.83   0.070    -.3204433    .0124265
                _Ivilid_9 |  -.2815121   .1526991    -1.84   0.067    -.5830083     .019984
               _Ivilid_10 |  -.1823758   .1013475    -1.80   0.074    -.3824809    .0177294
               _Ivilid_11 |  -.2746687   .0704635    -3.90   0.000     -.413795   -.1355423
               _Ivilid_12 |   -.089009   .0894793    -0.99   0.321    -.2656811    .0876631
               _Ivilid_13 |  -.1086732    .075585    -1.44   0.152    -.2579118    .0405654
               _Ivilid_14 |  -.3393312   .0925996    -3.66   0.000     -.522164   -.1564984
               _Ivilid_15 |   .0781664   .1206373     0.65   0.518    -.1600253    .3163581
               _Ivilid_16 |  -.0697415   .0519616    -1.34   0.181    -.1723369    .0328539
               _Ivilid_17 |  -.3630972   .0694568    -5.23   0.000    -.5002359   -.2259585
               _Ivilid_18 |  -.1238596   .1827897    -0.68   0.499    -.4847679    .2370487
               _Ivilid_19 |  -.4036412   .0884819    -4.56   0.000     -.578344   -.2289385
               _Ivilid_20 |  -.0922541   .0987081    -0.93   0.351    -.2871479    .1026396
               _Ivilid_21 |  -.3011382   .0931385    -3.23   0.001     -.485035   -.1172414
               _Ivilid_22 |  -.2604751   .1222793    -2.13   0.035    -.5019089   -.0190413
               _Ivilid_23 |          0  (omitted)
               _Ivilid_24 |  -.1768579   .1425424    -1.24   0.216    -.4583001    .1045844
               _Ivilid_25 |   .0661353   .1672254     0.40   0.693    -.2640421    .3963127
               _Ivilid_26 |  -.2226111   .0690371    -3.22   0.002    -.3589211    -.086301
               _Ivilid_27 |          0  (omitted)
               _Ivilid_28 |  -.1184967   .0918579    -1.29   0.199    -.2998651    .0628718
               _Ivilid_29 |  -.3715369   .0961575    -3.86   0.000    -.5613945   -.1816792
               _Ivilid_30 |  -.3134531   .1298992    -2.41   0.017     -.569932   -.0569742
               _Ivilid_31 |  -.2654701   .0386299    -6.87   0.000    -.3417427   -.1891975
               _Ivilid_32 |   -.004075   .1059607    -0.04   0.969    -.2132886    .2051387
               _Ivilid_33 |  -.1382614   .0679018    -2.04   0.043    -.2723299   -.0041929
               _Ivilid_34 |  -.1966674   .1766747    -1.11   0.267    -.5455021    .1521673
               _Ivilid_35 |   -.455726   .0475418    -9.59   0.000    -.5495948   -.3618572
               _Ivilid_36 |  -.4094001   .0974451    -4.20   0.000    -.6018001   -.2170002
               _Ivilid_37 |   -.245627   .0535968    -4.58   0.000     -.351451    -.139803
               _Ivilid_38 |  -.1458101    .209663    -0.70   0.488    -.5597782    .2681581
               _Ivilid_39 |  -.1884394   .1776676    -1.06   0.290    -.5392343    .1623556
               _Ivilid_40 |  -.3434407   .1489696    -2.31   0.022     -.637573   -.0493083
               _Ivilid_41 |  -.2455898   .1002673    -2.45   0.015    -.4435621   -.0476175
               _Ivilid_42 |   -.344198   .0659479    -5.22   0.000    -.4744085   -.2139874
               _Ivilid_43 |   .3896668   .0718087     5.43   0.000     .2478843    .5314492
               _Ivilid_44 |   -.170805   .1265643    -1.35   0.179    -.4206995    .0790894
               _Ivilid_45 |   .0297598   .0949708     0.31   0.754    -.1577549    .2172745
               _Ivilid_46 |  -.3390795   .0560621    -6.05   0.000     -.449771   -.2283881
               _Ivilid_47 |  -.3126267   .0791769    -3.95   0.000    -.4689572   -.1562963
                    _cons |   .2073623   .1405876     1.47   0.142    -.0702204    .4849449
-------------------------------------------------------------------------------------------

. outreg2 using `outputfile8'
Table8.xls
dir : seeout

. 
. 
end of do-file

. codebook address

---------------------------------------------------------------------------------------------------------
address                                                                                   Natural Village
---------------------------------------------------------------------------------------------------------

                  type:  string (str29), but longest is str22

         unique values:  173                      missing "":  0/4902

              examples:  "dukou42"
                         "helinxinzhi"
                         "mazhoudengjia"
                         "xinguang3"

